[
    {
        "input": "检查是否混合痔该需要如何花销呢",
        "cypher": "MATCH (m:Disease {name:'混合痔'})-[:need_check]->(n:Check) RETURN n.name AS name"
    },
    {
        "input": "肾结石什么导致的？",
        "cypher": "MATCH (m:Disease {name: '肾结石'}) RETURN m.cause"
    },
    {
        "input": "前列腺钙化对身体会有什么危害？",
        "cypher": "MATCH (m:Disease {name:'前列腺钙化'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "电解质紊乱怎么办",
        "cypher": "MATCH (d:Disease {name: '电解质紊乱'}) RETURN d.cure_way"
    },
    {
        "input": "肾虚的临床表现有哪些",
        "cypher": "MATCH (m:Disease {name:'肾虚'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "放环后月经量少正常吗？",
        "cypher": "MATCH (m:Disease {name:'月经量少'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "患上肠气肿综合征要怎么去治疗效果会好点那？",
        "cypher": "MATCH (d:Disease {name: '肠气肿综合征'}) RETURN d.cure_way"
    },
    {
        "input": "鉴定前列腺囊肿要花多少钱",
        "cypher": "MATCH (n:Disease {name: '前列腺囊肿'})-[:need_check]->(m:Check) RETURN m.name AS name, m.cost_money AS cost_money"
    },
    {
        "input": "纵隔肿瘤这种病很严重吗？",
        "cypher": "MATCH (m:Disease {name:'纵隔肿瘤'}) RETURN m.cause"
    },
    {
        "input": "我刚22就患有肝硬化得了这病该怎么办才好呢？",
        "cypher": "MATCH (d:Disease {name: '肝硬化'}) RETURN d.cure_way"
    },
    {
        "input": "肝脓肿手术后保养吃哪些好",
        "cypher": "MATCH (v1:Disease {name: '肝脓肿'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "卵巢早衰有哪些好的食疗方法",
        "cypher": "MATCH (v1:Disease {name: '卵巢早衰'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "小儿遗尿能通过药物治疗吗？",
        "cypher": "MATCH (n:Disease {name: '小儿遗尿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "前列腺囊肿医院哪里好",
        "cypher": "MATCH (v1:Disease {name: '前列腺囊肿'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肝硬化怎么调理比较好",
        "cypher": "MATCH (d:Disease {name: '肝硬化'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "外阴肿瘤合并妊娠的症状?",
        "cypher": "MATCH (m:Disease {name:'外阴肿瘤合并妊娠'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "治性功能障碍地区哪家好",
        "cypher": "MATCH (d:Disease {name:'性功能障碍'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "肺癌晚期，症状开始加重，该怎么办呢？",
        "cypher": "MATCH (m:Disease {name:'肺癌'})-[:has_symptom]->(n:Symptom) RETURN m.cause"
    },
    {
        "input": "混合痔有什么并发症",
        "cypher": "MATCH (m:Disease {name:'混合痔'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "肺癌第三代靶向药名称都有什么",
        "cypher": "MATCH (v1:Disease {name: '肺癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "气胸不复发应该怎样预防",
        "cypher": "MATCH (n:Disease {name: '气胸'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "家里有肺癌病人，求肺癌食谱，多谢各位！！",
        "cypher": "MATCH (m:Disease {name: '肺癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "乙肝通过什么传染呢？",
        "cypher": "MATCH (n:Disease {name: '乙肝'})-[:acompany_with]->(m:Disease) RETURN m.get_way"
    },
    {
        "input": "反流性食管炎怎么治疗比较好呢？",
        "cypher": "MATCH (d:Disease {name: '反流性食管炎'}) RETURN d.cure_way"
    },
    {
        "input": "查出前列腺钙化怎么治疗检查？",
        "cypher": "MATCH (m:Disease {name:'前列腺钙化'})-[:need_check]->(n:Check) RETURN m.name,n.name"
    },
    {
        "input": "脂肪肝一定吃药治疗吗",
        "cypher": "MATCH (n:Disease {name:'脂肪肝'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "霉菌性外阴炎的预防措施是什么?",
        "cypher": "MATCH (n:Disease {name: '霉菌性外阴炎'}) RETURN n.prevent"
    },
    {
        "input": "如何判断是淋巴瘤吗？",
        "cypher": "MATCH (m:Disease {name:'淋巴瘤'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "慢性胃炎会成胃癌吗",
        "cypher": "MATCH (m:Disease {name:'慢性胃炎'})-[:acompany_with]->(n:Disease {name:'胃癌'}) RETURN m,n"
    },
    {
        "input": "肠癌的症状有些什么表现？",
        "cypher": "MATCH (m:Disease {name: '肠癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "做流产费用大概多少？",
        "cypher": "MATCH (m:Disease {name:'流产'}) RETURN m.cost_money"
    },
    {
        "input": "如何区分小儿肺炎与感冒？",
        "cypher": "MATCH (m:Disease {name:'小儿肺炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, collect(n.name)"
    },
    {
        "input": "痔疮和直肠癌有什么区别",
        "cypher": "MATCH (m1:Disease {name: '痔疮'})-[:acompany_with]-(m2:Disease {name: '直肠癌'}) RETURN m1, m2"
    },
    {
        "input": "面瘫术后需要注意什么？",
        "cypher": "MATCH (m:Disease {name:'面瘫'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "一般治疗前列腺增生费用多少钱",
        "cypher": "MATCH (m:Disease {name:'前列腺增生'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "前列腺钙化是什么情况？",
        "cypher": "MATCH (m:Disease {name:'前列腺钙化'}) RETURN m.name, m.desc"
    },
    {
        "input": "流产过一次，现在想要宝宝，请问要注意哪些事情",
        "cypher": "MATCH (d:Disease {name: '流产'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "请问84消毒液怎么使用？可以用来防止尖锐",
        "cypher": "MATCH (n:Disease {name:'尖锐湿疣'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "胰腺癌是一种什么疾病呢",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'}) RETURN m"
    },
    {
        "input": "宫颈癌前病变要忌口哪些",
        "cypher": "MATCH (v1:Disease {name: '宫颈癌前病变'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "应该怎么预防气管肿瘤?",
        "cypher": "MATCH (m:Disease {name:'气管肿瘤'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "肾结石为什么会左肾多",
        "cypher": "MATCH (m:Disease {name: '肾结石'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "输卵管粘连应该注意什么事项",
        "cypher": "MATCH (n:Disease {name: '输卵管粘连'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "冠心病都做什么检查",
        "cypher": "MATCH (v1:Disease {name: '冠心病'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "我害怕我现在这是牙龈癌的情况很是害怕？",
        "cypher": "MATCH (m:Disease {name: '牙龈癌'}) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率"
    },
    {
        "input": "如何区别胆囊炎与胆囊癌",
        "cypher": "MATCH (m:Disease {name:'胆囊炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "患了胃癌如何治疗检查好呢？",
        "cypher": "MATCH (m:Disease {name: '胃癌'})-[:need_check]->(n:Check) RETURN n"
    },
    {
        "input": "乳腺炎属于哪个科？",
        "cypher": "MATCH (n:Disease {name: '乳腺炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "男性不育症是精子导致的么？",
        "cypher": "MATCH (n:Disease {name:'男性不育症'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "小儿肺炎要注意哪些问题？由什么引起？",
        "cypher": "MATCH (m:Disease {name:'小儿肺炎'}) RETURN m.desc"
    },
    {
        "input": "感觉应该是尿路感染了吃什么治疗好？",
        "cypher": "MATCH (m:Disease {name: '尿路感染'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "睾丸炎治疗需要多久？",
        "cypher": "MATCH (m:Disease {name:'睾丸炎'}) RETURN m.cure_lasttime"
    },
    {
        "input": "恶性肿瘤医生说要割脚?",
        "cypher": "MATCH (m:Disease {name: '恶性肿瘤'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "是不是红斑狼仓",
        "cypher": "MATCH (m:Disease {name: '红斑狼疮'}) RETURN m"
    },
    {
        "input": "肢端肥大症是怎么回事",
        "cypher": "MATCH (m:Disease {name:'肢端肥大症'}) RETURN m"
    },
    {
        "input": "宫外孕应该注意什么？",
        "cypher": "MATCH (m:Disease {name:'宫外孕'}) RETURN m.prevent"
    },
    {
        "input": "新生儿脑瘫原因",
        "cypher": "MATCH (d:Disease {name: '新生儿脑瘫'})-[:acompany_with]->(r:Disease) RETURN r.cause"
    },
    {
        "input": "得了腹股沟斜疝可以自行好转吗",
        "cypher": "MATCH (m:Disease {name:'腹股沟斜疝'}) RETURN m.cure_lasttime"
    },
    {
        "input": "脑梗死应该注意什么？",
        "cypher": "MATCH (m:Disease {name:'脑梗死'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "胰腺癌治疗的话大概多少钱？",
        "cypher": "MATCH (n:Disease {name: '胰腺癌'}) RETURN n.cost_money"
    },
    {
        "input": "月经量少看了医生怎么办？",
        "cypher": "MATCH (m:Disease {name:'月经量少'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "怎么确定宝宝是不是有佝偻病？",
        "cypher": "MATCH (m:Disease {name: '佝偻病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "哪些症状属于盆腔肿瘤",
        "cypher": "MATCH (v1:Disease {name: '盆腔肿瘤'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "阴囊潮湿问题需要治疗吗？",
        "cypher": "MATCH (m:Disease {name:'阴囊潮湿'}) RETURN m.cure_way"
    },
    {
        "input": "尿道肉阜应该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '尿道肉阜'}) RETURN d.cure_way"
    },
    {
        "input": "不孕不育差不多该吃什么药吗",
        "cypher": "MATCH (v1:Disease {name: '不孕不育'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "一般睾丸癌常规检查多少钱",
        "cypher": "MATCH (m:Disease {name: '睾丸癌'})-[:need_check]->(n:Check) RETURN n.name, m.cost_money"
    },
    {
        "input": "细菌性前列腺炎是什么原因呢",
        "cypher": "MATCH (m:Disease {name:'细菌性前列腺炎'}) RETURN m.cause"
    },
    {
        "input": "病毒性肝炎要注意些什么",
        "cypher": "MATCH (m:Disease {name:'病毒性肝炎'}) RETURN m.prevent"
    },
    {
        "input": "食管间质瘤严重吗",
        "cypher": "MATCH (m:Disease {name:'食管间质瘤'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "类似癫痫的症状",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name CONTAINS '癫痫' RETURN d.name AS diseaseName, s.name AS symptomName"
    },
    {
        "input": "胃穿孔吃什么好？",
        "cypher": "MATCH (v1:Disease {name: '胃穿孔'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "视神经萎缩一般可以治疗好吗",
        "cypher": "MATCH (m:Disease {name:'视神经萎缩'}) RETURN m.cured_prob"
    },
    {
        "input": "被打成脑震荡该如何处理？",
        "cypher": "MATCH (d:Disease {name: '脑震荡'}) RETURN d.cure_way"
    },
    {
        "input": "患者的直肠癌会遗传吗",
        "cypher": "MATCH (n:Disease {name: '直肠癌'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "支原体感染需要多久可以治疗好",
        "cypher": "MATCH (d:Disease {name: '支原体感染'}) RETURN d.cure_way"
    },
    {
        "input": "肠系膜淋巴结炎的治疗方式有哪些？",
        "cypher": "MATCH (d:Disease {name: '肠系膜淋巴结炎'}) RETURN d.cure_way"
    },
    {
        "input": "导致神经衰弱的原因",
        "cypher": "MATCH (n:Disease {name:'神经衰弱'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "甲状腺炎哪家医院的专家治疗的比较好？",
        "cypher": "MATCH (n1:Disease {name: '甲状腺炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "什么是糖尿病的遗传性",
        "cypher": "MATCH (n:Disease {name: '糖尿病'})-[:acompany_with]-(m:Disease) RETURN m.get_way"
    },
    {
        "input": "怎么预防小儿发烧问题比较好？",
        "cypher": "MATCH (m:Disease {name:'小儿发烧'}) RETURN m.prevent"
    },
    {
        "input": "视网膜色素变性是否有好的医疗方..",
        "cypher": "MATCH (d:Disease {name: '视网膜色素变性'}) RETURN d.cure_way"
    },
    {
        "input": "感冒咳嗽流鼻涕低烧怎么办？",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom) WHERE n.name IN ['咳嗽', '流鼻涕', '低烧'] RETURN m.cureWay"
    },
    {
        "input": "头痛有二十多年了，看过好多科，头痛何时能看好",
        "cypher": "MATCH (d:Disease)-[r:belongs_to]->(dp:Department) WHERE d.name CONTAINS '头痛' RETURN dp.name"
    },
    {
        "input": "患了痛经该吃什么药较好",
        "cypher": "MATCH (v1:Disease {name: '痛经'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "治疗睾丸癌较好的医院是什么呢？",
        "cypher": "MATCH (n1:Disease {name: '睾丸癌'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "癫病的症状有哪些",
        "cypher": "MATCH (m:Disease {name:'癫病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "治疗溃疡性肠炎专科医院在哪里啊？",
        "cypher": "MATCH (n:Disease {name: '溃疡性肠炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "什么会引起甲亢这种疾病",
        "cypher": "MATCH (m:Disease {name:'甲亢'}) RETURN m.cause"
    },
    {
        "input": "阳痿的症状都有什么",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "你好， 家人肾炎 需要问医",
        "cypher": "MATCH (m:Disease {name:'肾炎'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "内分泌失调，黄体功能不全",
        "cypher": "MATCH (d:Disease {name: '内分泌失调'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "前列腺肉瘤应该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '前列腺肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "针对大便不成形怎么回事",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'大便不成形'}) RETURN m.name AS 疾病名称, m.desc AS 疾"
    },
    {
        "input": "膀胱炎做尿常规能检查出来吗？",
        "cypher": "MATCH (m:Disease {name:'膀胱炎'})-[:need_check]->(n:Check{name:'尿常规'}) RETURN m,n"
    },
    {
        "input": "心肌缺血会自愈吗",
        "cypher": "MATCH (n:Disease {name: '心肌缺血'}) RETURN n.cured_prob"
    },
    {
        "input": "消化内科的问题",
        "cypher": "MATCH (v1:Disease)-[v2:belongs_to]->(v3:Department) WHERE v3.name = '消化内科' RETURN v1"
    },
    {
        "input": "子宫内膜癌患者生活中怎么做才好",
        "cypher": "MATCH (m:Disease {name:'子宫内膜癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "宝宝九多月了宝宝秋季腹泻住院了",
        "cypher": "MATCH (m:Disease {name: '腹泻'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "患有附睾炎需了解下情况？",
        "cypher": "MATCH (m:Disease {name:'附睾炎'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "外阴瘙痒请问用什么药才能好",
        "cypher": "MATCH (n:Disease {name: '外阴瘙痒'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "染色体出现异常是为什么？",
        "cypher": "MATCH (m:Disease {name: '染色体异常'}) RETURN m.cause"
    },
    {
        "input": "吃什么药治疗失语症无副作用",
        "cypher": "MATCH (v1:Disease {name: '失语症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "转移性骨肿瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '转移性骨肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脑积水和脑肿瘤表现是什么样子？",
        "cypher": "MATCH (m:Disease {name:'脑积水'})-[:has_symptom]->(n:Symptom) RETURN m.name,collect(n.name)"
    },
    {
        "input": "怎样早期才能发现宫外孕？",
        "cypher": "MATCH (m:Disease {name:'宫外孕'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "卵巢纤维瘤",
        "cypher": "MATCH (m:Disease {name: '卵巢纤维瘤'}) RETURN m"
    },
    {
        "input": "妊娠期糖尿病控制饮食有效果吗",
        "cypher": "MATCH (v1:Disease {name: '妊娠期糖尿病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "会是特发性震颤吗？",
        "cypher": "MATCH (m:Disease {name:'特发性震颤'}) RETURN m"
    },
    {
        "input": "哪儿能治乳糜胸",
        "cypher": "MATCH (v1:Disease {name: '乳糜胸'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "免疫性不孕不该吃什么药物",
        "cypher": "MATCH (v1:Disease {name: '免疫性不孕'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "小儿中耳炎有什么影响",
        "cypher": "MATCH (m:Disease {name:'小儿中耳炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "子宫内膜异位症的饮食禁忌是什么",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜异位症'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "应该是哪次分娩怀上的？",
        "cypher": "MATCH (n:Disease {name:'产后出血'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "新生儿破伤风用皮试吗？",
        "cypher": "MATCH (n:Disease {name: '新生儿破伤风'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "肛窦炎，用药后不见效果，还需要做什么检查能确",
        "cypher": "MATCH (d:Disease {name: '肛窦炎'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "哪些人容易患胆囊炎",
        "cypher": "MATCH (d:Disease {name: '胆囊炎'}) RETURN d.easy_get"
    },
    {
        "input": "酒精性肝硬、化脾大，门脉高压咋治疗",
        "cypher": "MATCH (d:Disease {name: '酒精性肝硬化'}) RETURN d.cure_way"
    },
    {
        "input": "缓解癫病的较好办法基本都什么操作",
        "cypher": "MATCH (d:Disease {name: '癫病'}) RETURN d.cure_way"
    },
    {
        "input": "什么方法可以检查性功能障碍呢？",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name = '性功能障碍' RETURN n.name"
    },
    {
        "input": "得了肺炎有哪些症状表现",
        "cypher": "MATCH (v1:Disease {name: '肺炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "阳痿的危害有哪些，严重吗",
        "cypher": "MATCH (m:Disease {name:'阳痿'}) RETURN m.desc"
    },
    {
        "input": "尿崩症需要做的化验检查？",
        "cypher": "MATCH (m:Disease {name:'尿崩症'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "什么职业宜患多发性骨髓瘤",
        "cypher": "MATCH (d:Disease {name: '多发性骨髓瘤'}) RETURN d.easy_get"
    },
    {
        "input": "患有胆汁返流性胃炎要吃什么食物",
        "cypher": "MATCH (v1:Disease {name: '胆汁返流性胃炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "子宫内膜炎确诊都要花多少呢",
        "cypher": "MATCH (n:Disease {name: '子宫内膜炎'})-[:need_check]->(m:Check) RETURN m.name AS name, m.money AS money"
    },
    {
        "input": "早泄严不严重的",
        "cypher": "MATCH (n:Disease {name: '早泄'}) RETURN n.cure_lasttime, n.cured_prob"
    },
    {
        "input": "治肛瘘用什么药最有效",
        "cypher": "MATCH (n:Disease {name: '肛瘘'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "哪家治疗治疗肺心病的医院的效果好",
        "cypher": "MATCH (n:Disease {name: '肺心病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "如何算包皮过长",
        "cypher": "MATCH (v1:Disease {name: '包皮过长'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "输尿管上段的肾脏是输尿管结石吗",
        "cypher": "MATCH (d:Disease {name: '输尿管结石'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "得睾丸癌吃什么好对自己的身体？",
        "cypher": "MATCH (m:Disease {name: '睾丸癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "外阴肿瘤要做什么检查可确诊？",
        "cypher": "MATCH (m:Disease {name: '外阴肿瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "咽喉癌中晚期能治愈吗",
        "cypher": "MATCH (d:Disease {name: '咽喉癌'}) RETURN d.cure_way"
    },
    {
        "input": "肾移植患者怎么护理好",
        "cypher": "MATCH (d:Disease {name: '肾移植'}) RETURN d.easy_get"
    },
    {
        "input": "触碰手足口病患者物品会被传染吗",
        "cypher": "MATCH (v1:Disease {name: '手足口病'})-[:acompany_with]->(v2:Disease) RETURN v2.get_way"
    },
    {
        "input": "混合痔到哪治疗比较好呢？",
        "cypher": "MATCH (m:Disease {name:'混合痔'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "婴儿痉挛症能活多久？",
        "cypher": "MATCH (m1:Disease {name: '婴儿痉挛症'}) RETURN m1.cure_lasttime"
    },
    {
        "input": "患上阴茎异常勃起怎么办",
        "cypher": "MATCH (m:Disease {name: '阴茎异常勃起'}) RETURN m.cure_way"
    },
    {
        "input": "肝癌还分大小吗",
        "cypher": "MATCH (n:Disease {name: '肝癌'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "小脑萎缩 初期的症状有哪些",
        "cypher": "MATCH (m:Disease {name:'小脑萎缩'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "男性不育症精子合格率低吃什么药",
        "cypher": "MATCH (v1:Disease {name: '男性不育症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "请医生推介几种适合唇癌患者服用的治疗唇癌的药",
        "cypher": "MATCH (v1:Disease {name: '唇癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "患前列腺癌的老人需要前列腺切片吗？",
        "cypher": "MATCH (n:Disease {name: '前列腺癌'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "小儿血管瘤去医院挂什么科，怎么样治疗好，",
        "cypher": "MATCH (n:Disease {name: '小儿血管瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "怀孕40多天没怀孕前月经不调有事吗？",
        "cypher": "MATCH (m:Disease {name:'月经不调'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "肝病的传染性强吗？",
        "cypher": "MATCH (n:Disease {name: '肝病'}) RETURN n.get_way"
    },
    {
        "input": "脑血栓需要打些什么针水",
        "cypher": "MATCH (m:Disease {name:'脑血栓'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "乳腺增生吃什么药吃多长时间能好？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name, m.cure_lasttime"
    },
    {
        "input": "求教阴虱病",
        "cypher": "MATCH (m:Disease {name: '阴虱病'}) RETURN m"
    },
    {
        "input": "死精症的病因有什么",
        "cypher": "MATCH (n:Disease {name: '死精症'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "有没有得前列腺炎医院能检查吗",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "呼吸困难心跳加速怎么回事",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '呼吸困难' OR n.name = '心跳加速' RETURN m.name"
    },
    {
        "input": "如何治疗甲状腺乳头癌",
        "cypher": "MATCH (d:Disease {name: '甲状腺乳头癌'}) RETURN d.cure_way"
    },
    {
        "input": "直肠癌治疗需要花多少钱",
        "cypher": "MATCH (n:Disease {name: '直肠癌'}) RETURN n.cost_money"
    },
    {
        "input": "晚上尿频2-3次是怎么回事啊？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'尿频'}) RETURN m.name"
    },
    {
        "input": "巨乳症的诊断",
        "cypher": "MATCH (m:Disease {name:'巨乳症'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "眼外伤导致视网膜脱离怎么办",
        "cypher": "MATCH (d:Disease {name: '视网膜脱离'}) RETURN d.cure_way"
    },
    {
        "input": "请问怎么预防得性功能障碍？",
        "cypher": "MATCH (n1:Disease {name: '性功能障碍'})-[:belongs_to]->(n2:Department) RETURN n1.prevent"
    },
    {
        "input": "冠心病用什么中成药？",
        "cypher": "MATCH (n:Disease {name: '冠心病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "我是安徽的，我今年8月初患了亚急性甲状腺炎",
        "cypher": "MATCH (v1:Disease {name: '亚急性甲状腺炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "小儿脑积水患者的饮食禁忌有哪些？",
        "cypher": "MATCH (n:Disease {name: '小儿脑积水'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "白血病寿命有多少年",
        "cypher": "MATCH (n:Disease {name: '白血病'}) RETURN n.cure_lasttime"
    },
    {
        "input": "哪里治外痔有很好的疗效?",
        "cypher": "MATCH (n1:Disease {name: '外痔'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "帕金森病人每天都会折磨人吗？",
        "cypher": "MATCH (n:Disease {name: '帕金森病'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "如何按摩帕金森病人？才能达到有效的缓解？",
        "cypher": "MATCH (d:Disease {name: '帕金森病'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺炎可有什么特效药？",
        "cypher": "MATCH (v1:Disease {name: '前列腺炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "矮小症治疗费用贵不贵",
        "cypher": "MATCH (n:Disease {name: '矮小症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "得了妇科病的症状有哪些",
        "cypher": "MATCH (v1:Disease {name: '妇科病'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "和手足口病患者触碰会被传染吗？",
        "cypher": "MATCH (m:Disease {name: '手足口病'})-[:acompany_with]->(n:Disease) RETURN n.get_way"
    },
    {
        "input": "经常感冒流清鼻涕有痰应吃什么药",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "扁桃体周围脓肿如何治疗",
        "cypher": "MATCH (d:Disease {name: '扁桃体周围脓肿'}) RETURN d.cure_way"
    },
    {
        "input": "医院看乳腺癌一般多少钱？检查什么项目",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:need_check]->(n:Check) RETURN m.cost_money,n.name"
    },
    {
        "input": "朋友孩子染色体异常不知道怎么办？",
        "cypher": "MATCH (m:Disease {name: '染色体异常'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "患支气管炎饮食注意什么",
        "cypher": "MATCH (v1:Disease {name: '支气管炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "不射精症的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'不射精症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "医生:请问尖锐湿尤能彻底治好吗?什么治疗方法",
        "cypher": "MATCH (d:Disease {name: '尖锐湿疣'}) RETURN d.cure_way"
    },
    {
        "input": "请问苯丙酮尿症是什么病",
        "cypher": "MATCH (m:Disease {name: '苯丙酮尿症'}) RETURN m"
    },
    {
        "input": "直肠癌也痔疮有那些区别",
        "cypher": "MATCH (m:Disease {name:'直肠癌'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "肠套叠是不是容易反复",
        "cypher": "MATCH (n:Disease {name: '肠套叠'}) RETURN n.get_prob"
    },
    {
        "input": "淋巴瘤这种疾病有什么类型",
        "cypher": "MATCH (v1:Disease {name: '淋巴瘤'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "卵巢纤维瘤手术",
        "cypher": "MATCH (d:Disease {name: '卵巢纤维瘤'}) RETURN d.cure_way"
    },
    {
        "input": "克罗恩病是否会一直腹痛",
        "cypher": "MATCH (n:Disease {name: '克罗恩病'})-[:has_symptom]->(m:Symptom {name: '腹痛'}) RETURN m.name AS symptomName"
    },
    {
        "input": "乳腺结核的特点症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '乳腺结核'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "颈部血管瘤严重吗",
        "cypher": "MATCH (m:Disease {name: '颈部血管瘤'}) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率"
    },
    {
        "input": "小儿肾病综合征病因是什么？",
        "cypher": "MATCH (m:Disease {name:'小儿肾病综合征'}) RETURN m.cause"
    },
    {
        "input": "结肠癌与什么有关?",
        "cypher": "MATCH (m:Disease {name: '结肠癌'})-[]->(n) RETURN n"
    },
    {
        "input": "紫癜性肾炎的反复跟饮食有关系吗？",
        "cypher": "MATCH (v1:Disease {name: '紫癜性肾炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "请问多发性骨髓瘤现在的医学可以完全治疗吗？",
        "cypher": "MATCH (d:Disease {name: '多发性骨髓瘤'}) RETURN d.cure_way"
    },
    {
        "input": "涎腺混合瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'涎腺混合瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "治疗前列腺增生哪家医院最权威?",
        "cypher": "MATCH (n1:Disease {name: '前列腺增生'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "16岁男孩得盆腔积液的原因是什么?",
        "cypher": "MATCH (n:Disease {name: '盆腔积液'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "酒精性脂肪肝的治疗？",
        "cypher": "MATCH (d:Disease {name: '酒精性脂肪肝'}) RETURN d.cure_way"
    },
    {
        "input": "混合痔治疗要用什么药物",
        "cypher": "MATCH (n:Disease {name: '混合痔'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "额叶癫痫症状都有哪些",
        "cypher": "MATCH (m:Disease {name:'额叶癫痫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肾癌的主要症状有什么",
        "cypher": "MATCH (m:Disease {name:'肾癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "戴避孕套可以预防淋病吗",
        "cypher": "MATCH (n:Disease {name: '淋病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "我想知道月经量少是怎么回事",
        "cypher": "MATCH (m:Disease {name: '月经量少'}) RETURN m"
    },
    {
        "input": "早期乳腺癌多长时间复查?",
        "cypher": "MATCH (n:Disease {name: '早期乳腺癌'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "淋巴癌肿到多大会危及生命",
        "cypher": "MATCH (d:Disease {name: '淋巴癌'})-[:acompany_with]->(dd:Disease) RETURN dd.name"
    },
    {
        "input": "进行性骨干发育不良应该怎么办？",
        "cypher": "MATCH (d:Disease {name: '进行性骨干发育不良'}) RETURN d.cure_way"
    },
    {
        "input": "强直性肌营养不良症应该吃什么药物",
        "cypher": "MATCH (v1:Disease {name: '强直性肌营养不良症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "前列腺脓肿了咋治比较好呢",
        "cypher": "MATCH (m:Disease {name:'前列腺脓肿'}) RETURN m.cure_way"
    },
    {
        "input": "38周剖腹产婴儿出生时患有新生儿呼吸窘迫综合",
        "cypher": "MATCH (d:Disease {name: '新生儿呼吸窘迫综合征'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "怎么治慢性胰腺炎？",
        "cypher": "MATCH (d:Disease {name: '慢性胰腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "膀胱癌术后3年，除了尿常规B超还需要查什么？",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "引起便血的原因都有哪些",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '便血' RETURN m.name"
    },
    {
        "input": "患了大肠癌有其他疾病吗？",
        "cypher": "MATCH (m:Disease {name: '大肠癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "阴囊湿疹的症状都有哪些",
        "cypher": "MATCH (m:Disease {name:'阴囊湿疹'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "附睾炎对患者的影响大吗",
        "cypher": "MATCH (n:Disease {name:'附睾炎'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "检查包皮炎大概费用多少钱",
        "cypher": "MATCH (n:Disease {name:'包皮炎'})-[:need_check]->(m:Check) RETURN m.cost_money"
    },
    {
        "input": "自然流产哪时候要做检查",
        "cypher": "MATCH (v1:Disease {name: '自然流产'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "做肝移植是否合适肝硬化、肝腹水",
        "cypher": "MATCH (m:Disease {name: '肝硬化'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "宫颈肥大问题是宫颈癌吗？",
        "cypher": "MATCH (m:Disease {name:'宫颈肥大'})-[:acompany_with]-(n:Disease {name:'宫颈癌'}) RETURN m,n"
    },
    {
        "input": "请问哪里能治疗外阴瘙痒？",
        "cypher": "MATCH (n1:Disease {name: '外阴瘙痒'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "孩子风热感冒吃哪些药",
        "cypher": "MATCH (d:Disease {name: '风热感冒'}) RETURN d.easy_get"
    },
    {
        "input": "乳腺癌术后饮食要注意什么呢？",
        "cypher": "MATCH (v1:Disease {name: '乳腺癌'})-[:do_eat]->(v2:Food) RETURN v2"
    },
    {
        "input": "自从取环后月经量开始多有半年了宫颈糜烂2怎么",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "卵巢囊肿的治疗费用是多少人民币？",
        "cypher": "MATCH (n:Disease {name: '卵巢囊肿'}) RETURN n.cost_money"
    },
    {
        "input": "晚上做完爱怎么又遗精",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '遗精' RETURN d.name"
    },
    {
        "input": "造成性功能障碍的原因是什么呢？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '性功能障碍' RETURN m.desc"
    },
    {
        "input": "胎毒是什么样的呢",
        "cypher": "MATCH (m:Disease {name:'胎毒'}) RETURN m"
    },
    {
        "input": "前列腺炎戒色能好吗",
        "cypher": "MATCH (d:Disease {name: '前列腺炎'})-[:no_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "佝偻病是缺哪些微量元素",
        "cypher": "MATCH (v1:Disease {name: '佝偻病'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "北京极好盆腔炎大型医院",
        "cypher": "MATCH (v1:Disease {name: '盆腔炎'})-[:belongs_to]->(v2:Department {name: '妇科'}) RETURN v2"
    },
    {
        "input": "内分泌失调会引起什么妇科病呢？该怎么办好",
        "cypher": "MATCH (m:Disease {name:'内分泌失调'})-[:acompany_with]->(n:Disease) RETURN n"
    }
]