[
    {
        "input": "卵巢肿瘤的症状有哪些?",
        "cypher": "MATCH (m:Disease {name: '卵巢肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "怎样检查是不是内分泌失调呢",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name CONTAINS '内分泌失调' RETURN n.name"
    },
    {
        "input": "老公今年32岁，去年诊断出有甲状腺肿瘤，",
        "cypher": "MATCH (d:Disease {name: '甲状腺肿瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "孩子诊断为非骨化性纤维瘤如何矫形",
        "cypher": "MATCH (d:Disease {name: '非骨化性纤维瘤'}) RETURN d.cure_way"
    },
    {
        "input": "正常人会不会得肌肉萎缩",
        "cypher": "MATCH (d:Disease {name: '肌肉萎缩'}) RETURN d.easy_get"
    },
    {
        "input": "胆囊息肉0.5*0.5严不严重",
        "cypher": "MATCH (d:Disease {name: '胆囊息肉'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "白带异常要如何服药",
        "cypher": "MATCH (v1:Disease {name: '白带异常'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "做了口腔颌面部血管瘤手术要注意什么?",
        "cypher": "MATCH (d:Disease {name: '口腔颌面部血管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "是不是血管性头痛,到底是啥病,怎么治疗呀",
        "cypher": "MATCH (d:Disease {name: '血管性头痛'}) RETURN d.cure_way"
    },
    {
        "input": "小儿过敏性紫癜紫癜去哪里治疗好？",
        "cypher": "MATCH (n1:Disease {name: '小儿过敏性紫癜'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "川崎病症状是什么原因引起",
        "cypher": "MATCH (v1:Disease {name: '川崎病'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "脑血管痉挛如何恢复",
        "cypher": "MATCH (d:Disease {name: '脑血管痉挛'}) RETURN d.cure_way"
    },
    {
        "input": "子宫肌瘤是什么病呢",
        "cypher": "MATCH (m:Disease {name:'子宫肌瘤'}) RETURN m.name,m.desc"
    },
    {
        "input": "怎样预防宫颈癌那?",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'}) RETURN m.prevent"
    },
    {
        "input": "胰腺癌手术花费多少",
        "cypher": "MATCH (n:Disease {name: '胰腺癌'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "宝宝体温过低为什么？",
        "cypher": "MATCH (m:Disease {name:'体温过低'})<-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "痛风能治好妈，用什么药",
        "cypher": "MATCH (d:Disease {name: '痛风'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "慢性肾功能衰竭有哪些诊断症状",
        "cypher": "MATCH (m:Disease {name:'慢性肾功能衰竭'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "手足口病会怎么样预防？",
        "cypher": "MATCH (m:Disease {name:'手足口病'}) RETURN m.prevent"
    },
    {
        "input": "附睾炎去哪个医院",
        "cypher": "MATCH (v1:Disease {name: '附睾炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "细菌性前列腺炎好治吗",
        "cypher": "MATCH (m:Disease {name:'细菌性前列腺炎'}) RETURN m.cure_way"
    },
    {
        "input": "怎么诊断先天性风疹？",
        "cypher": "MATCH (m:Disease {name:'先天性风疹'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "宝宝两个月黄疸4.3是否正常",
        "cypher": "MATCH (d:Disease {name: '黄疸'}) RETURN d.easy_get"
    },
    {
        "input": "患有肺癌能活多长时间",
        "cypher": "MATCH (m:Disease {name: '肺癌'}) RETURN m.cure_lasttime"
    },
    {
        "input": "早泄与阳痿有什么区别",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:acompany_with]-(v2:Disease {name: '阳痿'}) RETURN v1,v2"
    },
    {
        "input": "哪里有好的外阴炎医院？",
        "cypher": "MATCH (v1:Disease {name: '外阴炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "结核性脑膜炎的危险期有多长？",
        "cypher": "MATCH (n:Disease {name: '结核性脑膜炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "排尿灼烧，尿频，尿急，射精疼，都是有时的情况",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name IN ['排尿灼烧', '尿频', '尿急', '射精疼'] RETURN n.name"
    },
    {
        "input": "特发性震颤如何缓解？",
        "cypher": "MATCH (d:Disease {name: '特发性震颤'}) RETURN d.cure_way"
    },
    {
        "input": "急性宫颈炎的表现是什么？",
        "cypher": "MATCH (m:Disease {name:'急性宫颈炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我是前列腺增生还是慢性前列腺炎？",
        "cypher": "MATCH (m:Disease {name: '前列腺增生'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "哪家医院能治愈帕金森病？请说出医院的名称及详",
        "cypher": "MATCH (n:Disease {name:'帕金森病'})-[:belongs_to]->(m:Department) RETURN m.name AS name, m.desc AS desc"
    },
    {
        "input": "如何确定自己已得恶性高血压？",
        "cypher": "MATCH (m:Disease {name:'恶性高血压'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "早泄可以吃六味地黄丸吗？",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:common_drug|:recommand_drug]->(v2:Drug {name: '六味地黄丸'}) RETURN v2"
    },
    {
        "input": "盆腔积液会不会有什么问题",
        "cypher": "MATCH (m:Disease {name: '盆腔积液'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "脑震荡怎么确诊呢",
        "cypher": "MATCH (m:Disease {name:'脑震荡'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "直肠癌家族遗传几率多大",
        "cypher": "MATCH (m:Disease {name: '直肠癌'}) RETURN m.get_prob"
    },
    {
        "input": "肺热该如何才能清除",
        "cypher": "MATCH (d:Disease {name: '肺热'}) RETURN d.cure_way"
    },
    {
        "input": "慢性肾小球肾炎吃药后无好转怎么办",
        "cypher": "MATCH (v1:Disease {name: '慢性肾小球肾炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "早孕检查是什么？",
        "cypher": "MATCH (v1:Disease)-[v2:need_check]->(v3:Check) WHERE v3.name CONTAINS '早孕检查' RETURN v3"
    },
    {
        "input": "尿道上裂的外科治疗目的是什么",
        "cypher": "MATCH (d:Disease {name: '尿道上裂'}) RETURN d.cure_way"
    },
    {
        "input": "请问这个是流行性感冒吗",
        "cypher": "MATCH (n:Disease {name:'流行性感冒'}) RETURN n"
    },
    {
        "input": "垂体瘤治疗哪家医院较好？",
        "cypher": "MATCH (v1:Disease {name: '垂体瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "糜烂性胃炎的症状",
        "cypher": "MATCH (m:Disease {name:'糜烂性胃炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "流产后护理应注意哪些方面的问题？",
        "cypher": "MATCH (n:Disease {name: '流产'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "治疗血小板减少性紫癜北京医院哪家好啊  求答",
        "cypher": "MATCH (v1:Disease {name: '血小板减少性紫癜'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "小儿哮喘吃啥药好？",
        "cypher": "MATCH (v1:Disease {name: '小儿哮喘'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "鸡胸多大年龄做手术合适",
        "cypher": "MATCH (d:Disease {name: '鸡胸'}) RETURN d.cure_way"
    },
    {
        "input": "己婚28岁，生两胎，上环两年多，月经量少是什",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '月经量少' RETURN n.name"
    },
    {
        "input": "吃哪些药能预防偏头痛 ",
        "cypher": "MATCH (v1:Disease {name: '偏头痛'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "治子宫内膜癌医院收费情况",
        "cypher": "MATCH (m:Disease {name:'子宫内膜癌'})-[:belongs_to]->(n:Department) RETURN n.name, m.cost_money"
    },
    {
        "input": "卵巢囊肿术后复查多久一次",
        "cypher": "MATCH (d:Disease {name: '卵巢囊肿'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "患了肾炎之后还能活多久呢",
        "cypher": "MATCH (n:Disease {name: '肾炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "生殖器勃起没有以前那么硬怎么回事",
        "cypher": "MATCH (m:Disease {name: '勃起功能障碍'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "脑垂体腺瘤吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '脑垂体腺瘤'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "慢性膀胱炎做了膀胱镜做手术为什么",
        "cypher": "MATCH (d:Disease {name: '慢性膀胱炎'}) RETURN d.cure_way"
    },
    {
        "input": "肺气肿的症状有什么特点，该怎么治疗",
        "cypher": "MATCH (n:Disease {name: '肺气肿'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "胃真菌病怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '胃真菌病'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍的治疗价格该要哪些钱呢",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name AS name, collect(m.cost_money) AS money"
    },
    {
        "input": "肠胃炎会出现哪些症状",
        "cypher": "MATCH (v1:Disease {name: '肠胃炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "月经不调治疗费一般通常要多少钱呢",
        "cypher": "MATCH (n:Disease {name: '月经不调'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "干燥综合征是什么",
        "cypher": "MATCH (m:Disease {name: '干燥综合征'}) RETURN m"
    },
    {
        "input": "是否性病？",
        "cypher": "MATCH (n:Disease {name:'性病'}) RETURN n"
    },
    {
        "input": "20岁的男生得了鼻咽癌怎么办",
        "cypher": "MATCH (d:Disease {name: '鼻咽癌'}) RETURN d.easy_get"
    },
    {
        "input": "人工流产会流不干净吗？",
        "cypher": "MATCH (m:Disease {name:'人工流产'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "原位癌是什么意思",
        "cypher": "MATCH (m:Disease {name:'原位癌'}) RETURN m.desc"
    },
    {
        "input": "先天性血管瘤形成的原因有什么？",
        "cypher": "MATCH (m:Disease {name: '先天性血管瘤'}) RETURN m.cause"
    },
    {
        "input": "广州肝病医院哪里正规",
        "cypher": "MATCH (v:Disease {name: '肝病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "早产儿视网膜病变检查的必要性？",
        "cypher": "MATCH (n:Disease {name: '早产儿视网膜病变'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "孩子比较能吃大便一天好几次可以打预防针吗？",
        "cypher": "MATCH (d:Disease {name: '便秘'}) RETURN d.easy_get"
    },
    {
        "input": "前列腺囊肿前期哪些药物可以治疗 ",
        "cypher": "MATCH (n:Disease {name: '前列腺囊肿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "我公公得肝硬化要注意些什么？",
        "cypher": "MATCH (m:Disease {name:'肝硬化'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "得了肛门尖锐湿疣要去肛肠科还是去皮肤科",
        "cypher": "MATCH (d:Disease {name: '肛门尖锐湿疣'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "贲门癌种类有哪些？",
        "cypher": "MATCH (m:Disease {name:'贲门癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "间质性肾炎能活多少年",
        "cypher": "MATCH (n:Disease {name: '间质性肾炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "精索静脉曲张怎样治疗该有哪些效果呢",
        "cypher": "MATCH (m:Disease {name:'精索静脉曲张'}) RETURN m.cure_way AS name"
    },
    {
        "input": "前列腺囊肿9*9mm严重吗",
        "cypher": "MATCH (n:Disease {name:'前列腺囊肿'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称"
    },
    {
        "input": "漏斗胸症状是什么？",
        "cypher": "MATCH (m:Disease {name: '漏斗胸'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "得白血病是什么原因",
        "cypher": "MATCH (m:Disease {name: '白血病'}) RETURN m.cause"
    },
    {
        "input": "癌症会转移吗",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "类癌有什么好办法",
        "cypher": "MATCH (d:Disease {name: '类癌'}) RETURN d.cure_way"
    },
    {
        "input": "卵巢炎的主要表现是什么",
        "cypher": "MATCH (m:Disease {name:'卵巢炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "开角型青光眼30年57岁能动手术吗",
        "cypher": "MATCH (d:Disease {name: '开角型青光眼'}) RETURN d.cure_way"
    },
    {
        "input": "吃什么可以预防包皮水肿",
        "cypher": "MATCH (v1:Disease {name: '包皮水肿'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "卵巢囊肿忌讳同房吗？",
        "cypher": "MATCH (n:Disease {name: '卵巢囊肿'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "乙状结肠癌术后大便控制不住如何治疗",
        "cypher": "MATCH (d:Disease {name: '乙状结肠癌'}) RETURN d.cure_way"
    },
    {
        "input": "三叉神经痛都有什么症状，能治好吗？",
        "cypher": "MATCH (m:Disease {name:'三叉神经痛'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "新生儿黄疸一直不退怎么回事呀？",
        "cypher": "MATCH (m:Disease {name:'新生儿黄疸'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "酒精对大脑神经的危害",
        "cypher": "MATCH (v1:Disease {name: '酒精中毒'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "看看我这是疝气吗？",
        "cypher": "MATCH (m:Disease {name: '疝气'}) RETURN m"
    },
    {
        "input": "1岁儿童得了佝偻病有什么忌口",
        "cypher": "MATCH (m:Disease {name:'佝偻病'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "什么是便秘？便秘了怎么办？",
        "cypher": "MATCH (m:Disease {name:'便秘'}) RETURN m.get_prob,m.cure_lasttime,m.cured_prob"
    },
    {
        "input": "脑萎缩和老年痴呆有什么区别？",
        "cypher": "MATCH (m:Disease {name:'脑萎缩'})-[]->(x:Disease {name:'老年痴呆'}) RETURN x.name"
    },
    {
        "input": "外婆有精神病,孩子会遗传吗",
        "cypher": "MATCH (m:Disease {name:'精神病'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "神经性头痛是什么病呀",
        "cypher": "MATCH (m:Disease {name: '神经性头痛'}) RETURN m.desc"
    },
    {
        "input": "胃溃疡面积大导致胃癌吉大该去哪里治疗呢？",
        "cypher": "MATCH (n1:Disease {name: '胃溃疡'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "呼吸异常",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'呼吸异常'}) RETURN m.name AS 疾病名称, n.name AS 症状名称"
    },
    {
        "input": "前列腺好几年了老是想小便怎么办？",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'})-[:has_symptom]->(n:Symptom {name: '尿频'}) RETURN m.cure_way"
    },
    {
        "input": "前列腺脓肿术后要多久才可以同房",
        "cypher": "MATCH (d:Disease {name: '前列腺脓肿'}) RETURN d.cure_way"
    },
    {
        "input": "孩子肾病综合征是什么？",
        "cypher": "MATCH (m:Disease {name:'肾病综合征'}) RETURN m"
    },
    {
        "input": "男人中风左边还右边多？",
        "cypher": "MATCH (d:Disease {name: '中风'}) RETURN d.easy_get"
    },
    {
        "input": "原发性纵隔肿瘤可以吃什么食物调节？",
        "cypher": "MATCH (v1:Disease {name: '原发性纵隔肿瘤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "苯中毒可以治疗吗？",
        "cypher": "MATCH (d:Disease {name: '苯中毒'}) RETURN d.cure_way"
    },
    {
        "input": "鼻咽癌的潜伏期是多长时间",
        "cypher": "MATCH (n:Disease {name: '鼻咽癌'}) RETURN n.cure_lasttime"
    },
    {
        "input": "失眠无精打采现在该怎么治疗呢？",
        "cypher": "MATCH (m:Disease {name:'失眠'}) RETURN m.cure_way"
    },
    {
        "input": "宫颈癌已经到了晚期，这个时候什么方法比较好？",
        "cypher": "MATCH (d:Disease {name: '宫颈癌'}) RETURN d.cure_way"
    },
    {
        "input": "前段时间患有阴道炎",
        "cypher": "MATCH (n:Disease {name: '阴道炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "想知道内分泌失调有哪些症状",
        "cypher": "MATCH (v1:Disease {name: '内分泌失调'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "请医生帮我看看谢谢前列腺",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'})-[:belongs_to]->(b:Department) RETURN b.name AS name"
    },
    {
        "input": "如何区分萎缩性胃炎和反流性食道炎",
        "cypher": "MATCH (m:Disease {name:'萎缩性胃炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "像这样情况会是肝癌吗",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:has_symptom]->(n:Symptom) RETURN m, n"
    },
    {
        "input": "前列腺癌对患者的家庭会产生多大的影响？",
        "cypher": "MATCH (d:Disease {name: '前列腺癌'}) RETURN d.easy_get"
    },
    {
        "input": "治疗甲亢的医院排名哪家好？",
        "cypher": "MATCH (n:Disease {name:'甲亢'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "输卵管肿瘤可吃药化疗吗?",
        "cypher": "MATCH (d:Disease {name: '输卵管肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "死精诊断方法有些什么",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name CONTAINS '死精' RETURN n.name"
    },
    {
        "input": "初步诊断为支气管扩张",
        "cypher": "MATCH (d:Disease {name: '支气管扩张'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "气胸平时不可以吃什么食物",
        "cypher": "MATCH (v1:Disease {name: '气胸'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "红斑狼疮要检查什么项目",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "肾母细胞瘤",
        "cypher": "MATCH (m:Disease {name: '肾母细胞瘤'}) RETURN m"
    },
    {
        "input": "原发性高血压和心力衰竭要怎么办",
        "cypher": "MATCH (m:Disease {name:'原发性高血压'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "乳腺结节在治疗期间不能吃什么？",
        "cypher": "MATCH (v1:Disease {name: '乳腺结节'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "胚胎停育的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'胚胎停育'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "有细菌性阴道炎是怎么回事",
        "cypher": "MATCH (m:Disease {name:'细菌性阴道炎'}) RETURN m.get_prob"
    },
    {
        "input": "肺癌治疗费用一般是多少钱？",
        "cypher": "MATCH (n:Disease {name: '肺癌'}) RETURN n.cost_money"
    },
    {
        "input": "在武汉同济医院看了说是帕金森病怎么办啊？",
        "cypher": "MATCH (d:Disease {name: '帕金森病'}) RETURN d.cure_way"
    },
    {
        "input": "患有癌症应该注意什么",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "急求哪家医院的医生治疗肝血管瘤最好？",
        "cypher": "MATCH (n:Disease {name: '肝血管瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "新生儿黄疸药物怎么喂呢？",
        "cypher": "MATCH (n:Disease {name: '新生儿黄疸'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "请问急性丙肝的症状有什么呢",
        "cypher": "MATCH (m:Disease {name:'急性丙肝'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "这是糖尿病的并发症吗？",
        "cypher": "MATCH (n:Disease {name: '糖尿病'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "乳腺增生的病因有什么？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:acompany_with]-(n:Disease) RETURN n.cause"
    },
    {
        "input": "胆囊息肉会引起传染吗",
        "cypher": "MATCH (n:Disease {name: '胆囊息肉'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "请问这是白塞病吗",
        "cypher": "MATCH (n:Disease {name:'白塞病'}) RETURN n"
    },
    {
        "input": "变应性血管炎怎么办？",
        "cypher": "MATCH (d:Disease {name: '变应性血管炎'}) RETURN d.cure_way"
    },
    {
        "input": "我手湼了发现自己遗精了好吗？",
        "cypher": "MATCH (m:Disease {name:'遗精'})-[:belongs_to]->(b:Department) RETURN b.name AS name"
    },
    {
        "input": "患多囊卵巢综合征是怎么回事",
        "cypher": "MATCH (m:Disease {name:'多囊卵巢综合征'}) RETURN m.get_prob"
    },
    {
        "input": "宝宝急性肠炎用冰球好了以后还有必要在检查吗？",
        "cypher": "MATCH (n:Disease {name: '急性肠炎'})-[:need_check]->(m:Check) RETURN m"
    },
    {
        "input": "请问出现卵巢囊肿用什么药物或者别的治疗方法？",
        "cypher": "MATCH (n:Disease {name: '卵巢囊肿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "广西哪有治疗肾积水的医院",
        "cypher": "MATCH (v1:Disease {name: '肾积水'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "风湿性心脏病是一种什么样的病，危险性多大？怎",
        "cypher": "MATCH (n:Disease {name:'风湿性心脏病'}) RETURN n.get_prob,n.cure_lasttime,n.cured_prob"
    },
    {
        "input": "请问如何确定是不是高血压",
        "cypher": "MATCH (m:Disease {name:'高血压'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "视神经胶质瘤咋医治好",
        "cypher": "MATCH (d:Disease {name: '视神经胶质瘤'}) RETURN d.cure_way"
    },
    {
        "input": "昏迷时口吐白沫能治好么",
        "cypher": "MATCH (d:Disease {name: '昏迷'}) RETURN d.cure_way"
    },
    {
        "input": "良性肿瘤短期内迅速增大是怎么回事?",
        "cypher": "MATCH (m:Disease {name:'良性肿瘤'}) RETURN m.desc"
    },
    {
        "input": "脑出血病人日常如何保养",
        "cypher": "MATCH (d:Disease {name: '脑出血'}) RETURN d.easy_get"
    },
    {
        "input": "下面情况是不是偏瘫前兆",
        "cypher": "MATCH (m:Disease {name: '偏瘫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "白带异常会有什么危害",
        "cypher": "MATCH (m:Disease {name:'白带异常'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "小肠肿瘤有什么临场表现？",
        "cypher": "MATCH (m:Disease {name:'小肠肿瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "小儿粘连性肠梗阻能治疗吗",
        "cypher": "MATCH (d:Disease {name: '小儿粘连性肠梗阻'}) RETURN d.cure_way"
    },
    {
        "input": "脊髓炎后遗症是什么",
        "cypher": "MATCH (v1:Disease {name: '脊髓炎'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "冠心病是什么意思",
        "cypher": "MATCH (m:Disease {name:'冠心病'}) RETURN m.name,m.desc"
    },
    {
        "input": "小儿支气管哮喘的症状表现有哪些呢",
        "cypher": "MATCH (m:Disease {name:'小儿支气管哮喘'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "不知道是不是宫颈息肉",
        "cypher": "MATCH (m:Disease {name:'宫颈息肉'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "我的儿子是白血病吗？",
        "cypher": "MATCH (m:Disease {name: '白血病'}) RETURN m"
    },
    {
        "input": "有哪些中药能治疗肾盂肿瘤吗？",
        "cypher": "MATCH (v1:Disease {name: '肾盂肿瘤'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "呼吸会不会得癌症?",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:belongs_to]->(n:Department) RETURN m.get_prob"
    },
    {
        "input": "请问，70岁的老人得了炎性乳腺癌，不能手",
        "cypher": "MATCH (d:Disease {name: '炎性乳腺癌'}) RETURN d.easy_get"
    },
    {
        "input": "慢性宫颈炎具体会有什么症状？",
        "cypher": "MATCH (m:Disease {name:'慢性宫颈炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "不射精症这样症状要怎么治疗效果好点那？",
        "cypher": "MATCH (d:Disease {name: '不射精症'}) RETURN d.cure_way"
    },
    {
        "input": "我想问一下这是不是佝偻病。",
        "cypher": "MATCH (m:Disease {name: '佝偻病'}) RETURN m"
    },
    {
        "input": "葡萄胎怎么办",
        "cypher": "MATCH (d:Disease {name: '葡萄胎'}) RETURN d.cure_way"
    },
    {
        "input": "脑室内出血，求治疗办法",
        "cypher": "MATCH (d:Disease {name: '脑室内出血'}) RETURN d.cure_way"
    },
    {
        "input": "地方性甲状腺肿是什么病？",
        "cypher": "MATCH (m:Disease {name:'地方性甲状腺肿'}) RETURN m.name,m.desc"
    },
    {
        "input": "我这是前列腺炎还是尿道炎呢？",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, collect(n.name)"
    },
    {
        "input": "什么原因引起的小脑萎缩",
        "cypher": "MATCH (m:Disease {name:'小脑萎缩'}) RETURN m.cause"
    },
    {
        "input": "原发性腹膜炎怎么回事",
        "cypher": "MATCH (m:Disease {name:'原发性腹膜炎'}) RETURN m"
    },
    {
        "input": "喉癌术后复发因素是什么",
        "cypher": "MATCH (n:Disease {name: '喉癌'})-[:acompany_with]-(m:Disease) RETURN m.cause"
    },
    {
        "input": "如何预防新生儿呼吸暂停？",
        "cypher": "MATCH (m:Disease {name:'新生儿呼吸暂停'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "您好复查子宫肌瘤和软巢囊肿",
        "cypher": "MATCH (d:Disease {name: '子宫肌瘤'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "孕酮正常也会流产吗",
        "cypher": "MATCH (m:Disease {name: '流产'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "吃什么治疗好转偏瘫？",
        "cypher": "MATCH (v1:Disease {name: '偏瘫'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "请问肠炎危害大吗",
        "cypher": "MATCH (m:Disease {name:'肠炎'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "帕金森病是一种什么类型的疾病？",
        "cypher": "MATCH (m:Disease {name: '帕金森病'}) RETURN m.type"
    },
    {
        "input": "霉菌性阴道炎一般采用什么治疗方法效果好？",
        "cypher": "MATCH (d:Disease {name: '霉菌性阴道炎'}) RETURN d.cure_way"
    },
    {
        "input": "精液不液化是什么情况",
        "cypher": "MATCH (n:Disease {name:'精液不液化'}) RETURN n"
    },
    {
        "input": "小儿遗尿的治疗方法有哪些？",
        "cypher": "MATCH (d:Disease {name: '小儿遗尿'}) RETURN d.cure_way"
    },
    {
        "input": "新生儿溶血病的诊断依据？",
        "cypher": "MATCH (m:Disease {name:'新生儿溶血病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "治疗胰腺炎什么好药可以服用",
        "cypher": "MATCH (v1:Disease {name: '胰腺炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "中度脂肪肝是肥胖吗",
        "cypher": "MATCH (d:Disease {name: '中度脂肪肝'}) RETURN d.easy_get"
    },
    {
        "input": "结节性血管炎，要不要吃药，西药好还是中药",
        "cypher": "MATCH (d:Disease {name: '结节性血管炎'})-[:common_drug|:recommand_drug]->(dr:Drug) RETURN dr.name"
    },
    {
        "input": "胆囊息肉这样的病症到底是怎样的一种疾病那?",
        "cypher": "MATCH (m:Disease {name:'胆囊息肉'}) RETURN m"
    },
    {
        "input": "本人很胖身上长了肥胖纹",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '肥胖纹' RETURN n.name"
    },
    {
        "input": "是否是白血病",
        "cypher": "MATCH (n:Disease {name:'白血病'}) RETURN n"
    },
    {
        "input": "我的一位亲戚得了一种奇怪的病说是重症肌无力这",
        "cypher": "MATCH (m:Disease {name: '重症肌无力'})-[:belongs_to]->(b:Department) RETURN b.name AS name"
    },
    {
        "input": "一直恶心是什么原因？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'恶心'}) RETURN m.name"
    },
    {
        "input": "近1年来我偶尔小便会刺痛",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name CONTAINS '小便刺痛' RETURN n.name"
    },
    {
        "input": "犯心绞痛怎样缓解最快？",
        "cypher": "MATCH (d:Disease {name: '心绞痛'}) RETURN d.cure_way"
    },
    {
        "input": "请问这是肺结核吗",
        "cypher": "MATCH (m:Disease {name:'肺结核'}) RETURN m"
    },
    {
        "input": "肾结石会引起什么病",
        "cypher": "MATCH (m:Disease {name: '肾结石'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "胚胎停育会不会误诊？",
        "cypher": "MATCH (m:Disease {name:'胚胎停育'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "乙肝到底是怎么得的呢？",
        "cypher": "MATCH (m:Disease {name:'乙肝'}) RETURN m.cause"
    },
    {
        "input": "排卵期同房后五六天乳房胀痛，过一周后不痛了，",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '乳房胀痛' RETURN d.name"
    },
    {
        "input": "请问是肝癌晚期吗？",
        "cypher": "MATCH (m:Disease {name: '肝癌'}) RETURN m.get_way"
    },
    {
        "input": "风湿病的症状是怎样的？",
        "cypher": "MATCH (n:Disease {name: '风湿病'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "我想咨询盆腔炎如何用药？",
        "cypher": "MATCH (v1:Disease {name: '盆腔炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "石家庄哪有医治胃炎的医院",
        "cypher": "MATCH (v1:Disease {name: '胃炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "癫痫的发病有什么规律吗?",
        "cypher": "MATCH (n:Disease {name: '癫痫'}) RETURN n.get_prob"
    },
    {
        "input": "中耳癌的注意事项有哪些？",
        "cypher": "MATCH (m:Disease {name:'中耳癌'}) RETURN m.prevent"
    },
    {
        "input": "我先生在睾丸上长个血管瘤请问严..",
        "cypher": "MATCH (m:Disease {name: '血管瘤'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "泪囊炎怎么治",
        "cypher": "MATCH (d:Disease {name: '泪囊炎'}) RETURN d.cure_way"
    },
    {
        "input": "遗尿是一种病症吗",
        "cypher": "MATCH (m:Disease {name: '遗尿'}) RETURN m"
    },
    {
        "input": "乳腺癌会发展成什么样？",
        "cypher": "MATCH (m1:Disease {name: '乳腺癌'})-[:acompany_with]-(m2:Disease) RETURN m2"
    },
    {
        "input": "子宫肌瘤的注意事项",
        "cypher": "MATCH (m:Disease {name:'子宫肌瘤'}) RETURN m.prevent"
    },
    {
        "input": "郑州找妇科医院，选择郑州哪家妇科医院好",
        "cypher": "MATCH (v1:Disease {name: '妇科疾病'})-[:belongs_to]->(v2:Department {name: '妇科'}) RETURN v2"
    },
    {
        "input": "肝硬化是因为什么引起的呢？",
        "cypher": "MATCH (n:Disease {name: '肝硬化'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "来月经的时候痛经和月经量少怎么办呢？",
        "cypher": "MATCH (m:Disease {name:'痛经'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "结肠炎患者要注意什么",
        "cypher": "MATCH (m:Disease {name:'结肠炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "怎么检查肝纤维化",
        "cypher": "MATCH (v1:Disease {name: '肝纤维化'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "性早熟发育了!这是真的吗",
        "cypher": "MATCH (m:Disease {name: '性早熟'}) RETURN m.get_prob"
    },
    {
        "input": "呼吸困难怎么处理",
        "cypher": "MATCH (m:Disease)-[:has_symptom]->(n:Symptom {name:'呼吸困难'}) RETURN m.cureWay"
    },
    {
        "input": "肾细胞癌右肾切除术后要注意些什么",
        "cypher": "MATCH (d:Disease {name: '肾细胞癌'}) RETURN d.cure_way"
    },
    {
        "input": "自身免疫性肝病症状是什么？",
        "cypher": "MATCH (m:Disease {name:'自身免疫性肝病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "五个多月的宝宝支气管肺炎住了后呼吸困难怎么回",
        "cypher": "MATCH (d:Disease {name: '支气管肺炎'})-[:has_symptom]->(s:Symptom {name: '呼吸困难'}) RETURN d, s"
    },
    {
        "input": "喝酒会导致肝硬化吗？",
        "cypher": "MATCH (m:Disease {name: '肝硬化'})  RETURN m.cause"
    },
    {
        "input": "瘫痪病人怎样做好基础护理",
        "cypher": "MATCH (d:Disease {name: '瘫痪'}) RETURN d.cure_way"
    },
    {
        "input": "我爸爸今年61岁今年查处结肠癌中",
        "cypher": "MATCH (d:Disease {name: '结肠癌'}) RETURN d.easy_get"
    },
    {
        "input": "肺癌中期扩散有多快",
        "cypher": "MATCH (d:Disease {name: '肺癌'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "男，请问被女人口交会感染上艾滋病吗？单是这种",
        "cypher": "MATCH (d:Disease {name: '艾滋病'})-[:acompany_with]-(r:Disease) RETURN r.name"
    },
    {
        "input": "请问医师面瘫看什么科室？",
        "cypher": "MATCH (v1:Disease {name: '面瘫'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "请问浅表性胃炎、十二指肠球炎吃什么食物好",
        "cypher": "MATCH (v1:Disease {name: '浅表性胃炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "一般哪些因素容易导致包皮过长？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '包皮过长' RETURN m.desc"
    },
    {
        "input": "怎么判断输精管堵塞？",
        "cypher": "MATCH (m:Disease {name: '输精管堵塞'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "得了脑膜瘤手术后遗症有哪些",
        "cypher": "MATCH (m:Disease {name: '脑膜瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "感染了EB病毒如何治?",
        "cypher": "MATCH (d:Disease {name: 'EB病毒感染'}) RETURN d.cure_way"
    },
    {
        "input": "17个月婴儿急性喉炎",
        "cypher": "MATCH (d:Disease {name: '急性喉炎'}) RETURN d.easy_get"
    },
    {
        "input": "混合痔具体的治疗费用",
        "cypher": "MATCH (n:Disease {name: '混合痔'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "哪个年龄段的人容易患脑炎后遗症",
        "cypher": "MATCH (d:Disease {name: '脑炎后遗症'}) RETURN d.easy_get"
    },
    {
        "input": "得了前列腺增生应该吃一些什么药物会好一点呢？",
        "cypher": "MATCH (v1:Disease {name: '前列腺增生'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "毛细血管瘤是一种什么样的病呢？",
        "cypher": "MATCH (m:Disease {name:'毛细血管瘤'}) RETURN m"
    },
    {
        "input": "请问小叶增生有什么方法治疗？",
        "cypher": "MATCH (d:Disease {name: '小叶增生'}) RETURN d.cure_way"
    },
    {
        "input": "子宫肌瘤要怎么调理",
        "cypher": "MATCH (d:Disease {name: '子宫肌瘤'})-[:do_eat]->(f:Food) RETURN f.name"
    }
]