[
    {
        "input": "治疗肺纤维化有什么好的中成药或药方吗？",
        "cypher": "MATCH (n:Disease {name: '肺纤维化'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "酒精中毒引起的精神障碍",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE d.name = '酒精中毒' AND s.name = '精神障碍' RETURN d,r,s"
    },
    {
        "input": "脑膜炎应该怎么确诊治疗?",
        "cypher": "MATCH (m:Disease {name:'脑膜炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "出现外痔是怎么回事",
        "cypher": "MATCH (m:Disease {name: '外痔'}) RETURN m.cause"
    },
    {
        "input": "小儿脑瘫吃什么食物好",
        "cypher": "MATCH (v1:Disease {name: '小儿脑瘫'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "女56岁绝经8年了正常吗",
        "cypher": "MATCH (d:Disease {name: '绝经'}) RETURN d.easy_get"
    },
    {
        "input": "咳嗽和风寒咳嗽病症是什么",
        "cypher": "MATCH (m:Disease {name:'咳嗽'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "如何治疗急性膀胱炎",
        "cypher": "MATCH (d:Disease {name: '急性膀胱炎'}) RETURN d.cure_way"
    },
    {
        "input": "目前中国肝癌防治的现状",
        "cypher": "MATCH (v1:Disease {name: '肝癌'})-[:belongs_to]->(v2:Department) RETURN v2.name AS 科室名称"
    },
    {
        "input": "利普刀做宫颈糜烂前能用阴道镜检查吗",
        "cypher": "MATCH (v1:Disease {name: '宫颈糜烂'})-[:need_check]->(v2:Check {name: '阴道镜检查'}) RETURN v2"
    },
    {
        "input": "宫颈癌会传染吗?",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'}) RETURN m.get_way"
    },
    {
        "input": "白带异常好像是褐色的怎么调理",
        "cypher": "MATCH (m:Disease {name:'白带异常'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "急性胆囊炎吃什么好？",
        "cypher": "MATCH (v1:Disease {name: '急性胆囊炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肝硬化应该吃什么药",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "宫颈糜烂要检查费用贵吗",
        "cypher": "MATCH (n:Disease {name: '宫颈糜烂'})-[:need_check]->(m:Check) RETURN m.name, n.cost_money"
    },
    {
        "input": "肝硬化到底严不严重",
        "cypher": "MATCH (m:Disease {name: '肝硬化'}) RETURN m.cure_lasttime, m.cured_prob"
    },
    {
        "input": "面肌痉挛怎样缓解",
        "cypher": "MATCH (d:Disease {name: '面肌痉挛'}) RETURN d.cure_way"
    },
    {
        "input": "坐在电脑前就想睡觉是怎么回事",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'疲劳'}) RETURN m.name"
    },
    {
        "input": "宫颈癌吃什么对自己的身体好？",
        "cypher": "MATCH (v1:Disease {name: '宫颈癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "溃疡性结肠炎灌肠后无黏液便是否需治疗",
        "cypher": "MATCH (d:Disease {name: '溃疡性结肠炎'}) RETURN d.cure_way"
    },
    {
        "input": "小儿肺炎吃什么食物相对较好",
        "cypher": "MATCH (v1:Disease {name: '小儿肺炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "什么是糖尿病酮症酸中毒？",
        "cypher": "MATCH (m:Disease {name:'糖尿病酮症酸中毒'}) RETURN m.desc"
    },
    {
        "input": "怀孕的女人得甲亢有什么其他症状",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "深圳哪有治疗直肠癌的医院？",
        "cypher": "MATCH (v1:Disease {name: '直肠癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "怎么样确诊变异性哮喘",
        "cypher": "MATCH (m:Disease {name:'变异性哮喘'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "为什么血压一直很高",
        "cypher": "MATCH (n:Disease {name: '高血压'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "包皮龟头炎病因有哪些呢？",
        "cypher": "MATCH (n:Disease {name: '包皮龟头炎'}) RETURN n.cause"
    },
    {
        "input": "哪个地方治三叉神经痛治的最好是怎么治疗的呀?",
        "cypher": "MATCH (n1:Disease {name: '三叉神经痛'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "妊娠期糖尿病到了预产期一定住院吗",
        "cypher": "MATCH (d:Disease {name: '妊娠期糖尿病'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "手臂上长了血管瘤",
        "cypher": "MATCH (m:Disease {name: '血管瘤'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "预防卵巢癌要怎么进行处理好些呢",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "附件炎的临床症状都有哪些？",
        "cypher": "MATCH (m:Disease {name:'附件炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脂肪肝的临床表现",
        "cypher": "MATCH (n:Disease {name: '脂肪肝'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "畸胎瘤术后会对生育产生影响吗",
        "cypher": "MATCH (d:Disease {name: '畸胎瘤'}) RETURN d.cure_way"
    },
    {
        "input": "肿瘤??",
        "cypher": "MATCH (n:Disease {name: '肿瘤'}) RETURN n"
    },
    {
        "input": "石家庄什么医院治疗慢性肠炎好",
        "cypher": "MATCH (v1:Disease {name: '慢性肠炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "什么是浅部急性淋巴结炎和淋巴管炎啊？",
        "cypher": "MATCH (m:Disease)WHERE m.name = '浅部急性淋巴结炎和淋巴管炎' RETURN m.desc"
    },
    {
        "input": "脂肪肝会遗传的吗",
        "cypher": "MATCH (n:Disease {name: '脂肪肝'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "男性不育症怎样做检查",
        "cypher": "MATCH (v1:Disease {name: '男性不育症'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "手术引起的癫痫后遗症有哪些呢？",
        "cypher": "MATCH (n:Disease {name: '癫痫'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "龟头炎长疙瘩哪家医院能看好？",
        "cypher": "MATCH (n1:Disease {name: '龟头炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "多动症治疗大概需要多少费用?",
        "cypher": "MATCH (n:Disease {name: '多动症'}) RETURN n.cost_money"
    },
    {
        "input": "老烂腿用两种中药治好可能吗？",
        "cypher": "MATCH (n1:Disease {name: '老烂腿'})-[:common_drug|:recommand_drug]->(n2:Drug) RETURN n2.name"
    },
    {
        "input": "血液病都分哪几种？",
        "cypher": "MATCH (v:Disease {name: '血液病'})-[:acompany_with]->(v1:Disease) RETURN v1.name"
    },
    {
        "input": "得了扁桃体炎哪里治疗好",
        "cypher": "MATCH (v1:Disease {name: '扁桃体炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "遗传性共济失调有救吗",
        "cypher": "MATCH (d:Disease {name: '遗传性共济失调'}) RETURN d.cure_way"
    },
    {
        "input": "新生儿缺氧缺血性脑病是什么病呢？",
        "cypher": "MATCH (m:Disease {name:'新生儿缺氧缺血性脑病'}) return m"
    },
    {
        "input": "血管瘤要多久才治疗呀？",
        "cypher": "MATCH (n:Disease {name: '血管瘤'}) RETURN n.cure_lasttime"
    },
    {
        "input": "强直性脊柱炎吃什么？",
        "cypher": "MATCH (v1:Disease {name: '强直性脊柱炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肠癌患者要注意什么?",
        "cypher": "MATCH (m:Disease {name: '肠癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "小中风高血脂糖尿病高血压混合怎么办",
        "cypher": "MATCH (m:Disease {name:'高血压'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "治疗多动症费用一般多少钱？",
        "cypher": "MATCH (n:Disease {name: '多动症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "得了输卵管粘连怎么看病",
        "cypher": "MATCH (v1:Disease {name: '输卵管粘连'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "脾大多少是正常？",
        "cypher": "MATCH (m:Disease {name: '脾大'}) RETURN m.get_prob"
    },
    {
        "input": "巨人症的症状",
        "cypher": "MATCH (m:Disease {name:'巨人症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "请教一下我这个是膀胱还是什么原因？",
        "cypher": "MATCH (m:Disease {name: '膀胱炎'}) RETURN m"
    },
    {
        "input": "老人得了咽喉炎怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '咽喉炎'}) RETURN d.cure_way"
    },
    {
        "input": "有颈部好几处淋巴结肿大什么原因",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '颈部淋巴结肿大' RETURN m.name"
    },
    {
        "input": "胰腺癌肝转移的症状是什么样子的呢？",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'})-[:acompany_with]->(n:Disease)-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "乙肝症状是什么？",
        "cypher": "MATCH (m:Disease {name:'乙肝'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "宫颈癌是一种什么样的疾病",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'}) RETURN m"
    },
    {
        "input": "病毒性肝炎抗病毒服药期间可以要小孩吗",
        "cypher": "MATCH (d:Disease {name: '病毒性肝炎'}) RETURN d.easy_get"
    },
    {
        "input": "支气管扩张是容易传染的吗",
        "cypher": "MATCH (n:Disease {name: '支气管扩张'}) RETURN n.get_way"
    },
    {
        "input": "慢性咽炎最近喉咙不舒服什么原因",
        "cypher": "MATCH (m:Disease {name:'慢性咽炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肱骨骨干有黑影是骨囊肿吗？",
        "cypher": "MATCH (m:Disease {name:'骨囊肿'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "请问肾炎会遗传吗",
        "cypher": "MATCH (n:Disease {name: '肾炎'}) RETURN n.cause"
    },
    {
        "input": "药物对癌症病人有效吗?",
        "cypher": "MATCH (v1:Disease {name: '癌症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "糖尿病哪里治疗效果比较好？",
        "cypher": "MATCH (v1:Disease {name: '糖尿病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "膀胱炎的症状和前兆有哪些呢",
        "cypher": "MATCH (m:Disease {name:'膀胱炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "怎样能辨别出的是肾阳虚还是肾阴虚",
        "cypher": "MATCH (m:Disease {name:'肾阳虚'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "宝宝感冒咳嗽流鼻涕而且呼吸急促怎么缓解？",
        "cypher": "MATCH (d:Disease {name: '感冒'}) RETURN d.cure_way"
    },
    {
        "input": "骨癌会遗传吗？",
        "cypher": "MATCH (m:Disease {name: '骨癌'}) RETURN m.get_way"
    },
    {
        "input": "早泄的症状?要咋办",
        "cypher": "MATCH (d:Disease {name: '早泄'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "宝宝贫血但不缺铁怎么回事？",
        "cypher": "MATCH (m:Disease {name:'贫血'})<-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "菌血症的综合治疗需要多长时间的呢",
        "cypher": "MATCH (d:Disease {name: '菌血症'}) RETURN d.cure_way"
    },
    {
        "input": "腹外疝这个病有什么好的治疗方法吗我应该多多注",
        "cypher": "MATCH (d:Disease {name: '腹外疝'}) RETURN d.cure_way"
    },
    {
        "input": "包皮过长的手术需要做什么检验",
        "cypher": "MATCH (v1:Disease {name: '包皮过长'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "什么方法可以预防阳痿？",
        "cypher": "MATCH (n1:Disease {name: '阳痿'})-[:belongs_to]->(n2:Department) RETURN n1.prevent"
    },
    {
        "input": "阴道炎症状都是什么",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '阴道炎' RETURN n.name"
    },
    {
        "input": "乙肝阳性的应该吃什么药物",
        "cypher": "MATCH (v1:Disease {name: '乙肝'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肺癌的病因是啥？",
        "cypher": "MATCH (n:Disease {name: '肺癌'}) RETURN n.cause"
    },
    {
        "input": "肝癌晚期临终前症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "低血压正常值最新标准？",
        "cypher": "MATCH (m:Disease {name:'低血压'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "前列腺癌根除术后又做了去世手术，现在的主要症",
        "cypher": "MATCH (d:Disease {name: '前列腺癌'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "直肠息肉成直肠癌可能性大吗？",
        "cypher": "MATCH (m:Disease {name:'直肠息肉'})-[:acompany_with]-(n:Disease {name:'直肠癌'}) RETURN m.cure_lasttime"
    },
    {
        "input": "宝宝脑膜炎能预防吗？",
        "cypher": "MATCH (n:Disease {name: '脑膜炎'}) RETURN n.prevent"
    },
    {
        "input": "怎么能预防宫颈糜烂",
        "cypher": "MATCH (n:Disease {name: '宫颈糜烂'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "请问窦性心动过缓怎么办？",
        "cypher": "MATCH (d:Disease {name: '窦性心动过缓'}) RETURN d.cure_way"
    },
    {
        "input": "治疗食管癌医院哪家最好",
        "cypher": "MATCH (v1:Disease {name: '食管癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "如何判断是否为小儿缺铁性贫血",
        "cypher": "MATCH (m:Disease {name:'小儿缺铁性贫血'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "运动神经元病能活多少年？",
        "cypher": "MATCH (n:Disease {name: '运动神经元病'}) RETURN n.cure_lasttime"
    },
    {
        "input": "胃癌哪里检查的好",
        "cypher": "MATCH (v1:Disease {name: '胃癌'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "新生儿泪囊炎泪道堵塞如何能打通呢",
        "cypher": "MATCH (d:Disease {name: '新生儿泪囊炎'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺增生患者要注意什么？",
        "cypher": "MATCH (m:Disease {name: '前列腺增生'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "尖锐湿疣通过什么能检查出来",
        "cypher": "MATCH (m:Disease {name: '尖锐湿疣'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "脂肪瘤不能吃哪些东西",
        "cypher": "MATCH (v1:Disease {name: '脂肪瘤'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "几种中药的作用",
        "cypher": "MATCH (v:Drug)-[:common_drug|:recommand_drug]-(d:Disease) RETURN v.name AS name, d.name AS diseaseName"
    },
    {
        "input": "艾灸能治疗肾病吗",
        "cypher": "MATCH (d:Disease {name: '肾病'}) RETURN d.cure_way"
    },
    {
        "input": "我儿子有先天性耳前瘘管是遗传的可能吗",
        "cypher": "MATCH (n:Disease {name: '先天性耳前瘘管'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "登革热的发病原理有哪些",
        "cypher": "MATCH (n:Disease {name: '登革热'})-[:acompany_with]-(m:Disease) RETURN m.cause"
    },
    {
        "input": "孩子近视100度，不戴眼镜行不行",
        "cypher": "MATCH (d:Disease {name: '近视'}) RETURN d.cure_way"
    },
    {
        "input": "窦性心动过速低导致钾血症要咋办",
        "cypher": "MATCH (d:Disease {name: '窦性心动过速'}) RETURN d.cure_way"
    },
    {
        "input": "我老公得了死精症该如何处理较好？",
        "cypher": "MATCH (m:Disease {name:'死精症'}) RETURN m.cure_way"
    },
    {
        "input": "月经不规律痛经怎么回事啊？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'痛经'}) RETURN m.name"
    },
    {
        "input": "74岁老人，初步诊断为肝癌，西安治疗肝癌的好",
        "cypher": "MATCH (d:Disease {name: '肝癌'})-[:belongs_to]->(dp:Department)<-[:belongs_to]-(d2:Disease) RETURN d2.name"
    },
    {
        "input": "肺气肿的存活期是多久",
        "cypher": "MATCH (n:Disease {name: '肺气肿'}) RETURN n.cure_lasttime"
    },
    {
        "input": "痢疾传播途径是什么",
        "cypher": "MATCH (v1:Disease {name: '痢疾'})-[:acompany_with]-(v2:Disease) RETURN v2.get_way"
    },
    {
        "input": "前列腺囊肿患者应该吃什么好",
        "cypher": "MATCH (v1:Disease {name: '前列腺囊肿'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "甲状腺癌患者如何进行饮食调理？",
        "cypher": "MATCH (m:Disease {name: '甲状腺癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "宝宝是否得了中耳炎，需要看医生吗",
        "cypher": "MATCH (m:Disease {name:'中耳炎'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "肥厚型梗阻性心肌病的最佳治疗方",
        "cypher": "MATCH (d:Disease {name: '肥厚型梗阻性心肌病'}) RETURN d.cure_way"
    },
    {
        "input": "我有糖尿病4年吃了很多药降不下来怎么办？",
        "cypher": "MATCH (d:Disease {name: '糖尿病'}) RETURN d.cure_way"
    },
    {
        "input": "小细胞肺癌有药吗",
        "cypher": "MATCH (m:Disease {name:'小细胞肺癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "脑瘤通过磁共振和CT就能诊断吗？",
        "cypher": "MATCH (m:Disease {name:'脑瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "急性胆囊炎需要手术吗",
        "cypher": "MATCH (d:Disease {name: '急性胆囊炎'}) RETURN d.cure_way"
    },
    {
        "input": "鼻咽癌10年鼻涕多，黄臭用什么药？",
        "cypher": "MATCH (n:Disease {name: '鼻咽癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "神经源性肿瘤严重吗？",
        "cypher": "MATCH (m:Disease {name:'神经源性肿瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "隐睾怎么治疗",
        "cypher": "MATCH (d:Disease {name: '隐睾'}) RETURN d.cure_way"
    },
    {
        "input": "小儿癫痫病的发病率高吗？",
        "cypher": "MATCH (n:Disease {name: '小儿癫痫'}) RETURN n.get_prob"
    },
    {
        "input": "输卵管积水是如何引起的？",
        "cypher": "MATCH (m:Disease {name:'输卵管积水'})RETURN m.cause"
    },
    {
        "input": "大夫我家宝宝得了肠炎怎么办？",
        "cypher": "MATCH (d:Disease {name: '肠炎'}) RETURN d.cure_way"
    },
    {
        "input": "怎治胆囊良性肿瘤的啊？",
        "cypher": "MATCH (d:Disease {name: '胆囊良性肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "山东哪家医院治疗不射精症的效果是最明显的呢？",
        "cypher": "MATCH (n1:Disease {name: '不射精症'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "非霍奇金淋巴瘤去哪里治疗好",
        "cypher": "MATCH (v1:Disease {name: '非霍奇金淋巴瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "新生儿黄疸医保报销吗？",
        "cypher": "MATCH (n:Disease {name: '新生儿黄疸'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "前列腺增生微创手术后血尿怎么办",
        "cypher": "MATCH (d:Disease {name: '前列腺增生'})-[:has_symptom]->(s:Symptom {name: '血尿'}) RETURN s"
    },
    {
        "input": "重症肌无力可以自愈吗",
        "cypher": "MATCH (n:Disease {name: '重症肌无力'}) RETURN n.cured_prob"
    },
    {
        "input": "新生儿黄疸蓝光多少钱？",
        "cypher": "MATCH (n:Disease {name:'新生儿黄疸'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "得了巧克力囊肿以后的症状会出现哪些呢？",
        "cypher": "MATCH (m:Disease {name:'巧克力囊肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肋软骨炎是什么病啊？",
        "cypher": "MATCH (m:Disease {name:'肋软骨炎'}) RETURN m.name,m.desc"
    },
    {
        "input": "做疝气手术需要吃些什么比较合适",
        "cypher": "MATCH (v1:Disease {name: '疝气'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "男孩早泄到底是什么方面引起的",
        "cypher": "MATCH (m:Disease {name: '早泄'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "高血压三高是哪三高？",
        "cypher": "MATCH (v1:Disease {name: '高血压'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "前列腺增生患者平时应该注意什么",
        "cypher": "MATCH (d:Disease {name: '前列腺增生'}) RETURN d.easy_get"
    },
    {
        "input": "甲状腺炎怎么治疗啊",
        "cypher": "MATCH (d:Disease {name: '甲状腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "肝硬化发展到晚期会出现什么症状",
        "cypher": "MATCH (m:Disease {name: '肝硬化'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "前列腺炎之后的困扰。",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "癫痫病人怎么选择避孕药?",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "霉菌性阴道炎有何表现",
        "cypher": "MATCH (m:Disease {name:'霉菌性阴道炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "闭经造成子宫萎缩怎么办",
        "cypher": "MATCH (m:Disease {name:'闭经'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "月经发黑是怎么回事？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'月经发黑'}) RETURN m.name"
    },
    {
        "input": "宝宝连续三天吃什么拉什么这种状况怎么办？",
        "cypher": "MATCH (m:Disease {name:'腹泻'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "淋巴癌有潜伏期吗是多久？",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'})-[:acompany_with]->(n:Disease) RETURN n.get_lasttime"
    },
    {
        "input": "盆腔积液需要注意哪些问题",
        "cypher": "MATCH (d:Disease {name: '盆腔积液'}) RETURN d.easy_get"
    },
    {
        "input": "妇科炎症这个病平时注意什么？",
        "cypher": "MATCH (n:Disease {name: '妇科炎症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "包皮过长通常会有哪些危害会好些呢",
        "cypher": "MATCH (m:Disease {name:'包皮过长'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "怎么预防结肠癌?",
        "cypher": "MATCH (m:Disease {name:'结肠癌'}) RETURN m.prevent"
    },
    {
        "input": "是痔疮还是肛裂怎么办才比较好",
        "cypher": "MATCH (m:Disease {name:'痔疮'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "淋巴瘤患者营养食谱",
        "cypher": "MATCH (v1:Disease {name: '淋巴瘤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "吃治疗抑郁症的药吃了两年多了能不能怀孕？",
        "cypher": "MATCH (n:Disease {name: '抑郁症'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "胃下垂吃什么药       医生？",
        "cypher": "MATCH (n:Disease {name:'胃下垂'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "血管瘤脸上长血管瘤严重吗？对孩子的危险性",
        "cypher": "MATCH (m:Disease {name: '血管瘤'})-[:belongs_to]->(n:Department) RETURN m.get_prob, m.cure_lasttime, m.cured_prob, m.cost_money"
    },
    {
        "input": "苯丙酮尿症看什么科",
        "cypher": "MATCH (v1:Disease {name: '苯丙酮尿症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "癫痫三五天发作一次怎么回事？",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:acompany_with]->(n:Disease) RETURN m.cause,n.name"
    },
    {
        "input": "先天性心脏病，主肺动脉完全错位，单心室，肺动",
        "cypher": "MATCH (d:Disease {name: '先天性心脏病'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "疝气手术后会在复发吗？",
        "cypher": "MATCH (n:Disease {name: '疝气'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "自然流产两次都是刚怀孕几天怎么回事",
        "cypher": "MATCH (m:Disease {name: '自然流产'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "妇科炎症灸哪里比较好？",
        "cypher": "MATCH (v1:Disease {name: '妇科炎症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肝炎可以分为哪几类",
        "cypher": "MATCH (v1:Disease {name: '肝炎'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "阿尔茨海默病治疗的办法有哪些呢？",
        "cypher": "MATCH (d:Disease {name: '阿尔茨海默病'}) RETURN d.cure_way"
    },
    {
        "input": "求口臭的药有哪些？",
        "cypher": "MATCH (v1:Disease {name: '口臭'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "常规治疗宫颈糜烂用什么药",
        "cypher": "MATCH (n:Disease {name: '宫颈糜烂'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "三叉神经痛不能吃什么？",
        "cypher": "MATCH (m:Disease {name:'三叉神经痛'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "肿瘤都有什么明显症状",
        "cypher": "MATCH (m:Disease {name: '肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "支原体肺炎反复发作怎么办？",
        "cypher": "MATCH (d:Disease {name: '支原体肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "请问肺结核症状有哪些",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '肺结核' RETURN n.name"
    },
    {
        "input": "前列腺炎严不严重？",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "在医院检查是癫痫",
        "cypher": "MATCH (m:Disease {name: '癫痫'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "肝肿瘤和风湿心胀病能否动手术",
        "cypher": "MATCH (d:Disease {name: '肝肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "慢性咳嗽应该如何服药",
        "cypher": "MATCH (v1:Disease {name: '慢性咳嗽'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "偏头痛一周了吃什么",
        "cypher": "MATCH (v1:Disease {name: '偏头痛'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "血管瘤要注意什么？",
        "cypher": "MATCH (m:Disease {name:'血管瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "前列腺结石需要做哪些检查",
        "cypher": "MATCH (v1:Disease {name: '前列腺结石'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "请问中风危害怎么避免",
        "cypher": "MATCH (m:Disease {name:'中风'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "食管血管瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'食管血管瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "治好癫痫一般需要花多长时间？",
        "cypher": "MATCH (n:Disease {name: '癫痫'}) RETURN n.cure_lasttime"
    },
    {
        "input": "盆腔积液打哪些消炎针",
        "cypher": "MATCH (v1:Disease {name: '盆腔积液'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "小儿支原体肺炎诊断要点是什么？",
        "cypher": "MATCH (m:Disease {name:'小儿支原体肺炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "继发性高血压应该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '继发性高血压'}) RETURN d.cure_way"
    },
    {
        "input": "脑萎缩这种病是怎么回事",
        "cypher": "MATCH (m:Disease {name:'脑萎缩'}) RETURN m"
    },
    {
        "input": "我月经不调,想要宝宝,可总不来月经,我做",
        "cypher": "MATCH (d:Disease {name: '月经不调'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "如何治疗慢性咳嗽较好",
        "cypher": "MATCH (d:Disease {name: '慢性咳嗽'}) RETURN d.cure_way"
    },
    {
        "input": "她前男友曾经虐待过她一次，把手伸进阴道",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '阴道出血' RETURN n.name"
    },
    {
        "input": "胆管炎预后会咋样？",
        "cypher": "MATCH (m:Disease {name: '胆管炎'}) RETURN m.cure_lasttime"
    },
    {
        "input": "肛瘘有几个阶段",
        "cypher": "MATCH (d:Disease {name: '肛瘘'})-[:acompany_with]->(r:Disease) RETURN COUNT(r)"
    },
    {
        "input": "宫颈息肉得了宫颈息肉应当留意什么",
        "cypher": "MATCH (d:Disease {name: '宫颈息肉'}) RETURN d.easy_get"
    },
    {
        "input": "如何避免幽门螺杆菌感染到胃部呢？",
        "cypher": "MATCH (n1:Disease {name: '幽门螺杆菌感染'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "死精症的检查方法有什么",
        "cypher": "MATCH (v1:Disease {name: '死精症'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "心肌炎、心肌缺血应该怎么治疗？该吃什么药？",
        "cypher": "MATCH (d:Disease {name: '心肌炎'}) RETURN d.cure_way"
    },
    {
        "input": "脊髓损伤吃什么可以促进恢复？",
        "cypher": "MATCH (v1:Disease {name: '脊髓损伤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "哪里治疗胰腺癌晚期病情比较有效的！！！！",
        "cypher": "MATCH (n:Disease {name: '胰腺癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "得输卵管炎后怎样治",
        "cypher": "MATCH (d:Disease {name: '输卵管炎'}) RETURN d.cure_way"
    },
    {
        "input": "尤文氏肉瘤的治疗方法有哪些？",
        "cypher": "MATCH (d:Disease {name: '尤文氏肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "我是先天性小耳畸形能治疗好吗？",
        "cypher": "MATCH (d:Disease {name: '先天性小耳畸形'}) RETURN d.cure_way"
    },
    {
        "input": "我会得鼠疫吗",
        "cypher": "MATCH (d:Disease {name: '鼠疫'}) RETURN d.easy_get"
    },
    {
        "input": "苯丙酮尿症患者可以吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '苯丙酮尿症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "宝宝咽喉炎吃哪些药",
        "cypher": "MATCH (v1:Disease {name: '咽喉炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "女人月经量少好？",
        "cypher": "MATCH (m:Disease {name:'月经量少'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "吃加锌盐能够治疗发育迟缓吗？",
        "cypher": "MATCH (d:Disease {name: '发育迟缓'}) RETURN d.cure_way"
    },
    {
        "input": "妇科病用什么药",
        "cypher": "MATCH (v1:Disease {name: '妇科病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "面肌痉挛不治自愈吗?",
        "cypher": "MATCH (m:Disease {name:'面肌痉挛'}) RETURN m.cured_prob"
    },
    {
        "input": "得了糖尿病性视网膜病变怎么办？",
        "cypher": "MATCH (d:Disease {name: '糖尿病性视网膜病变'}) RETURN d.cure_way"
    },
    {
        "input": "原发性痛经每次痛经就腹痛怎么办",
        "cypher": "MATCH (m:Disease {name:'原发性痛经'})-[:has_symptom]->(n:Symptom {name:'腹痛'}) RETURN m.cureWay"
    },
    {
        "input": "小孩扁桃体炎总哭如何合理饮食",
        "cypher": "MATCH (m:Disease {name: '扁桃体炎'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "苯丙酮尿症饮食上注意什么",
        "cypher": "MATCH (v1:Disease {name: '苯丙酮尿症'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "早泄有没有更好的治疗药方？",
        "cypher": "MATCH (n:Disease {name:'早泄'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "甲流的主要症状有什么",
        "cypher": "MATCH (m:Disease {name: '甲流'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "孩子四岁了有一侧睾丸没入阴囊怎么办？",
        "cypher": "MATCH (m:Disease {name:'隐睾'})-[:belongs_to]->(n:Department) RETURN m.cure_way,n.name"
    },
    {
        "input": "慢性结肠炎该吃什么药?",
        "cypher": "MATCH (m:Disease {name:'慢性结肠炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "怎么有效预防胃癌",
        "cypher": "MATCH (d:Disease {name: '胃癌'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "合肥哪有治疗甲状腺结节的医院",
        "cypher": "MATCH (v1:Disease {name: '甲状腺结节'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "前列腺增生怎么注意饮食",
        "cypher": "MATCH (v1:Disease {name: '前列腺增生'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "治龟头炎大概要多少钱",
        "cypher": "MATCH (n:Disease {name:'龟头炎'}) RETURN n.cost_money"
    },
    {
        "input": "支气管炎咳嗽要多长时间好",
        "cypher": "MATCH (n:Disease {name: '支气管炎'})-[:has_symptom]->(m:Symptom {name: '咳嗽'}) RETURN n.cure_lasttime"
    },
    {
        "input": "新生儿胃穿孔咋办比较好？",
        "cypher": "MATCH (d:Disease {name: '新生儿胃穿孔'}) RETURN d.cure_way"
    },
    {
        "input": "脑膜炎需要注意什么问题",
        "cypher": "MATCH (n:Disease {name: '脑膜炎'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称"
    },
    {
        "input": "糖尿病吃什么保健品",
        "cypher": "MATCH (v1:Disease {name: '糖尿病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "骨髓增生异常综合征到哪里能治好?/",
        "cypher": "MATCH (m:Disease {name:'骨髓增生异常综合征'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "什么叫肝损伤？",
        "cypher": "MATCH (m:Disease {name:'肝损伤'}) RETURN m.desc"
    },
    {
        "input": "有了弱视和近视的区别是什么",
        "cypher": "MATCH (m1:Disease {name: '弱视'})-[]->(n1) MATCH (m2:Disease {name: '近视'})-[]->(n2) RETURN m1,n1,m2,n2"
    },
    {
        "input": "中国哪个医院治疗共济失调效果好啊？",
        "cypher": "MATCH (n1:Disease {name: '共济失调'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "前列腺囊肿的原因",
        "cypher": "MATCH (n:Disease {name:'前列腺囊肿'})-[:acompany_with]-(m:Disease) RETURN m.cause"
    },
    {
        "input": "治疗膀胱癌哪里中医最好？",
        "cypher": "MATCH (v1:Disease {name: '膀胱癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "静脉炎怎样才能把炎症消除?",
        "cypher": "MATCH (d:Disease {name: '静脉炎'}) RETURN d.cure_way"
    },
    {
        "input": "治疗尿道炎，诺氟沙星好呢，还是氧氟沙星好？",
        "cypher": "MATCH (n1:Disease {name: '尿道炎'})-[:common_drug|:recommand_drug]->(n2:Drug) RETURN n2.name"
    },
    {
        "input": "癫痫发病预防及护理方法?",
        "cypher": "MATCH (n:Disease {name: '癫痫'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.prevent AS 预防措施"
    },
    {
        "input": "肾病综合征临床分哪几期？",
        "cypher": "MATCH (n:Disease {name: '肾病综合征'})-[:acompany_with]->(m:Disease) RETURN m.name"
    }
]