[
    {
        "input": "导致男性不育的原因有多少",
        "cypher": "MATCH (v:Disease {name: '男性不育'})-[:diseaseCauseRelation]->(v:cause) RETURN COUNT(v)"
    },
    {
        "input": "45岁子宫内膜异位",
        "cypher": "MATCH (d:Disease {name: '子宫内膜异位症'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "甲亢的药物治疗预后怎样",
        "cypher": "MATCH (v1:Disease {name: '甲亢'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name AS 药物名称"
    },
    {
        "input": "淋巴炎有哪些方法治",
        "cypher": "MATCH (d:Disease {name: '淋巴炎'}) RETURN d.cure_way"
    },
    {
        "input": "小儿病毒性心肌炎出院后应如何护理，平时要注意",
        "cypher": "MATCH (d:Disease {name: '小儿病毒性心肌炎'}) RETURN d.cure_way"
    },
    {
        "input": "泛细支气管炎能活多久",
        "cypher": "MATCH (n:Disease {name: '泛细支气管炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "外痔微创费用",
        "cypher": "MATCH (n:Disease {name: '外痔'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "细菌性阴道炎和霉菌性阴道炎有什么不同之处啊?",
        "cypher": "MATCH (m:Disease {name:'细菌性阴道炎'})-[]->(x) MATCH (n:Disease {name:'霉菌性阴道炎'})-[]->(y) RETURN x,y"
    },
    {
        "input": "早泄费用标准一般是多少",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "肺癌高热不退怎么办？",
        "cypher": "MATCH (m:Disease {name:'肺癌'}) RETURN m.desc"
    },
    {
        "input": "早泄的费用大概是多少？",
        "cypher": "MATCH (n:Disease {name: '早泄'}) RETURN n.cost_money"
    },
    {
        "input": "治疗甲状腺功能减退哪个医院好",
        "cypher": "MATCH (v1:Disease {name: '甲状腺功能减退'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "卵巢囊肿需要怎么去做检查",
        "cypher": "MATCH (v1:Disease {name: '卵巢囊肿'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "瘫痪的检查项目有什么",
        "cypher": "MATCH (v1:Disease {name: '瘫痪'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "结核性腹膜炎如何用药？",
        "cypher": "MATCH (m:Disease {name:'结核性腹膜炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "下肢静脉曲张动手术会引起布加氏综合症这病吗？",
        "cypher": "MATCH (d:Disease {name: '下肢静脉曲张'}) RETURN d.cure_way"
    },
    {
        "input": "脑疝的前驱症状是什么？",
        "cypher": "MATCH (m:Disease {name:'脑疝'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "脂肪瘤致命吗",
        "cypher": "MATCH (m:Disease {name: '脂肪瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "这是不是癫痫啊？以后该怎么注意啊？",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "神经内科杂志上有介绍脑萎缩吗？",
        "cypher": "MATCH (n1:Disease {name: '脑萎缩'})-[:belongs_to]->(n2:Department {name: '神经内科'}) RETURN n1, n2"
    },
    {
        "input": "昨晚睡觉不小心用手拍到两个半月宝宝的头",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '头痛' RETURN d.name, d.desc"
    },
    {
        "input": "武侯最好的治甲状腺腺瘤医院在哪里呢？",
        "cypher": "MATCH (n1:Disease {name: '甲状腺腺瘤'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "三叉神经痛是个什么样的病该挂什么科来看病呀?",
        "cypher": "MATCH (m:Disease {name:'三叉神经痛'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "胆总管结石是什么疾病？",
        "cypher": "MATCH (m:Disease {name: '胆总管结石'}) RETURN m"
    },
    {
        "input": "黑色素瘤患者有哪些忌口？",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "6岁半的小娃娃上吐下泻怎么回事？",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '上吐下泻' RETURN m.name"
    },
    {
        "input": "卵巢囊肿、输卵管不通",
        "cypher": "MATCH (d:Disease {name:'卵巢囊肿'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "尿道炎还是前列腺炎吗？",
        "cypher": "MATCH (m:Disease {name: '尿道炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "患有肠胃炎要注意什么？",
        "cypher": "MATCH (m:Disease {name:'肠胃炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "直肠前突，排便困难，又不愿手术，有没有什么办",
        "cypher": "MATCH (d:Disease {name: '直肠前突'}) RETURN d.cure_way"
    },
    {
        "input": "妈妈右眼突然视力急剧下降",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '视力下降' RETURN d.name AS diseaseName, r.relation AS relation, s.name AS symptomName"
    },
    {
        "input": "胃癌？严重吗",
        "cypher": "MATCH (m:Disease {name: '胃癌'}) RETURN m.cause"
    },
    {
        "input": "本人看了中医开了药说是胃病怎么办？",
        "cypher": "MATCH (n:Disease {name: '胃病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "我老公最近口臭很严重怎么办？",
        "cypher": "MATCH (m:Disease {name: '口臭'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "新生儿缺氧缺血性脑病及吸入性肺炎",
        "cypher": "MATCH (m1:Disease {name: '新生儿缺氧缺血性脑病'})-[:belongs_to]->(m2:Department) RETURN m2.name"
    },
    {
        "input": "老年人尿失禁，中药有什么简单的方法可以治好？",
        "cypher": "MATCH (d:Disease {name: '尿失禁'}) RETURN d.cure_way"
    },
    {
        "input": "支原体肺炎吃药能好吗",
        "cypher": "MATCH (m:Disease {name:'支原体肺炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m.cure_lasttime,n.name"
    },
    {
        "input": "共济失调的治疗方法是什么",
        "cypher": "MATCH (d:Disease {name: '共济失调'}) RETURN d.cure_way"
    },
    {
        "input": "怎么预防孩子骨软骨瘤",
        "cypher": "MATCH (d:Disease {name: '骨软骨瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "我这是阳痿吗",
        "cypher": "MATCH (d:Disease {name: '阳痿'}) RETURN d"
    },
    {
        "input": "小儿肺炎为什么容易复发？",
        "cypher": "MATCH (m:Disease {name:'小儿肺炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "新生儿呕吐怎么处理",
        "cypher": "MATCH (d:Disease {name: '新生儿呕吐'}) RETURN d.cure_way"
    },
    {
        "input": "肺栓塞怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '肺栓塞'}) RETURN d.cure_way"
    },
    {
        "input": "高血压该注意些什么",
        "cypher": "MATCH (m:Disease {name:'高血压'}) RETURN m.prevent"
    },
    {
        "input": "低钠血症怎么治疗好",
        "cypher": "MATCH (d:Disease {name: '低钠血症'}) RETURN d.cure_way"
    },
    {
        "input": "为什么做爱的时候下面总是会有痛的感觉",
        "cypher": "MATCH (m:Disease {name: '痛经'})-[:has_symptom]->(n:Symptom {name: '下腹痛'}) RETURN m, n"
    },
    {
        "input": "输精管堵塞会不会造成生不出孩子？",
        "cypher": "MATCH (d:Disease {name: '输精管堵塞'}) RETURN d.easy_get"
    },
    {
        "input": "头摇会是什么病",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name CONTAINS '头摇' RETURN m.name"
    },
    {
        "input": "治疗滴虫性阴道炎用什么药",
        "cypher": "MATCH (v1:Disease {name: '滴虫性阴道炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "哪里治疗植物人好",
        "cypher": "MATCH (v1:Disease {name: '植物人'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肺癌晚期饮食禁忌",
        "cypher": "MATCH (v1:Disease {name: '肺癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "有关白内障的一些疑问",
        "cypher": "MATCH (m:Disease {name: '白内障'})-[:belongs_to]->(n:Department) RETURN m.name, n.name"
    },
    {
        "input": "小脑萎缩吃什么好？",
        "cypher": "MATCH (v1:Disease {name: '小脑萎缩'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾功能不全适合吃哪些食物？",
        "cypher": "MATCH (v1:Disease {name: '肾功能不全'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "脑梗死恢复期用药",
        "cypher": "MATCH (v1:Disease {name: '脑梗死'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "腹膜后肿瘤有什么表现?",
        "cypher": "MATCH (m:Disease {name:'腹膜后肿瘤'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "到底是不是手足口病？",
        "cypher": "MATCH (m:Disease {name:'手足口病'})-[]->(n) RETURN m,n"
    },
    {
        "input": "肺栓塞在饮食上应该禁口什么",
        "cypher": "MATCH (v1:Disease {name: '肺栓塞'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "早泄这个毛病好治吗",
        "cypher": "MATCH (m:Disease {name:'早泄'}) RETURN m.cure_way AS name"
    },
    {
        "input": "请问的了胃癌晚期能不能治好,最多能活多久？",
        "cypher": "MATCH (d:Disease {name: '胃癌'}) RETURN d.cure_way"
    },
    {
        "input": "心脏神经官能症选择什么样的中成药",
        "cypher": "MATCH (v1:Disease {name: '心脏神经官能症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "膀胱肿瘤良性几率大吗",
        "cypher": "MATCH (m:Disease {name:'膀胱肿瘤'}) RETURN m.cured_prob"
    },
    {
        "input": "产后甲状腺炎要吃药吗？",
        "cypher": "MATCH (n:Disease {name: '产后甲状腺炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "痔疮麻烦医生给予指导",
        "cypher": "MATCH (m:Disease {name: '痔疮'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "宫颈肥大这种病会影响怀孕吗",
        "cypher": "MATCH (d:Disease {name: '宫颈肥大'}) RETURN d.easy_get"
    },
    {
        "input": "月经不调引起的问题",
        "cypher": "MATCH (d:Disease)-[r:acompany_with]->(d2:Disease) WHERE d.name='月经不调' RETURN d2.name"
    },
    {
        "input": "慢性淋巴结炎症状主要有哪些？",
        "cypher": "MATCH (m:Disease {name: '慢性淋巴结炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肾肿瘤性质怎么判断",
        "cypher": "MATCH (m:Disease {name: '肾肿瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "患甲状腺癌的可能有多大",
        "cypher": "MATCH (n:Disease {name: '甲状腺癌'}) RETURN n.get_prob"
    },
    {
        "input": "婴幼儿腹泻问题",
        "cypher": "MATCH (d:Disease {name: '婴幼儿腹泻'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "查是否有免疫性不孕多少钱",
        "cypher": "MATCH (n:Disease {name:'免疫性不孕'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name AS name, m.money AS money"
    },
    {
        "input": "前列腺炎怎样治超好吃药",
        "cypher": "MATCH (d:Disease {name: '前列腺炎'})-[:common_drug|:recommand_drug]->(drug:Drug) RETURN drug.name"
    },
    {
        "input": "白带异常月经迟来怎么办？",
        "cypher": "MATCH (m:Disease {name:'白带异常'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "二尖瓣关闭不全,EF69%什么意思",
        "cypher": "MATCH (d:Disease {name: '二尖瓣关闭不全'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "有了子宫肌瘤严重吗",
        "cypher": "MATCH (d:Disease {name: '子宫肌瘤'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "肛门瘙痒症治疗困难吗？",
        "cypher": "MATCH (d:Disease {name: '肛门瘙痒症'}) RETURN d.cure_way"
    },
    {
        "input": "鼻咽癌的原因是什么啊北京能治么？",
        "cypher": "MATCH (m:Disease {name: '鼻咽癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "包皮过长手术大概要多少钱",
        "cypher": "MATCH (m:Disease {name:'包皮过长'})-[:belongs_to]->(n:Department) RETURN m.cost_money AS money"
    },
    {
        "input": "乙状结肠癌术后三年半复发怎么回事",
        "cypher": "MATCH (d:Disease {name: '乙状结肠癌'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "肝炎平时不可以吃什么呢?",
        "cypher": "MATCH (v1:Disease {name: '肝炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "这么年轻就早泄为什么?",
        "cypher": "MATCH (m:Disease {name:'早泄'})<-[:acompany_with]-(n:Disease) RETURN m.name,n.name"
    },
    {
        "input": "囊性纤维化是否可治？",
        "cypher": "MATCH (d:Disease {name: '囊性纤维化'}) RETURN d.cure_way"
    },
    {
        "input": "怀疑前列腺癌和直肠癌?",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "患有乳腺增生",
        "cypher": "MATCH (m:Disease {name: '乳腺增生'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "强直性脊柱炎热敷的效果好吗能缓解病情么?",
        "cypher": "MATCH (d:Disease {name: '强直性脊柱炎'}) RETURN d.cure_way"
    },
    {
        "input": "新生儿佝偻病吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '新生儿佝偻病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "骨癌的饮食注意事项",
        "cypher": "MATCH (m:Disease {name: '骨癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "肺癌治疗药物研究进展，咳嗽时胸部疼且有痰是肺",
        "cypher": "MATCH (d:Disease {name: '肺癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "舌癌手术前的病人在饮食中要注意哪些？",
        "cypher": "MATCH (m:Disease {name:'舌癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "前列腺增生都是什么病菌？",
        "cypher": "MATCH (m:Disease {name: '前列腺增生'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "孩子这几天感冒了又差点被汽车撵着怎么办？",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "肿瘤对身体有什么影响",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "前列腺结石原因是什么呢？",
        "cypher": "MATCH (m:Disease {name:'前列腺结石'}) RETURN m.cause"
    },
    {
        "input": "如何预防宫颈癌呢?",
        "cypher": "MATCH (n:Disease {name: '宫颈癌'}) RETURN n.prevent"
    },
    {
        "input": "如何治疗神经性厌食症啊？",
        "cypher": "MATCH (d:Disease {name: '神经性厌食症'}) RETURN d.cure_way"
    },
    {
        "input": "怎么做能缓解肾阴虚和脾阳虚",
        "cypher": "MATCH (v1:Disease {name: '肾阴虚'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "女性的尿路感染吃什么药比较好怎么才可以不让这",
        "cypher": "MATCH (n:Disease {name: '尿路感染'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "治疗阳痿那家医院好啊？",
        "cypher": "MATCH (n1:Disease {name: '阳痿'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "低钾血症会出现什么症状",
        "cypher": "MATCH (m:Disease {name:'低钾血症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "得了糖尿病，吃什么药物能调节血糖、控制血糖呢",
        "cypher": "MATCH (n:Disease {name: '糖尿病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "外痔要如何诊断才会好些呢",
        "cypher": "MATCH (m:Disease {name: '外痔'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "食道溃疡的治疗方法是什么呢？",
        "cypher": "MATCH (d:Disease {name: '食道溃疡'}) RETURN d.cure_way"
    },
    {
        "input": "治不孕不育药费要花多少钱？",
        "cypher": "MATCH (n:Disease {name:'不孕不育'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "我想知道卵巢囊肿引起的原因是什么",
        "cypher": "MATCH (n:Disease {name:'卵巢囊肿'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "应该怎么预防乳腺错构瘤?",
        "cypher": "MATCH (m:Disease {name:'乳腺错构瘤'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "高血压需做什么检查",
        "cypher": "MATCH (v1:Disease {name: '高血压'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "每天早上都不会晨勃是不是阳痿怎么办？",
        "cypher": "MATCH (m:Disease {name:'阳痿'})<-[:acompany_with]-(n:Disease) RETURN m.name"
    },
    {
        "input": "纵隔肿瘤怎么回事？",
        "cypher": "MATCH (m:Disease {name:'纵隔肿瘤'}) RETURN m.name, m.desc"
    },
    {
        "input": "恶性肿瘤会传染给家人吗？",
        "cypher": "MATCH (m:Disease {name:'恶性肿瘤'})-[:acompany_with]->(n:Disease) RETURN n.get_way"
    },
    {
        "input": "沙虫血混着什么吃可以救直肠癌",
        "cypher": "MATCH (m:Disease {name: '直肠癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "是否是常见性手足口病？",
        "cypher": "MATCH (m:Disease {name:'手足口病'}) RETURN m.get_prob"
    },
    {
        "input": "智力低下隔代遗传吗",
        "cypher": "MATCH (m:Disease {name: '智力低下'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "子宫内膜异位症用什么药？",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜异位症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肾炎吃激素何时脸才能瘦下来",
        "cypher": "MATCH (d:Disease {name: '肾炎'}) RETURN d.easy_get"
    },
    {
        "input": "宝宝咳嗽半个月偶尔咳嗽几声怎么办？",
        "cypher": "MATCH (m:Disease {name:'咳嗽'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "新生儿肺炎预防?",
        "cypher": "MATCH (n:Disease {name: '新生儿肺炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "尿道炎吃什么药效果比较好",
        "cypher": "MATCH (v1:Disease {name: '尿道炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "确诊胰腺囊肿后不能吃什么？",
        "cypher": "MATCH (m:Disease {name:'胰腺囊肿'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "容易腹泻是什么病",
        "cypher": "MATCH (m:Disease {name: '腹泻'})<-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "3个月的婴儿患先天性脑积水可以做手术吗？",
        "cypher": "MATCH (d:Disease {name: '先天性脑积水'}) RETURN d.cure_way"
    },
    {
        "input": "治疗幽门梗阻方法有哪些？",
        "cypher": "MATCH (d:Disease {name: '幽门梗阻'}) RETURN d.cure_way"
    },
    {
        "input": "咋样诊断结核性的腹膜炎？",
        "cypher": "MATCH (m:Disease {name:'结核性腹膜炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "食管癌早期症状具体有哪些?",
        "cypher": "MATCH (m:Disease {name: '食管癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脊髓损伤有哪些后果？",
        "cypher": "MATCH (n:Disease {name: '脊髓损伤'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "请问我们到哪里治疗肺纤维化效果疗法好？",
        "cypher": "MATCH (n:Disease {name: '肺纤维化'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "生完孩子之后月经来了一个月该如何应对",
        "cypher": "MATCH (v:Disease {name: '月经不调'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "皮肤纤维瘤是什么病呢？",
        "cypher": "MATCH (m:Disease {name:'皮肤纤维瘤'}) RETURN m.name,m.desc"
    },
    {
        "input": "盆腔炎几乎吃什么药呢",
        "cypher": "MATCH (n:Disease {name: '盆腔炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肾结石肾阳虚",
        "cypher": "MATCH (d:Disease {name: '肾结石'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "得了急性化脓性乳腺炎怎么办？",
        "cypher": "MATCH (d:Disease {name: '急性化脓性乳腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "老烂腿是不是自然现象？",
        "cypher": "MATCH (m:Disease {name:'老烂腿'}) RETURN m.cause"
    },
    {
        "input": "什么可以增加抵抗力？",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "溶血性贫血能吃什么补血",
        "cypher": "MATCH (v1:Disease {name: '溶血性贫血'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "宫颈糜烂用药后脏东西流出是怎么回事",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "急性尿道炎怎么治？",
        "cypher": "MATCH (d:Disease {name: '急性尿道炎'}) RETURN d.cure_way"
    },
    {
        "input": "总是控无力尿这可怎么办",
        "cypher": "MATCH (m:Disease {name: '尿失禁'})-[:has_symptom]->(n:Symptom {name: '尿失禁'}) RETURN m, n"
    },
    {
        "input": "哪里治中风很好",
        "cypher": "MATCH (v1:Disease {name: '中风'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "6月27号早晨我起床就感觉头有点晕，过了1小",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '头晕' RETURN d.name"
    },
    {
        "input": "肉瘤会有囊性的表现吗",
        "cypher": "MATCH (m:Disease {name:'肉瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "心肌炎是什么样的病",
        "cypher": "MATCH (n:Disease {name:'心肌炎'}) RETURN n"
    },
    {
        "input": "偏瘫怎么样预防",
        "cypher": "MATCH (m:Disease {name: '偏瘫'}) RETURN m.prevent"
    },
    {
        "input": "患宫颈癌的疾病有哪些症状呢？",
        "cypher": "MATCH (n:Disease {name: '宫颈癌'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "直肠息肉真的很可怕吗？",
        "cypher": "MATCH (m:Disease {name: '直肠息肉'}) RETURN m.cause"
    },
    {
        "input": "什么是口腔干燥综合征？",
        "cypher": "MATCH (m:Disease {name: '口腔干燥综合征'}) RETURN m.desc"
    },
    {
        "input": "鼻咽癌肿瘤患者放疗期间饮食需要注意什么?",
        "cypher": "MATCH (v1:Disease {name: '鼻咽癌'})-[:do_eat]->(v2:Food) RETURN v2"
    },
    {
        "input": "新生儿生理性黄疸持续多久？",
        "cypher": "MATCH (m:Disease {name: '新生儿生理性黄疸'}) RETURN m.cure_lasttime"
    },
    {
        "input": "子宫内膜息肉手术能好吗？有危险吗？需要多",
        "cypher": "MATCH (d:Disease {name: '子宫内膜息肉'}) RETURN d.cure_way"
    },
    {
        "input": "骨纤维肉瘤怎么治疗呢？",
        "cypher": "MATCH (d:Disease {name: '骨纤维肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "什么病情易与混合结缔组织病混淆",
        "cypher": "MATCH (m:Disease {name:'混合结缔组织病'}) RETURN m.desc"
    },
    {
        "input": "卵巢癌都会有什么表现呢",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "黑色素瘤哪里看最好？",
        "cypher": "MATCH (m:Disease {name: '黑色素瘤'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "治小儿支气管炎什么药好",
        "cypher": "MATCH (m:Disease {name:'小儿支气管炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "月经期间经常出现偏头痛的原因是什么",
        "cypher": "MATCH (m:Disease {name:'偏头痛'}) RETURN m.cause"
    },
    {
        "input": "前列腺增生这种病的并发症有哪些",
        "cypher": "MATCH (n:Disease {name: '前列腺增生'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "尿道下裂手术后多久恢复",
        "cypher": "MATCH (d:Disease {name: '尿道下裂'}) RETURN d.cure_way"
    },
    {
        "input": "什么人群容易得舌癌？",
        "cypher": "MATCH (d:Disease {name: '舌癌'}) RETURN d.easy_get"
    },
    {
        "input": "下腹痛请问是什么回事呢",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'下腹痛'}) RETURN m.name"
    },
    {
        "input": "性功能障碍主要包括哪些？",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "宫颈癌是什么原因导致的呢？",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "内分泌失调引起的复发性流产怎样治疗",
        "cypher": "MATCH (d:Disease {name: '复发性流产'}) RETURN d.cure_way"
    },
    {
        "input": "肾错构瘤是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'肾错构瘤'}) RETURN m.name,m.desc"
    },
    {
        "input": "一处溃疡是什么病",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name CONTAINS '溃疡' RETURN m.name,n.name"
    },
    {
        "input": "5岁男孩做软骨瘤手术或许多少钱？",
        "cypher": "MATCH (d:Disease {name: '软骨瘤'}) RETURN d.easy_get"
    },
    {
        "input": "请问痛经的女子生男孩会得疝气吗？",
        "cypher": "MATCH (d:Disease {name: '痛经'}) RETURN d.easy_get"
    },
    {
        "input": "治阳痿大概要多少费用",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "一般前列腺炎检查需多少钱",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'})-[:need_check]->(m:Check) RETURN m.name, n.cost_money"
    },
    {
        "input": "小儿得了心肌炎心跳很快一直降不下来怎么办?",
        "cypher": "MATCH (d:Disease {name: '心肌炎'}) RETURN d.cure_way"
    },
    {
        "input": "睾丸肿瘤长在哪里",
        "cypher": "MATCH (m:Disease {name: '睾丸肿瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "小儿哮喘有什么症状啊？",
        "cypher": "MATCH (m:Disease {name:'小儿哮喘'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "子宫内膜增生是否影响怀孕",
        "cypher": "MATCH (d:Disease {name: '子宫内膜增生'}) RETURN d.easy_get"
    },
    {
        "input": "流产史可以查出来吗？",
        "cypher": "MATCH (n:Disease {name:'流产'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "患支原体感染及盆腔炎",
        "cypher": "MATCH (m:Disease {name:'支原体感染'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "孩子过敏性哮喘吃哪些药物能缓解",
        "cypher": "MATCH (v1:Disease {name: '过敏性哮喘'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肛窦炎的病因是什么？",
        "cypher": "MATCH (m:Disease {name:'肛窦炎'}) RETURN m.cause"
    },
    {
        "input": "我生完孩子为什么会性冷淡",
        "cypher": "MATCH (n:Disease {name: '性冷淡'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "直肠癌患者不能吃什么",
        "cypher": "MATCH (v1:Disease {name: '直肠癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "急性胃炎的症状及怎么缓解",
        "cypher": "MATCH (m:Disease {name:'急性胃炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小孩子铅偏高应该怎么办",
        "cypher": "MATCH (d:Disease {name: '铅中毒'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍该注意什么问题？",
        "cypher": "MATCH (m:Disease {name:'性功能障碍'}) RETURN m.prevent"
    },
    {
        "input": "睾丸鞘膜积液是什么？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '睾丸鞘膜积液' RETURN m.desc"
    },
    {
        "input": "宝宝4个月感冒流清鼻涕怎么办？",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "宫颈癌前病变怎么处理",
        "cypher": "MATCH (d:Disease {name: '宫颈癌前病变'}) RETURN d.cure_way"
    },
    {
        "input": "包皮龟头炎起因是什么",
        "cypher": "MATCH (n:Disease {name: '包皮龟头炎'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "金黄色葡萄球菌脑膜炎吃什么药治疗",
        "cypher": "MATCH (v1:Disease {name: '金黄色葡萄球菌脑膜炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "妇科病是什么病怎么治疗",
        "cypher": "MATCH (m:Disease)-[r:belongs_to]->(n:Department) WHERE n.name = '妇科' RETURN m.name, m.desc, m.prevent, m.cause, m.get_prob, m.get_way, m.c"
    },
    {
        "input": "喝酒过度引发脑水肿怎么办？",
        "cypher": "MATCH (d:Disease {name: '脑水肿'}) RETURN d.cure_way"
    },
    {
        "input": "宝宝肺炎打了六天针退烧了倒是查血肺部感染咳嗽",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name CONTAINS '咳嗽' AND d.name CONTAINS '肺炎' RETURN d,r,s"
    },
    {
        "input": "帕金森患者服药后可不可以开车",
        "cypher": "MATCH (d:Disease {name: '帕金森病'})-[:common_drug|:recommand_drug]->(dr:Drug)<-[:common_drug|:recommand_drug]-(d2:Disease) RETURN d2.name"
    },
    {
        "input": "怎么区分细菌性前列腺炎呢？",
        "cypher": "MATCH (m:Disease {name:'细菌性前列腺炎'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "月经周期为20天或18天正常吗？",
        "cypher": "MATCH (m:Disease{name:'月经不调'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "患胃溃疡导致贫血用什么药",
        "cypher": "MATCH (v1:Disease {name: '胃溃疡'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "尿路感染会传染给别人吗",
        "cypher": "MATCH (m:Disease {name:'尿路感染'}) RETURN m.get_way"
    },
    {
        "input": "白血病的早期症状是什么样的",
        "cypher": "MATCH (n:Disease {name: '白血病'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "小儿癫痫不知道病因？想确诊病因",
        "cypher": "MATCH (d:Disease {name: '小儿癫痫'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "什么叫血管瘤吗？",
        "cypher": "MATCH (m:Disease {name:'血管瘤'}) RETURN m.name,m.desc"
    },
    {
        "input": "小儿患了紫癜该怎么办",
        "cypher": "MATCH (d:Disease {name: '紫癜'}) RETURN d.cure_way"
    },
    {
        "input": "前列闭尔通栓该怎么用",
        "cypher": "MATCH (n:Disease {name: '前列腺增生'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "疝气是长期形成的吗？",
        "cypher": "MATCH (m:Disease {name:'疝气'}) RETURN m.get_way"
    },
    {
        "input": "导致输卵管积水能是哪些病因呢",
        "cypher": "MATCH (n:Disease)-[r:acompany_with]-(m:Disease) WHERE m.name='输卵管积水' RETURN r.cause"
    },
    {
        "input": "胆囊癌晚期会传染吗",
        "cypher": "MATCH (m:Disease {name:'胆囊癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "良性脑瘤切除手术的成功率有多高？",
        "cypher": "MATCH (d:Disease {name: '良性脑瘤'}) RETURN d.cure_way"
    },
    {
        "input": "动脉硬化的预防药吃哪一种好",
        "cypher": "MATCH (v1:Disease {name: '动脉硬化'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脑瘤术后吃什么药好",
        "cypher": "MATCH (v1:Disease {name: '脑瘤'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "得了鼻咽癌康复的几率多大？",
        "cypher": "MATCH (m:Disease {name: '鼻咽癌'}) RETURN m.cured_prob"
    },
    {
        "input": "阳痿有糖尿病坚持锻炼还不能同房咋办？",
        "cypher": "MATCH (n:Disease {name: '阳痿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "用中医熏蒸来治疗妇科炎症方面效果会好吗？",
        "cypher": "MATCH (d:Disease {name: '妇科炎症'}) RETURN d.cure_way"
    },
    {
        "input": "滴虫性外阴炎去哪家医院治",
        "cypher": "MATCH (v1:Disease {name: '滴虫性外阴炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "有慢性盆腔炎可以怀孕吗?",
        "cypher": "MATCH (d:Disease {name: '慢性盆腔炎'}) RETURN d.easy_get"
    },
    {
        "input": "精囊炎的检查项目有哪些",
        "cypher": "MATCH (n:Disease {name: '精囊炎'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "气胸症状能缓解吗？",
        "cypher": "MATCH (m:Disease {name:'气胸'})<-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "神经纤维肉瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '神经纤维肉瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "疝气一天出来几次",
        "cypher": "MATCH (d:Disease {name: '疝气'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "卵巢癌病人出现腹水应注意什么",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'})-[:has_symptom]->(n:Symptom {name: '腹水'}) RETURN m, n"
    },
    {
        "input": "我三叉神经痛这个病一年了一直吃药不吃药血糖就",
        "cypher": "MATCH (d:Disease {name: '三叉神经痛'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "智力低下的诊断标准大概是什么",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '智力低下' RETURN r1.name AS name"
    },
    {
        "input": "POEMS综合征是怎么引起的？",
        "cypher": "MATCH (m:Disease {name:'POEMS综合征'}) RETURN m.cause"
    },
    {
        "input": "急性播散性脑脊髓炎如何诊断和治疗",
        "cypher": "MATCH (d:Disease {name: '急性播散性脑脊髓炎'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "怎样可以不口臭",
        "cypher": "MATCH (v1:Disease {name: '口臭'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "北京哪家医院治小儿脑瘫会好一点点呢？",
        "cypher": "MATCH (n1:Disease {name: '小儿脑瘫'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "创伤性气胸手术后多长时间能完全恢复？",
        "cypher": "MATCH (d:Disease {name: '创伤性气胸'}) RETURN d.cure_way"
    },
    {
        "input": "肺结核出院后应注意些什么事项?",
        "cypher": "MATCH (n:Disease {name: '肺结核'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "感冒会引发哪些并发症",
        "cypher": "MATCH (m:Disease {name: '感冒'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "到哪治内痔是比较靠谱的？",
        "cypher": "MATCH (n:Disease {name: '内痔'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "乳头溢液是不是乳腺癌呢？",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:has_symptom]->(n:Symptom {name:'乳头溢液'}) RETURN m,n"
    },
    {
        "input": "肺气肿不可以吃什么",
        "cypher": "MATCH (v1:Disease {name: '肺气肿'})-[:no_eat]->(v2:Food) RETURN v2.name"
    }
]