[
    {
        "input": "系统性红斑狼疮是怎么回事",
        "cypher": "MATCH (m:Disease {name:'系统性红斑狼疮'}) RETURN m.name,m.desc"
    },
    {
        "input": "小儿转移性骨肿瘤应该吃一些什么药？",
        "cypher": "MATCH (n:Disease {name: '小儿转移性骨肿瘤'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "乳腺病有什么方法治？",
        "cypher": "MATCH (d:Disease {name: '乳腺病'}) RETURN d.cure_way"
    },
    {
        "input": "面瘫患者平常都不爱说话这是因为他们的大脑受到",
        "cypher": "MATCH (n:Disease {name: '面瘫'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "紫癜性肾炎饮食注意的问题有哪些？",
        "cypher": "MATCH (m:Disease {name:'紫癜性肾炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "乳腺增生会不会转癌变",
        "cypher": "MATCH (d:Disease {name: '乳腺增生'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "病毒性脑膜炎是什么病症",
        "cypher": "MATCH (m:Disease {name:'病毒性脑膜炎'}) RETURN m"
    },
    {
        "input": "胃窦炎应该怎么预防保健",
        "cypher": "MATCH (v1:Disease {name: '胃窦炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "苯丙酮尿症筛查的方法有哪些",
        "cypher": "MATCH (v1:Disease {name: '苯丙酮尿症'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "肛门瘙痒症吃哪些药",
        "cypher": "MATCH (v1:Disease {name: '肛门瘙痒症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "放射性肠炎的有效治疗",
        "cypher": "MATCH (d:Disease {name: '放射性肠炎'}) RETURN d.cure_way"
    },
    {
        "input": "中风引起的偏瘫能改善吗？",
        "cypher": "MATCH (m:Disease {name:'中风'})-[:has_symptom]->(n:Symptom {name:'偏瘫'}) RETURN n.cureWay"
    },
    {
        "input": "睾丸扭转时还睾丸跑到腹部？",
        "cypher": "MATCH (m:Disease {name:'睾丸扭转'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "脑梗塞现在有后遗症如何收拾可以好一点",
        "cypher": "MATCH (d:Disease {name: '脑梗塞'})-[:acompany_with]->(p:Disease) RETURN p"
    },
    {
        "input": "附件炎检查项目都有哪些",
        "cypher": "MATCH (v1:Disease {name: '附件炎'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "中风应该吃什么东西好？",
        "cypher": "MATCH (v1:Disease {name: '中风'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "你好，我想问下外伤性癫痫会不会有后遗症？",
        "cypher": "MATCH (n:Disease {name: '外伤性癫痫'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "经常便血可以吃什么药物治疗",
        "cypher": "MATCH (v1:Disease {name: '便血'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "乳房有肿块怎么处理",
        "cypher": "MATCH (d:Disease {name: '乳房肿块'}) RETURN d.cure_way"
    },
    {
        "input": "如何应对？支气管肺炎",
        "cypher": "MATCH (m:Disease {name:'支气管肺炎'})-[:do_eat]->(n:Food) RETURN m,n"
    },
    {
        "input": "智力低下哪医院好",
        "cypher": "MATCH (v1:Disease {name: '智力低下'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "西安哪里查过敏性紫癜效果比较好",
        "cypher": "MATCH (v1:Disease {name: '过敏性紫癜'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "看脉管炎那个医院好，不痛苦？",
        "cypher": "MATCH (n1:Disease {name: '脉管炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "闭经如何查出原因",
        "cypher": "MATCH (m:Disease {name: '闭经'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "儿童要打多少种疫苗",
        "cypher": "MATCH (v:Disease)-[e:diseaseCrowdRelation]->(v:crowd) WHERE v.crowd.name = '儿童' RETURN COUNT(DISTINCT v.disease)"
    },
    {
        "input": "结肠炎能治好吗？",
        "cypher": "MATCH (m:Disease {name:'结肠炎'}) RETURN m.cured_prob"
    },
    {
        "input": "早期乳腺癌20次放射治疗费用8万元正常吗？",
        "cypher": "MATCH (d:Disease {name: '早期乳腺癌'}) RETURN d.cure_way"
    },
    {
        "input": "我有乳腺增生怎么回事",
        "cypher": "MATCH (m:Disease {name: '乳腺增生'}) RETURN m"
    },
    {
        "input": "骨癌是什么引起的？",
        "cypher": "MATCH (m:Disease {name: '骨癌'}) RETURN m.cause"
    },
    {
        "input": "54岁风湿病",
        "cypher": "MATCH (d:Disease {name: '风湿病'}) RETURN d.easy_get"
    },
    {
        "input": "睾丸一大一小正常吗",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '睾丸一大一小' RETURN d.name"
    },
    {
        "input": "西安如何防治肺癌，肺癌晚期，小腿浮肿，吃不下",
        "cypher": "MATCH (d:Disease {name: '肺癌'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称, d.prevent AS 预防措施, d.cure_lasttime AS 治疗"
    },
    {
        "input": "尘螨过敏作脱敏治疗．孩子太小不能做吗？",
        "cypher": "MATCH (d:Disease {name: '尘螨过敏'}) RETURN d.cure_way"
    },
    {
        "input": "大夫，肠癌检查费用大约多少钱",
        "cypher": "MATCH (n:Disease {name: '肠癌'})-[:need_check]->(m:Check) RETURN m.name, n.cost_money"
    },
    {
        "input": "脑性瘫痪的定义及分型和并发症都是什么？",
        "cypher": "MATCH (m:Disease {name:'脑性瘫痪'}) RETURN m.desc"
    },
    {
        "input": "请医生帮忙看一下报告？",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "萎缩性胃炎可以自愈吗",
        "cypher": "MATCH (n:Disease {name: '萎缩性胃炎'}) RETURN n.cured_prob"
    },
    {
        "input": "性功能障碍如何治疗效果如何会好些呢",
        "cypher": "MATCH (m:Disease {name:'性功能障碍'}) RETURN m.cure_way AS name"
    },
    {
        "input": "糖尿病发病年龄是多大",
        "cypher": "MATCH (n:Disease {name: '糖尿病'}) RETURN n.get_way"
    },
    {
        "input": "宝宝手足口营养食谱有哪些？",
        "cypher": "MATCH (m:Disease {name:'手足口病'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "肝病的前期症状有哪些",
        "cypher": "MATCH (m:Disease {name: '肝病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "卵巢癌术后第四个疗程的反应是什么症状",
        "cypher": "MATCH (n:Disease {name: '卵巢癌'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "儿子经常夜惊要怎么办",
        "cypher": "MATCH (d:Disease {name: '夜惊'}) RETURN d.cure_way"
    },
    {
        "input": "痛风性关节炎能吃什么",
        "cypher": "MATCH (v1:Disease {name: '痛风性关节炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "单纯疱疹阳性能生孩子吗",
        "cypher": "MATCH (d:Disease {name: '单纯疱疹'}) RETURN d.easy_get"
    },
    {
        "input": "输卵管肿瘤对女性生育会有影响吗",
        "cypher": "MATCH (d:Disease {name: '输卵管肿瘤'}) RETURN d.easy_get"
    },
    {
        "input": "新生儿寒冷损伤综合征是什么？",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '新生儿寒冷损伤综合征' RETURN m,r1,n"
    },
    {
        "input": "遗精是什么样子的粘稠还是稀的",
        "cypher": "MATCH (n:Disease {name: '遗精'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "紫癜性肾炎患者个人怎么做日常保健",
        "cypher": "MATCH (v1:Disease {name: '紫癜性肾炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "舌癌患者吃什么东西有好处",
        "cypher": "MATCH (m:Disease {name: '舌癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "萎缩性胃炎的危害都会有哪些呢？",
        "cypher": "MATCH (m:Disease {name:'萎缩性胃炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "颅骨巨细胞瘤吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '颅骨巨细胞瘤'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "阴囊潮湿吃哪些药能治",
        "cypher": "MATCH (v1:Disease {name: '阴囊潮湿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "包皮过长不治会很严重吗",
        "cypher": "MATCH (m:Disease {name:'包皮过长'}) RETURN m.cure_lasttime"
    },
    {
        "input": "子宫内膜息肉是良性吗？",
        "cypher": "MATCH (n:Disease {name:'子宫内膜息肉'}) RETURN n.cause"
    },
    {
        "input": "怎样检查是否患上妇科炎症呢？",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name CONTAINS '妇科炎症' RETURN n.name"
    },
    {
        "input": "孕妇感染弓形虫病会有什么症状",
        "cypher": "MATCH (m:Disease {name:'弓形虫病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "早射的精子质量好吗？",
        "cypher": "MATCH (n:Disease {name:'早泄'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "继发性高血压有什么药",
        "cypher": "MATCH (v1:Disease {name: '继发性高血压'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "黑色素瘤吃什么食物?",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "处女得了霉菌性阴道炎用什么药",
        "cypher": "MATCH (d:Disease {name: '霉菌性阴道炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "口腔癌是怎么转变的?",
        "cypher": "MATCH (m:Disease {name: '口腔癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "有精囊炎需要如何进行诊断好呢",
        "cypher": "MATCH (m:Disease {name:'精囊炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "甲状腺结节是如何形成的",
        "cypher": "MATCH (n:Disease {name: '甲状腺结节'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "癫痫到底会不会传染啊？",
        "cypher": "MATCH (n:Disease {name: '癫痫'}) RETURN n.get_way"
    },
    {
        "input": "从24岁开始就月经量少怎么解决",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '月经量少' AND d.cure_lasttime IS NOT NULL RETURN d.name, d.cure_lasttime"
    },
    {
        "input": "小脑萎缩吃什么药能减轻头疼",
        "cypher": "MATCH (m:Disease {name:'小脑萎缩'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "胃食管反流病的症状是什么？",
        "cypher": "MATCH (m:Disease {name:'胃食管反流病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小儿卵巢肿瘤应该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '小儿卵巢肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "腹股沟淋巴结炎要吃什么药",
        "cypher": "MATCH (v1:Disease {name: '腹股沟淋巴结炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "想咨询是不是小脑萎缩？",
        "cypher": "MATCH (m:Disease {name:'小脑萎缩'}) RETURN m"
    },
    {
        "input": "造成宫颈肥大的原因是什么？",
        "cypher": "MATCH (n:Disease {name: '宫颈肥大'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "该怎么样预防好肿瘤的复发",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "现在还有非典传染吗",
        "cypher": "MATCH (m:Disease {name: '非典'}) RETURN m.get_prob"
    },
    {
        "input": "吃什么食物对脑膜炎患者好",
        "cypher": "MATCH (v1:Disease {name: '脑膜炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾错构瘤手术费用要多少",
        "cypher": "MATCH (n:Disease {name: '肾错构瘤'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "检查不孕不育要多少费用",
        "cypher": "MATCH (v1:Disease {name: '不孕不育'})-[:need_check]->(v2:Check) RETURN v2.name AS name, v1.cost_money AS cost_money"
    },
    {
        "input": "脑干胶质瘤该如何缓解才彻底？",
        "cypher": "MATCH (d:Disease {name: '脑干胶质瘤'}) RETURN d.cure_way"
    },
    {
        "input": "外阴炎一般都有什么些个症状？",
        "cypher": "MATCH (m:Disease {name:'外阴炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "低钙血症这样的疾病到底要怎么去治疗会好点那?",
        "cypher": "MATCH (d:Disease {name: '低钙血症'}) RETURN d.cure_way"
    },
    {
        "input": "很早之前被诊断为痛风但是后续注意饮食好多了但",
        "cypher": "MATCH (d:Disease {name: '痛风'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "烟雾病复发的几率是多少",
        "cypher": "MATCH (n:Disease {name: '烟雾病'}) RETURN n.cured_prob"
    },
    {
        "input": "九个月的宝宝感冒了咳嗽流清鼻涕吃什么药？",
        "cypher": "MATCH (n:Disease {name: '感冒'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肛瘘手术后吃什么食物好",
        "cypher": "MATCH (v1:Disease {name: '肛瘘'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "遗传性共济失调可以活多久",
        "cypher": "MATCH (n:Disease {name: '遗传性共济失调'}) RETURN n.cure_lasttime"
    },
    {
        "input": "去医院看精囊炎花多少钱",
        "cypher": "MATCH (n:Disease {name:'精囊炎'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "骶管囊肿手术有效吗？",
        "cypher": "MATCH (d:Disease {name: '骶管囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "阴茎癌手术后吃什么",
        "cypher": "MATCH (v1:Disease {name: '阴茎癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "中风后遗症要吃多少药物呢",
        "cypher": "MATCH (m:Disease {name:'中风后遗症'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n"
    },
    {
        "input": "甲状腺癌的病因是什么？",
        "cypher": "MATCH (n:Disease {name: '甲状腺癌'}) RETURN n.cause"
    },
    {
        "input": "如何鉴别结肠炎与结肠息肉",
        "cypher": "MATCH (m:Disease {name:'结肠炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "怎么样预防多动症？",
        "cypher": "MATCH (m:Disease {name:'多动症'}) RETURN m.prevent"
    },
    {
        "input": "肛裂是怎么引起的咋回事",
        "cypher": "MATCH (m:Disease {name: '肛裂'}) RETURN m.cause"
    },
    {
        "input": "北京治小儿脑瘫哪家医院好可以去根？",
        "cypher": "MATCH (m:Disease {name: '小儿脑瘫'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "胃癌这样到底怎么样的一种疾病那?",
        "cypher": "MATCH (m:Disease {name:'胃癌'}) RETURN m"
    },
    {
        "input": "苯丙酮尿症家族里会遗传吗？",
        "cypher": "MATCH (n:Disease {name: '苯丙酮尿症'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "多发性肌炎是什么病",
        "cypher": "MATCH (m:Disease {name:'多发性肌炎'}) RETURN m"
    },
    {
        "input": "胃癌的少许低分化腺癌是什么意思？",
        "cypher": "MATCH (m:Disease {name:'胃癌'}) RETURN m.desc"
    },
    {
        "input": "孕妇可以用青霉素雾化治疗咽喉炎吗？",
        "cypher": "MATCH (d:Disease {name: '咽喉炎'}) RETURN d.easy_get"
    },
    {
        "input": "请问小儿脑瘫都有什么症状",
        "cypher": "MATCH (m:Disease {name:'小儿脑瘫'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "面瘫是什么原因耳朵后面疼？",
        "cypher": "MATCH (m:Disease {name:'面瘫'}) RETURN m.cause,m.desc"
    },
    {
        "input": "咳嗽三个星期了，见意吃药好，还是打针好！什么",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '咳嗽' RETURN n.name AS diseaseName, r.name AS relationName, m.name AS symptomName"
    },
    {
        "input": "胃息肉咨询一下是什么病",
        "cypher": "MATCH (m:Disease {name:'胃息肉'}) RETURN m"
    },
    {
        "input": "北京治疗支气管炎的专科医院都有哪几家呢？",
        "cypher": "MATCH (n1:Disease {name: '支气管炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "子宫肌瘤与什么有关",
        "cypher": "MATCH (m:Disease {name:'子宫肌瘤'})-[]->(n) RETURN m,n"
    },
    {
        "input": "手汗症做完手术2个月后。手又像原先那样流了怎",
        "cypher": "MATCH (d:Disease {name: '手汗症'}) RETURN d.cure_way"
    },
    {
        "input": "亚急性甲状腺炎发病原因是什么？",
        "cypher": "MATCH (n:Disease {name: '亚急性甲状腺炎'}) RETURN n.cause"
    },
    {
        "input": "想知道红斑狼疮这个病到底会不会传染呢？",
        "cypher": "MATCH (n:Disease {name:'红斑狼疮'}) RETURN n.get_way"
    },
    {
        "input": "我的情况是阴虚还是阳虚,吃什么中药",
        "cypher": "MATCH (n:Disease {name:'阴虚'}),(m:Food) WHERE (n)-[:do_eat]->(m) RETURN m.name"
    },
    {
        "input": "遗精算不算禁欲呢",
        "cypher": "MATCH (n:Disease {name:'遗精'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "近两三天外阴瘙痒是什么问题",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '外阴瘙痒' RETURN d.name"
    },
    {
        "input": "女性是不是性冷淡是怎么判断的？",
        "cypher": "MATCH (n:Disease {name:'性冷淡'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "坐骨神经痛能自愈吗？",
        "cypher": "MATCH (n:Disease {name: '坐骨神经痛'}) RETURN n.cured_prob"
    },
    {
        "input": "国外试管婴儿哪家医院做得成功口碑又好",
        "cypher": "MATCH (v1:Disease {name: '试管婴儿'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "得了淋巴癌该吃什么？不该吃什么?",
        "cypher": "MATCH (m:Disease {name: '淋巴癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "胸腔积液是什么病",
        "cypher": "MATCH (m:Disease {name: '胸腔积液'}) RETURN m"
    },
    {
        "input": "营养性贫血",
        "cypher": "MATCH (n:Disease {name: '营养性贫血'}) RETURN n"
    },
    {
        "input": "肢端肥大症有无危险",
        "cypher": "MATCH (n:Disease {name: '肢端肥大症'})-[:acompany_with]->(m:Disease) RETURN m.name AS name, m.desc AS desc"
    },
    {
        "input": "女人膀胱炎吃什么药效果好",
        "cypher": "MATCH (d:Disease {name: '膀胱炎'}) RETURN d.easy_get"
    },
    {
        "input": "怎么治疗念珠菌阴道炎",
        "cypher": "MATCH (d:Disease {name: '念珠菌阴道炎'}) RETURN d.cure_way"
    },
    {
        "input": "西安治疗小细胞肺癌的医院在哪里，不治疗能活多",
        "cypher": "MATCH (v1:Disease {name: '小细胞肺癌'})-[:belongs_to]->(v2:Department) RETURN v2.name AS hospital, v1.cure_lasttime AS survival_time"
    },
    {
        "input": "了解下肝硬化是什么病",
        "cypher": "MATCH (m:Disease) WHERE m.name = '肝硬化' RETURN m.desc"
    },
    {
        "input": "新生儿咽下综合征并发症有哪些",
        "cypher": "MATCH (m1:Disease {name: '新生儿咽下综合征'})-[:acompany_with]->(m2:Disease) RETURN m2"
    },
    {
        "input": "小孩腺样体肥大是怎么引起的",
        "cypher": "MATCH (m:Disease {name: '腺样体肥大'}) RETURN m.cause"
    },
    {
        "input": "动脉硬化饮食要注意哪些方面",
        "cypher": "MATCH (v1:Disease {name: '动脉硬化'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "子宫内膜炎发病原因是什么呢？",
        "cypher": "MATCH (n:Disease {name: '子宫内膜炎'}) RETURN n.cause"
    },
    {
        "input": "心脏瓣膜病是啥意思",
        "cypher": "MATCH (m:Disease {name:'心脏瓣膜病'}) RETURN m"
    },
    {
        "input": "肿瘤长在动脉血管怎么办呢",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:belongs_to]->(n:Department) RETURN m.cureWay"
    },
    {
        "input": "肝癌中期患者，在饮食上应该如何更好的照顾他？",
        "cypher": "MATCH (d:Disease {name: '肝癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "胃肿瘤中晚期应该怎么治疗能好？",
        "cypher": "MATCH (d:Disease {name: '胃肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "食物中毒是急性病吗",
        "cypher": "MATCH (n:Disease {name:'食物中毒'}) RETURN n.get_way"
    },
    {
        "input": "原发性肠系膜肿瘤怎么治？",
        "cypher": "MATCH (d:Disease {name: '原发性肠系膜肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "胰腺癌的症状及危害有什么？",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "急性播散性脑脊髓炎危险期多久",
        "cypher": "MATCH (d:Disease {name: '急性播散性脑脊髓炎'})-[:acompany_with]->(r:Disease) RETURN r.cure_lasttime"
    },
    {
        "input": "前列腺炎应该注意的几个问题",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'})-[:belongs_to]->(n:Department) RETURN n.name AS 科室名称"
    },
    {
        "input": "足月小样儿可以放弃吗?",
        "cypher": "MATCH (d:Disease {name: '足月小样儿'}) RETURN d.easy_get"
    },
    {
        "input": "请问矮小症是身高偏低吗？",
        "cypher": "MATCH (m:Disease {name:'矮小症'}) RETURN m.get_prob"
    },
    {
        "input": "怎么才能让孩子不磨牙",
        "cypher": "MATCH (d:Disease {name: '磨牙'}) RETURN d.easy_get"
    },
    {
        "input": "怎么知道自己有没有患有慢性肾炎",
        "cypher": "MATCH (m:Disease {name:'慢性肾炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "包皮水肿治疗挂什么科室呢",
        "cypher": "MATCH (v1:Disease {name: '包皮水肿'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "宫颈糜烂是妇科炎症引起的吗",
        "cypher": "MATCH (n1:Disease {name: '宫颈糜烂'})-[:belongs_to]->(n2:Department {name: '妇科'}) RETURN n1.cause"
    },
    {
        "input": "疑似阿尔茨海默病服什么药好？",
        "cypher": "MATCH (v1:Disease {name: '阿尔茨海默病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肝病检查项目有什么？",
        "cypher": "MATCH (v1:Disease {name: '肝病'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "淋巴癌调理所需费用是多少钱？",
        "cypher": "MATCH (n:Disease {name: '淋巴癌'}) RETURN n.cost_money"
    },
    {
        "input": "胰腺癌晚期该吃些什么药",
        "cypher": "MATCH (d:Disease {name: '胰腺癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "腹痛不吃药有哪些方法改善？",
        "cypher": "MATCH (d:Disease {name: '腹痛'}) RETURN d.cure_way"
    },
    {
        "input": "宝宝身上起了好多小疙瘩越抓越痒怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '荨麻疹'}) RETURN d.cure_way"
    },
    {
        "input": "垂体瘤复发的几率有多大？",
        "cypher": "MATCH (m:Disease {name:'垂体瘤'})-[:acompany_with]-(n:Disease) RETURN n.get_prob"
    },
    {
        "input": "遗精次数过多好不好？",
        "cypher": "MATCH (m:Disease {name: '遗精'}) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率"
    },
    {
        "input": "得了斜视不治疗会怎么样",
        "cypher": "MATCH (m:Disease {name: '斜视'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "有过流产史需要提前保胎吗",
        "cypher": "MATCH (v:Disease {name: '流产'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "精索静脉曲张是怎么回事啊？",
        "cypher": "MATCH (m:Disease) WHERE m.name='精索静脉曲张' RETURN m.desc"
    },
    {
        "input": "肺结节请问用中医治疗好吗?",
        "cypher": "MATCH (d:Disease {name: '肺结节'}) RETURN d.cure_way"
    },
    {
        "input": "肺纤维化怎么检查怎么判断病情？",
        "cypher": "MATCH (m:Disease {name:'肺纤维化'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "甲状腺疾病会遗传吗?",
        "cypher": "MATCH (n:Disease {name: '甲状腺疾病'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "小儿软组织肉瘤咋办较好？",
        "cypher": "MATCH (d:Disease {name: '小儿软组织肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "面瘫这个病人如何饮食应该注意哪些细节可以对病",
        "cypher": "MATCH (d:Disease {name: '面瘫'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "早泄鼻炎神经衰弱瘦弱应该怎么调理呢？",
        "cypher": "MATCH (n:Disease {name:'早泄'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "股癣在大腿根部和睾丸处该吃什么药？",
        "cypher": "MATCH (m:Disease {name:'股癣'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "宫外孕是怎么引起的呢？",
        "cypher": "MATCH (m:Disease {name:'宫外孕'}) RETURN m.cause"
    },
    {
        "input": "卵巢囊肿长在什么位置？",
        "cypher": "MATCH (m:Disease {name:'卵巢囊肿'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "肠痉挛吃什么药可以有效治疗",
        "cypher": "MATCH (m:Disease {name:'肠痉挛'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "淋巴管瘤是严重的疾病吗",
        "cypher": "MATCH (m:Disease {name:'淋巴管瘤'})-[:belongs_to]->(n:Department) RETURN m.get_prob"
    },
    {
        "input": "得了巧克力囊肿好治不中国哪家医院比较好？",
        "cypher": "MATCH (n:Disease {name:'巧克力囊肿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "脑炎后遗症的相关疑问",
        "cypher": "MATCH (v1:Disease {name: '脑炎'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "肺癌用药的药量是多少，西安肺癌后能活多久",
        "cypher": "MATCH (n:Disease {name: '肺癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name AS 药物名称, m.用量 AS 药量"
    },
    {
        "input": "是良性还是恶性肿瘤？",
        "cypher": "MATCH (m:Disease {name: '良性肿瘤'}) RETURN m"
    },
    {
        "input": "视神经萎缩十几年了",
        "cypher": "MATCH (m:Disease {name:'视神经萎缩'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "怎么确诊是败血症？",
        "cypher": "MATCH (m:Disease {name: '败血症'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "心血不足有哪些症状",
        "cypher": "MATCH (m:Disease {name:'心血不足'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肠道有肿瘤怎么办",
        "cypher": "MATCH (d:Disease {name: '肠道肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "自然流产的胎儿有灵吗？",
        "cypher": "MATCH (n:Disease {name: '自然流产'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "几天连续发烧不退怎么办",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '发烧' RETURN m.name"
    },
    {
        "input": "怎样才能治好功能性消化不良？",
        "cypher": "MATCH (d:Disease {name: '功能性消化不良'}) RETURN d.cure_way"
    },
    {
        "input": "乙状结肠癌早期症状是哪些",
        "cypher": "MATCH (m:Disease {name: '乙状结肠癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "中风用药该如何呢怎么治疗才好呢？",
        "cypher": "MATCH (m:Disease {name:'中风'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "男人前列腺囊肿严重不严重？",
        "cypher": "MATCH (m:Disease {name:'前列腺囊肿'}) RETURN m.cure_lasttime"
    },
    {
        "input": "怎么知道孩子是否有散光的问题？",
        "cypher": "MATCH (m:Disease {name: '散光'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "卵巢囊肿缓解到哪里会好点呢",
        "cypher": "MATCH (m:Disease {name:'卵巢囊肿'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "怎么能筛查染色体异常",
        "cypher": "MATCH (v1:Disease {name: '染色体异常'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "斯特奇-韦伯综合征的症状是什么",
        "cypher": "MATCH (n:Disease {name: '斯特奇-韦伯综合征'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "肛周脓肿自查要注意什么",
        "cypher": "MATCH (m:Disease {name: '肛周脓肿'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "半年多前自然流产现在想怀孕怎么办",
        "cypher": "MATCH (v1:Disease {name: '自然流产'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肝炎的传播途径都有哪些",
        "cypher": "MATCH (v1:Disease {name: '肝炎'})-[:acompany_with]-(v2:Disease) RETURN v2.get_way"
    },
    {
        "input": "精囊囊肿怎么样治疗？",
        "cypher": "MATCH (m:Disease {name:'精囊囊肿'}) RETURN m.cure_way"
    },
    {
        "input": "盆腔肿瘤的症状是什么",
        "cypher": "MATCH (m:Disease {name:'盆腔肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "新生儿窒息，肺动脉高压",
        "cypher": "MATCH (d:Disease {name: '新生儿窒息'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "怎么有效的预防包皮炎好些呢",
        "cypher": "MATCH (m:Disease {name:'包皮炎'})-[:belongs_to]->(n:Department) RETURN m.prevent,n.name"
    },
    {
        "input": "食管平滑肌瘤吃什么食物好？",
        "cypher": "MATCH (v1:Disease {name: '食管平滑肌瘤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "睾丸囊肿是什么？",
        "cypher": "MATCH (m:Disease {name:'睾丸囊肿'}) RETURN m.name, m.desc"
    },
    {
        "input": "治疗胃癌中医院都有哪几家的治疗效果最好呢？",
        "cypher": "MATCH (n1:Disease {name: '胃癌'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "甲状腺手术了出现症状是甲状腺功能减退吗？",
        "cypher": "MATCH (m:Disease {name:'甲状腺功能减退'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "想知道宝宝什么时候出生？",
        "cypher": "MATCH (n:Disease {name: '早产'}) RETURN n.get_way"
    },
    {
        "input": "植物人有生理反应吗？",
        "cypher": "MATCH (m:Disease {name:'植物人'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "白带异常的图片",
        "cypher": "MATCH (n:Disease {name:'白带异常'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "子宫肌瘤怎么回事啊？",
        "cypher": "MATCH (m:Disease {name:'子宫肌瘤'}) RETURN m"
    },
    {
        "input": "是落枕？还是真的颈椎病？",
        "cypher": "MATCH (m:Disease {name:'颈椎病'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "宝宝经常晚上磨牙怎么办",
        "cypher": "MATCH (m:Disease {name:'磨牙'})<-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "睾丸肿瘤是什么原因引起的?",
        "cypher": "MATCH (m:Disease {name: '睾丸肿瘤'}) RETURN m.cause"
    },
    {
        "input": "儿童的口腔卫生防治龋齿怎么做才好",
        "cypher": "MATCH (d:Disease {name: '龋齿'}) RETURN d.easy_get"
    },
    {
        "input": "出现外阴白斑该怎么办",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'外阴白斑'}) RETURN m.cure_lasttime"
    },
    {
        "input": "肿瘤是由什么引起的",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "诊断卵巢囊肿的方法",
        "cypher": "MATCH (n:Disease {name: '卵巢囊肿'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "卵巢癌的大概费用多少合适",
        "cypher": "MATCH (n:Disease {name: '卵巢癌'}) RETURN n.cost_money"
    },
    {
        "input": "小孩呼吸困难",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '呼吸困难' RETURN d.name AS diseaseName"
    },
    {
        "input": "川崎病应该怎么确诊",
        "cypher": "MATCH (d:Disease {name: '川崎病'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "我父亲65岁.今年得了睾丸炎.请问有什么良药",
        "cypher": "MATCH (d:Disease {name: '睾丸炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "出现先兆流产是怎么回事",
        "cypher": "MATCH (m:Disease {name: '先兆流产'}) RETURN m.cause"
    },
    {
        "input": "包皮龟头炎是什么样子的呢？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '包皮龟头炎' RETURN m,n"
    },
    {
        "input": "六岁男孩发烧说是脑干损伤怎么办？",
        "cypher": "MATCH (m:Disease {name:'脑干损伤'})-[:belongs_to]->(n:Department) RETURN m.name, n.name"
    },
    {
        "input": "静脉炎的发病原因都有什么",
        "cypher": "MATCH (n:Disease {name: '静脉炎'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "前列腺大小多少是正常",
        "cypher": "MATCH (n:Disease {name:'前列腺增生'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "宝宝肛周脓肿需要多少钱",
        "cypher": "MATCH (n:Disease {name: '肛周脓肿'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "宝宝一岁三个月手足口病怎么回事？",
        "cypher": "MATCH (m:Disease {name:'手足口病'})<-[:acompany_with]->(n:Disease) RETURN m.name,n.name"
    },
    {
        "input": "妊娠合并病毒性肝炎要怎样正确治疗",
        "cypher": "MATCH (d:Disease {name: '妊娠合并病毒性肝炎'}) RETURN d.cure_way"
    },
    {
        "input": "鳞状细胞癌的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'鳞状细胞癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "癫痫持续状态是什么情况",
        "cypher": "MATCH (m:Disease {name:'癫痫持续状态'}) RETURN m.get_prob"
    },
    {
        "input": "宝宝散光该如何调治",
        "cypher": "MATCH (d:Disease {name: '散光'}) RETURN d.cure_way"
    },
    {
        "input": "子宫息肉会有什么症状表现",
        "cypher": "MATCH (v1:Disease {name: '子宫息肉'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "胃病多久检查一次",
        "cypher": "MATCH (v1:Disease {name: '胃病'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "早产儿的特性是什么",
        "cypher": "MATCH (n:Disease {name: '早产儿'}) RETURN n.cause"
    },
    {
        "input": "紫癜性肾炎能活多久？",
        "cypher": "MATCH (n:Disease {name: '紫癜性肾炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "4岁宝宝x腿比较严重说是佝偻病怎么办",
        "cypher": "MATCH (m:Disease {name:'佝偻病'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "结肠癌寿命一般为多少？",
        "cypher": "MATCH (m:Disease {name:'结肠癌'}) RETURN m.cure_lasttime"
    },
    {
        "input": "胃炎要注意哪些东西呢",
        "cypher": "MATCH (m:Disease {name:'胃炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "上哪治疗闭经的症状好",
        "cypher": "MATCH (v1:Disease {name: '闭经'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "甲状旁腺功能减退症除了补钙尔奇和D3，可有新",
        "cypher": "MATCH (v1:Disease {name: '甲状旁腺功能减退症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "麻痹性肠梗阻怎么治疗稳妥？",
        "cypher": "MATCH (d:Disease {name: '麻痹性肠梗阻'}) RETURN d.cure_way"
    }
]