[
    {
        "input": "新生儿溶血病什么时间换血好?",
        "cypher": "MATCH (d:Disease {name: '新生儿溶血病'}) RETURN d.cure_way"
    },
    {
        "input": "脂肪肝能传染给家人吗",
        "cypher": "MATCH (v1:Disease {name: '脂肪肝'})-[:acompany_with]-(v2:Disease) RETURN v2.get_way"
    },
    {
        "input": "长时间便秘对身体有什么危害",
        "cypher": "MATCH (m:Disease {name:'便秘'}) RETURN m.desc"
    },
    {
        "input": "脑萎缩和小脑萎缩有什么区别？",
        "cypher": "MATCH (m:Disease {name:'脑萎缩'})-[]->(x) MATCH (n:Disease {name:'小脑萎缩'})-[]->(y) RETURN x,y"
    },
    {
        "input": "患过葡萄胎能怀孕吗",
        "cypher": "MATCH (m:Disease {name: '葡萄胎'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "怎么预防阴道恶性肿瘤?",
        "cypher": "MATCH (n:Disease {name: '阴道恶性肿瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "我是不是得了胃癌啊有什么好的治疗方法吗？",
        "cypher": "MATCH (d:Disease {name: '胃癌'}) RETURN d.cure_way"
    },
    {
        "input": "胆囊息肉要吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '胆囊息肉'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "肾积水呕心要咋办呢",
        "cypher": "MATCH (d:Disease {name: '肾积水'}) RETURN d.cure_way"
    },
    {
        "input": "肾癌多发人群有哪些",
        "cypher": "MATCH (d:Disease {name: '肾癌'}) RETURN d.easy_get"
    },
    {
        "input": "胸腺瘤会死人吗？",
        "cypher": "MATCH (m:Disease {name:'胸腺瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "我小孩在出生就发现阴囊里只有一个睾丸怎么回事",
        "cypher": "MATCH (d:Disease {name: '隐睾'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "肝肿瘤的症状的具体表现是什么?",
        "cypher": "MATCH (m:Disease {name: '肝肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "婴儿3个多月今天去看说肺炎，大家给看看",
        "cypher": "MATCH (d:Disease {name: '肺炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "哪里治疗静脉曲张效果比较好",
        "cypher": "MATCH (v1:Disease {name: '静脉曲张'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "外阴瘙痒到底是怎么了呢",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '外阴瘙痒' RETURN m,r1,n"
    },
    {
        "input": "带被感染的阴虱会被感染艾滋病吗？",
        "cypher": "MATCH (d:Disease {name: '艾滋病'}) RETURN d.easy_get"
    },
    {
        "input": "慢性淋巴细胞性甲状腺炎的症状都有哪些",
        "cypher": "MATCH (v1:Disease {name: '慢性淋巴细胞性甲状腺炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "请问下我彻底治好癫痫药多少钱？",
        "cypher": "MATCH (n:Disease {name: '癫痫'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name AS name, m.money AS money"
    },
    {
        "input": "七个半月发现胎儿脑积水怎么办",
        "cypher": "MATCH (m:Disease {name: '脑积水'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "哪儿鼻咽癌医院好",
        "cypher": "MATCH (v1:Disease {name: '鼻咽癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "脑梗塞要做哪些常规检查",
        "cypher": "MATCH (m:Disease {name: '脑梗塞'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "共济失调是什么引起的",
        "cypher": "MATCH (m:Disease {name:'共济失调'}) RETURN m.cause"
    },
    {
        "input": "先天性心脏病手术后会复发吗?",
        "cypher": "MATCH (n:Disease {name: '先天性心脏病'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "隆突性皮肤纤维肉瘤复发可否手术医治",
        "cypher": "MATCH (d:Disease {name: '隆突性皮肤纤维肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "手足口病可以吃鸡蛋吗",
        "cypher": "MATCH (m:Disease {name:'手足口病'})-[:do_eat]->(n:Food {name:'鸡蛋'}) RETURN m,n"
    },
    {
        "input": "小儿过敏性紫癜要怎么用药？",
        "cypher": "MATCH (m:Disease {name:'小儿过敏性紫癜'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "贲门失弛缓症如何医治",
        "cypher": "MATCH (d:Disease {name: '贲门失弛缓症'}) RETURN d.cure_way"
    },
    {
        "input": "皮肤癌治疗医院哪家较好",
        "cypher": "MATCH (v1:Disease {name: '皮肤癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "六年前做过CT小医院说是血管瘤不用管",
        "cypher": "MATCH (d:Disease {name: '血管瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "蛛网膜囊肿吃什么药可以使其变小吗？",
        "cypher": "MATCH (n:Disease {name: '蛛网膜囊肿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "我是不是患上了胃癌这样的疾病那?",
        "cypher": "MATCH (m:Disease {name:'胃癌'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "癌症用药需注意什么？",
        "cypher": "MATCH (n:Disease {name: '癌症'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "包皮内侧长了一些小疙瘩",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name CONTAINS '小疙瘩' RETURN d.name"
    },
    {
        "input": "肋间神经痛是哪里痛？",
        "cypher": "MATCH (m:Disease {name:'肋间神经痛'})<-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "喉癌会传染吗?",
        "cypher": "MATCH (m:Disease {name:'喉癌'}) RETURN m.get_way"
    },
    {
        "input": "包皮龟头炎有什么临床症状",
        "cypher": "MATCH (m:Disease {name:'包皮龟头炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我和我的姐们都不知道掉阴道炎到底是怎么的疾病",
        "cypher": "MATCH (n:Disease {name:'阴道炎'}) RETURN n"
    },
    {
        "input": "小儿多动症怎样的？",
        "cypher": "MATCH (m:Disease {name:'小儿多动症'}) RETURN m.get_prob"
    },
    {
        "input": "慢性肠炎和慢性浅表性胃炎吃什么药",
        "cypher": "MATCH (v1:Disease {name: '慢性肠炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "胃癌的术后饮食",
        "cypher": "MATCH (d:Disease {name: '胃癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "对于什么是软骨瘤",
        "cypher": "MATCH (m:Disease {name: '软骨瘤'}) RETURN m"
    },
    {
        "input": "胆囊息肉在复发时会很痛吗",
        "cypher": "MATCH (m:Disease {name:'胆囊息肉'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小儿癫痫病必须吃药治疗吗",
        "cypher": "MATCH (m:Disease {name:'小儿癫痫'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "多发性硬化维持治疗应如何正确选择",
        "cypher": "MATCH (d:Disease {name: '多发性硬化'}) RETURN d.cure_way"
    },
    {
        "input": "新生儿低钙血症的注意事项",
        "cypher": "MATCH (m:Disease {name:'低钙血症'}) RETURN m.prevent"
    },
    {
        "input": "脑瘤医院排名是什么",
        "cypher": "MATCH (m:Disease {name:'脑瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "子宫内膜增生应该吃什么药",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜增生'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "尿路感染尿频尿不尽怎么办？",
        "cypher": "MATCH (m:Disease {name: '尿路感染'})-[:has_symptom]->(n:Symptom) WHERE n.name = '尿频' OR n.name = '尿不尽' RETURN m.cureWay"
    },
    {
        "input": "吃什么对肾病综合征用好",
        "cypher": "MATCH (v1:Disease {name: '肾病综合征'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "急性胰腺炎可以救治吗",
        "cypher": "MATCH (d:Disease {name: '急性胰腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "治疗黄体囊肿该吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '黄体囊肿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "颈部血管瘤切除后还会复发吗？",
        "cypher": "MATCH (n:Disease {name: '颈部血管瘤'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "1岁孩子巨细胞病毒感染怎么办",
        "cypher": "MATCH (m:Disease {name:'巨细胞病毒感染'})<-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "口臭吃点什么好",
        "cypher": "MATCH (v1:Disease {name: '口臭'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "结肠癌疾病怎么回事",
        "cypher": "MATCH (m:Disease {name: '结肠癌'}) RETURN m"
    },
    {
        "input": "乳腺癌这状况是什么原因形成的",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "如何护理脑出血后遗症",
        "cypher": "MATCH (v1:Disease {name: '脑出血'})-[:has_symptom]->(v2:Symptom)<-[:has_symptom]-(v3:Disease) RETURN v3.name"
    },
    {
        "input": "老年人特发性肺纤维化怎样护理",
        "cypher": "MATCH (d:Disease {name: '老年人特发性肺纤维化'}) RETURN d.easy_get"
    },
    {
        "input": "睾丸癌症状有哪些表现",
        "cypher": "MATCH (m:Disease {name: '睾丸癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肾囊肿高血压能有小孩吗",
        "cypher": "MATCH (d:Disease {name: '肾囊肿'}) RETURN d.easy_get"
    },
    {
        "input": "胆管癌晚期问题都有什么症状呢",
        "cypher": "MATCH (m:Disease {name: '胆管癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "冠心病什么症状",
        "cypher": "MATCH (m:Disease {name:'冠心病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脂肪瘤可以治愈吗",
        "cypher": "MATCH (m:Disease {name: '脂肪瘤'}) RETURN m.cured_prob"
    },
    {
        "input": "宫外孕的治疗大约多少钱",
        "cypher": "MATCH (n:Disease {name: '宫外孕'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "肾下垂的概念是啥子？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '肾下垂' RETURN m.desc"
    },
    {
        "input": "黑龙江哪个医院治疗甲亢最好？",
        "cypher": "MATCH (v1:Disease {name: '甲亢'})-[:belongs_to]->(v2:Department)<-[:belongs_to]-(v3:Disease {name: '甲亢'}) RETURN v2"
    },
    {
        "input": "腓总神经损伤后的康复训练",
        "cypher": "MATCH (d:Disease {name: '腓总神经损伤'}) RETURN d.cure_way"
    },
    {
        "input": "患有脑癌和遗传有关系吗",
        "cypher": "MATCH (m:Disease {name: '脑癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "食管癌是什么",
        "cypher": "MATCH (m:Disease {name: '食管癌'}) RETURN m"
    },
    {
        "input": "得了尿道炎是什么导致的？",
        "cypher": "MATCH (m:Disease {name: '尿道炎'}) RETURN m.cause"
    },
    {
        "input": "功血必须切除子宫吗",
        "cypher": "MATCH (d:Disease {name: '功血'}) RETURN d.cure_way"
    },
    {
        "input": "缩窄性心包炎的临床表现包括哪些",
        "cypher": "MATCH (m:Disease {name:'缩窄性心包炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "外阴脂肪瘤吃什么药？",
        "cypher": "MATCH (m:Disease {name:'外阴脂肪瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "26岁男性，夜尿多，尿不尽，早泄，出汗",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name IN ['夜尿多', '尿不尽', '早泄', '出汗'] RETURN d.name AS diseaseName"
    },
    {
        "input": "前列腺炎每天喝多少水好一些？",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "吃什么能缓解帕金森病？",
        "cypher": "MATCH (v1:Disease {name: '帕金森病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾癌晚期手术后吃什么对身体比较好？",
        "cypher": "MATCH (v1:Disease {name: '肾癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肠炎能不能治愈好，需要多久可以好呢？",
        "cypher": "MATCH (n:Disease {name: '肠炎'}) RETURN n.cure_lasttime, n.cured_prob"
    },
    {
        "input": "肺心病会出现的表现是什么？",
        "cypher": "MATCH (m:Disease {name:'肺心病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "癫痫患者饮食上应该怎么注意啊?",
        "cypher": "MATCH (m:Disease {name: '癫痫'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "包皮过长的危害会有哪些？",
        "cypher": "MATCH (m:Disease {name:'包皮过长'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "滴虫性阴道炎传染性强吗?",
        "cypher": "MATCH (n:Disease {name: '滴虫性阴道炎'}) RETURN n.get_way"
    },
    {
        "input": "肾肿瘤的主要症状是什么",
        "cypher": "MATCH (m:Disease {name:'肾肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "乳腺病会不会转化成乳腺癌？",
        "cypher": "MATCH (m:Disease {name: '乳腺病'})-[:acompany_with]->(n:Disease {name: '乳腺癌'}) RETURN n"
    },
    {
        "input": "哪些方法才可以检查性功能障碍呢？",
        "cypher": "MATCH (v1:Disease {name: '性功能障碍'})-[:need_check]-(v2:Check) RETURN v2.name"
    },
    {
        "input": "常见的贫血有哪些",
        "cypher": "MATCH (m:Disease)-[r:acompany_with]-(n:Disease) WHERE m.name CONTAINS '贫血' RETURN n.name"
    },
    {
        "input": "性功能障碍检查价格",
        "cypher": "MATCH (v1:Disease {name: '性功能障碍'})-[:need_check]->(v2:Check) RETURN v2.name, v2.cost_money"
    },
    {
        "input": "急性淋巴结炎检查挂什么科?",
        "cypher": "MATCH (n:Disease {name: '急性淋巴结炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "心肌炎经常感冒吃什么食物可以预防？",
        "cypher": "MATCH (v1:Disease {name: '心肌炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "值得信赖的面瘫医院？",
        "cypher": "MATCH (m:Disease {name: '面瘫'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "多囊卵巢综合征的检查项目都有哪些",
        "cypher": "MATCH (n:Disease {name: '多囊卵巢综合征'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "乳腺纤维腺瘤严重吗",
        "cypher": "MATCH (m:Disease {name:'乳腺纤维腺瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "孩子心脏比正常大一点是病吗？",
        "cypher": "MATCH (n:Disease {name:'心脏病'}) RETURN n"
    },
    {
        "input": "血压100-170是否正常",
        "cypher": "MATCH (n:Disease {name:'高血压'})-[:need_check]->(m:Check{name:'血压'}) RETURN m.name AS name, m.result AS result"
    },
    {
        "input": "积乳囊肿不做手术会不会恶变?",
        "cypher": "MATCH (n:Disease {name: '积乳囊肿'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "红斑狼疮怎么样防寒冷？",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'}) RETURN m.prevent"
    },
    {
        "input": "阴道炎会损伤处女膜吗",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "原发性硬化性胆管炎怎么治疗效果好",
        "cypher": "MATCH (d:Disease {name: '原发性硬化性胆管炎'}) RETURN d.cure_way"
    },
    {
        "input": "外痔手术花多少钱",
        "cypher": "MATCH (m:Disease {name:'外痔'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.cost_money"
    },
    {
        "input": "脑血栓需要注意什么问题",
        "cypher": "MATCH (m:Disease {name: '脑血栓'})-[:no_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "请问小儿肥胖症算不算病？",
        "cypher": "MATCH (m:Disease {name:'小儿肥胖症'}) RETURN m"
    },
    {
        "input": "肋软骨炎是病吗是不是很严重？",
        "cypher": "MATCH (m:Disease {name:'肋软骨炎'}) RETURN m.cause"
    },
    {
        "input": "肛周脓肿吃什么能治疗好",
        "cypher": "MATCH (v1:Disease {name: '肛周脓肿'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "脉管炎截肢后遗症是什么？",
        "cypher": "MATCH (m:Disease {name: '脉管炎'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "怎么样可以预防性功能障碍呢？",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'}) RETURN n.prevent"
    },
    {
        "input": "包皮龟头炎用什么药物见效快？",
        "cypher": "MATCH (n:Disease {name: '包皮龟头炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "癫痫属于哪种病",
        "cypher": "MATCH (v:Disease {name: '癫痫'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "子宫内膜癌的治疗需多少费用",
        "cypher": "MATCH (n:Disease {name: '子宫内膜癌'})-[:belongs_to]->(m:Department) RETURN m.name AS departmentName"
    },
    {
        "input": "做疝气手术要多少钱？",
        "cypher": "MATCH (n:Disease {name: '疝气'}) RETURN n.cost_money"
    },
    {
        "input": "为什么会导致急性胃炎",
        "cypher": "MATCH (m:Disease {name:'急性胃炎'}) RETURN m.cause"
    },
    {
        "input": "小儿高热有什么有效的方法？",
        "cypher": "MATCH (d:Disease {name: '小儿高热'}) RETURN d.cure_way"
    },
    {
        "input": "脑癌晚期死前7天症状是什么？",
        "cypher": "MATCH (m:Disease {name: '脑癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "陕西哪家医院治疗风湿病最好？",
        "cypher": "MATCH (v1:Disease {name: '风湿病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "怎样防止面瘫？",
        "cypher": "MATCH (m:Disease {name:'面瘫'}) RETURN m.prevent"
    },
    {
        "input": "继发性高血压是什么原因引起",
        "cypher": "MATCH (m:Disease {name:'继发性高血压'}) RETURN m.cause"
    },
    {
        "input": "创伤性骨髓炎怎么样治疗",
        "cypher": "MATCH (d:Disease {name: '创伤性骨髓炎'}) RETURN d.cure_way"
    },
    {
        "input": "非霍奇金淋巴瘤要做什么检查",
        "cypher": "MATCH (m:Disease {name: '非霍奇金淋巴瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "神经纤维瘤要不要做手术？",
        "cypher": "MATCH (d:Disease {name: '神经纤维瘤'}) RETURN d.cure_way"
    },
    {
        "input": "结肠癌患者的饮食注意哪些",
        "cypher": "MATCH (m:Disease {name: '结肠癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "如何预防脑梗塞再次发生?",
        "cypher": "MATCH (m:Disease {name:'脑梗塞'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "包皮龟头炎是一种什么疾病呢？",
        "cypher": "MATCH (m:Disease {name:'包皮龟头炎'}) RETURN m"
    },
    {
        "input": "急性淋巴结怎么治疗",
        "cypher": "MATCH (d:Disease {name: '急性淋巴结炎'}) RETURN d.cure_way"
    },
    {
        "input": "精囊囊肿应该注意些什么？",
        "cypher": "MATCH (n:Disease)-[r1:do_eat]->(m:Food) WHERE n.name='精囊囊肿' RETURN m.name"
    },
    {
        "input": "脑出血常见的症状都有什么",
        "cypher": "MATCH (m:Disease {name: '脑出血'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小孩子会得肝癌吗？",
        "cypher": "MATCH (d:Disease {name: '肝癌'}) RETURN d.easy_get"
    },
    {
        "input": "大便失禁怎么办？",
        "cypher": "MATCH (d:Disease {name: '大便失禁'}) RETURN d.cure_way"
    },
    {
        "input": "我的孩子三岁了可能会得了手足口病怎样治疗？",
        "cypher": "MATCH (d:Disease {name: '手足口病'}) RETURN d.cure_way"
    },
    {
        "input": "妇科病不能吃什么食物呢",
        "cypher": "MATCH (v1:Disease {name: '妇科病'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "输尿管结石饮食注意哪些？",
        "cypher": "MATCH (m:Disease {name:'输尿管结石'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "分娩后宫颈外翻怎么办",
        "cypher": "MATCH (d:Disease {name: '宫颈外翻'}) RETURN d.cure_way"
    },
    {
        "input": "1岁宝宝肠胃炎吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '肠胃炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "淤胆型肝炎不知道怎么办是否能康复？",
        "cypher": "MATCH (d:Disease {name: '淤胆型肝炎'}) RETURN d.cure_way"
    },
    {
        "input": "晚上睡觉头痛怎么办啊",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '头痛' RETURN m.name"
    },
    {
        "input": "附睾炎这种疾病有什么危害呢",
        "cypher": "MATCH (m:Disease {name:'附睾炎'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "小孩一号左右咳嗽吃了九天药还没好怎么回事？",
        "cypher": "MATCH (d:Disease {name: '咳嗽'}) RETURN d.cure_way"
    },
    {
        "input": "妇科病是怎么形成的？",
        "cypher": "MATCH (n:Disease {name: '妇科病'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "癌症是怎么样产生的。癌症是怎么样产生的。",
        "cypher": "MATCH (m:Disease {name: '癌症'}) RETURN m.cause"
    },
    {
        "input": "喉癌的晚期症状有哪些呢？",
        "cypher": "MATCH (m:Disease {name:'喉癌'})-[:acompany_with]->(n:Disease)-[:has_symptom]->(t:Symptom) RETURN t"
    },
    {
        "input": "看妇科病哪里较好呢?",
        "cypher": "MATCH (v1:Disease {name: '妇科病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "卵泡囊肿可以如何治疗",
        "cypher": "MATCH (d:Disease {name: '卵泡囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "中国哪里治支气管炎效果好",
        "cypher": "MATCH (v1:Disease {name: '支气管炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "痉挛性脑瘫做训练能康复吗",
        "cypher": "MATCH (d:Disease {name: '痉挛性脑瘫'}) RETURN d.cure_way"
    },
    {
        "input": "同房时总是不勃起是阳痿吗应该吃什么药好啊",
        "cypher": "MATCH (m:Disease {name:'阳痿'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m,n"
    },
    {
        "input": "卵巢癌术后不能吃什么",
        "cypher": "MATCH (v1:Disease {name: '卵巢癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "直肠癌的疾病分期是什么",
        "cypher": "MATCH (m:Disease {name: '直肠癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "脱发挺严重的遗精早泄吃什么药?",
        "cypher": "MATCH (n:Disease {name: '脱发'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "胆管癌如何进行食疗？",
        "cypher": "MATCH (m:Disease {name: '胆管癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "体检胆囊息肉要注意什么？",
        "cypher": "MATCH (m:Disease {name:'胆囊息肉'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "原发性肝癌晚期应该吃什么药",
        "cypher": "MATCH (m:Disease {name:'原发性肝癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "肝硬化需要注意哪几点呢？",
        "cypher": "MATCH (n:Disease {name: '肝硬化'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "结肠癌治疗费用是多少",
        "cypher": "MATCH (m:Disease {name:'结肠癌'}) RETURN m.cost_money"
    },
    {
        "input": "我1年前查出胃炎，想咨询哪家医院好",
        "cypher": "MATCH (d:Disease {name: '胃炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "外阴软纤维瘤症状请问是什么？",
        "cypher": "MATCH (m:Disease {name:'外阴软纤维瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "慢性肠炎会有哪些症状？",
        "cypher": "MATCH (m:Disease {name:'慢性肠炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "宝宝便秘的表现有什么",
        "cypher": "MATCH (v1:Disease {name: '便秘'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "甲亢药物能彻底治愈吗？",
        "cypher": "MATCH (n:Disease {name:'甲亢'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肾萎缩是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'肾萎缩'}) RETURN m.name, m.desc"
    },
    {
        "input": "肝炎中医拿脉拿的出吗",
        "cypher": "MATCH (n:Disease {name: '肝炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "不想打针吃药怎么预防胃癌呢",
        "cypher": "MATCH (m:Disease {name:'胃癌'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "宝宝黄疸严重吗",
        "cypher": "MATCH (m:Disease {name: '黄疸'}) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率"
    },
    {
        "input": "患有性功能障碍饮食需注意什么",
        "cypher": "MATCH (v1:Disease {name: '性功能障碍'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "癫痫吃药为啥总想睡觉？",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "家里有癌症病史遗传的几率大吗",
        "cypher": "MATCH (n:Disease {name: '癌症'})-[:acompany_with]->(m:Disease) RETURN m.get_prob"
    },
    {
        "input": "查乳腺癌哪个医院比较好",
        "cypher": "MATCH (v1:Disease {name: '乳腺癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "精索静脉曲张的主要症状是什么",
        "cypher": "MATCH (m:Disease {name:'精索静脉曲张'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "激光治疗鲜红斑痣会留疤痕吗",
        "cypher": "MATCH (d:Disease {name: '鲜红斑痣'}) RETURN d.cure_way"
    },
    {
        "input": "小孩子白天在入睡前如果拍拍他会有颤抖现象？",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '颤抖' RETURN n.name"
    },
    {
        "input": "腹股沟斜疝饮食禁忌有哪些？",
        "cypher": "MATCH (m:Disease {name:'腹股沟斜疝'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "请问肛门息肉是否需要手术",
        "cypher": "MATCH (d:Disease {name: '肛门息肉'}) RETURN d.cure_way"
    },
    {
        "input": "睾丸扭转的注意事项有哪些？",
        "cypher": "MATCH (m:Disease {name:'睾丸扭转'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "我是性冷淡吗？",
        "cypher": "MATCH (n:Disease {name:'性冷淡'}) RETURN n"
    },
    {
        "input": "肛周脓肿术后都不能吃什么？",
        "cypher": "MATCH (v1:Disease {name: '肛周脓肿'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "做肺大泡手术哪个医院好点，第三人民医院呢",
        "cypher": "MATCH (n:Disease {name: '肺大泡'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肝癌的传播途径",
        "cypher": "MATCH (v1:Disease {name: '肝癌'})-[]->(v2) RETURN v2.get_way"
    },
    {
        "input": "骨肉瘤复发怎么办",
        "cypher": "MATCH (m:Disease {name: '骨肉瘤'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "得了外痔疮原因有哪些呢",
        "cypher": "MATCH (m:Disease {name:'痔疮'}) RETURN m.cause"
    },
    {
        "input": "有性欲但勃起不坚要检查什么",
        "cypher": "MATCH (m:Disease {name: '勃起功能障碍'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "龟头炎涂抹什么药呢",
        "cypher": "MATCH (n:Disease {name: '龟头炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "，女孩子的乳头内陷是怎么回事，用手向外轻",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '乳头内陷' RETURN d.name, d.desc"
    },
    {
        "input": "请问乳房肿块是什么",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '乳房肿块' RETURN m,r1,n"
    },
    {
        "input": "治疗包皮龟头炎哪个医院好？",
        "cypher": "MATCH (n1:Disease {name: '包皮龟头炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "肥厚型心肌病是什么",
        "cypher": "MATCH (m:Disease {name:'肥厚型心肌病'}) RETURN m"
    },
    {
        "input": "精索静脉曲张的特点是什么？",
        "cypher": "MATCH (n:Disease {name: '精索静脉曲张'}) RETURN n"
    },
    {
        "input": "面瘫属于内科的哪种病",
        "cypher": "MATCH (n:Disease {name: '面瘫'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "前列腺癌去哪治疗恢复的好治疗",
        "cypher": "MATCH (v1:Disease {name: '前列腺癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "孕妇看电影会影响胎儿听力吗",
        "cypher": "MATCH (d:Disease {name: '听力障碍'}) RETURN d.easy_get"
    },
    {
        "input": "月经量少对以后怀上有影响吗？",
        "cypher": "MATCH (m:Disease {name:'月经量少'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "性功能障碍是常见的吗？",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'}) RETURN n.get_prob"
    },
    {
        "input": "宝宝腹痛怎么处理",
        "cypher": "MATCH (m:Disease {name:'腹痛'})<-[:belongs_to]->(n:Department) RETURN m.cureWay"
    },
    {
        "input": "大便有些疼去医院检查为内痔没有这个容易治吗？",
        "cypher": "MATCH (d:Disease {name: '内痔'}) RETURN d.cure_way"
    },
    {
        "input": "4岁半的孩子前两天咽部有炎症应当怎么办",
        "cypher": "MATCH (d:Disease {name: '咽炎'}) RETURN d.cure_way"
    },
    {
        "input": "我想了解一下治疗便秘多少钱呢？",
        "cypher": "MATCH (n:Disease {name:'便秘'}) RETURN n.cost_money"
    },
    {
        "input": "我一个月前在医院被诊断是亚急性甲状腺炎；经过",
        "cypher": "MATCH (d:Disease {name: '亚急性甲状腺炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "什么是癫痫部分性发作？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '癫痫' RETURN m.cause"
    },
    {
        "input": "女性癫痫会给女性带来哪些伤害？",
        "cypher": "MATCH (m:Disease {name:'女性癫痫'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "是不是患上了血吸虫病就没有根治的办法啊？",
        "cypher": "MATCH (d:Disease {name: '血吸虫病'}) RETURN d.cure_way"
    },
    {
        "input": "疝气多久会形成肠梗阻",
        "cypher": "MATCH (v1:Disease {name: '疝气'})-[:acompany_with]->(v2:Disease {name: '肠梗阻'}) RETURN v2.cure_lasttime"
    },
    {
        "input": "能吃药治疗睾丸肿瘤吗",
        "cypher": "MATCH (m:Disease {name: '睾丸肿瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "腹外疝发病原因中最重要的是？",
        "cypher": "MATCH (n:Disease {name: '腹外疝'}) RETURN n.cause"
    },
    {
        "input": "得了子宫脱垂是不是危害很大一些呢",
        "cypher": "MATCH (m:Disease {name:'子宫脱垂'}) RETURN m.desc"
    },
    {
        "input": "子宫肌瘤14x14会很严重吗",
        "cypher": "MATCH (n:Disease {name: '子宫肌瘤'})-[:acompany_with]-(m:Disease) RETURN m.name AS name, m.desc AS desc"
    },
    {
        "input": "非细菌性前列腺炎怎么才能治疗？",
        "cypher": "MATCH (d:Disease {name: '非细菌性前列腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "便血是痔疮还是直肠癌呢",
        "cypher": "MATCH (m:Disease {name:'痔疮'})-[:has_symptom]->(n:Symptom {name:'便血'}) RETURN m.name AS 疾病名称, n.name AS 症状名称"
    },
    {
        "input": "治疗肝硬化期间容易遇到哪些问题",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "尿路感染要注意什么",
        "cypher": "MATCH (m:Disease {name: '尿路感染'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "孩子泌尿感染需要做尿培育吗",
        "cypher": "MATCH (m:Disease {name: '泌尿感染'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "子宫肥大大概需要费用是多少？",
        "cypher": "MATCH (n:Disease {name: '子宫肥大'}) RETURN n.cost_money"
    },
    {
        "input": "有慢性肠炎如何治疗",
        "cypher": "MATCH (d:Disease {name: '慢性肠炎'}) RETURN d.cure_way"
    },
    {
        "input": "胚胎停育后应该做些什么检查才可以再要孩子",
        "cypher": "MATCH (v1:Disease {name: '胚胎停育'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "肝硬化疾病的实验室的检查办法有哪些？",
        "cypher": "MATCH (n:Disease {name: '肝硬化'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "腹股沟疝症状有什么啊？",
        "cypher": "MATCH (m:Disease {name:'腹股沟疝'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "求问宫颈炎吃什么药",
        "cypher": "MATCH (v1:Disease {name: '宫颈炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "包皮水肿有什么禁忌",
        "cypher": "MATCH (v1:Disease {name: '包皮水肿'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "包皮炎可以带套同房吗",
        "cypher": "MATCH (m:Disease {name:'包皮炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "紫癜性肾炎的后续治疗问题咨询",
        "cypher": "MATCH (d:Disease {name: '紫癜性肾炎'}) RETURN d.cure_way"
    },
    {
        "input": "风湿性关节炎该怎么才能治好",
        "cypher": "MATCH (d:Disease {name: '风湿性关节炎'}) RETURN d.cure_way"
    },
    {
        "input": "皮肤癌患者可以吃些什么东西",
        "cypher": "MATCH (v1:Disease {name: '皮肤癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "化学性眼外伤是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'化学性眼外伤'}) RETURN m"
    },
    {
        "input": "隐匿性肾小球肾炎该怎么治疗",
        "cypher": "MATCH (d:Disease {name: '隐匿性肾小球肾炎'}) RETURN d.cure_way"
    },
    {
        "input": "睾丸囊肿挂什么科？",
        "cypher": "MATCH (n:Disease {name: '睾丸囊肿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "精索静脉曲张治疗大概得花多少钱",
        "cypher": "MATCH (n:Disease {name:'精索静脉曲张'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "阴囊湿疹有什么饮食忌讳",
        "cypher": "MATCH (v1:Disease {name: '阴囊湿疹'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "半夜突然抽搐身体异常是什么情况",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '抽搐' RETURN m.name"
    },
    {
        "input": "慢性支气管炎吃什么药有效",
        "cypher": "MATCH (v1:Disease {name: '慢性支气管炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "糖尿病,小儿糖尿病,糖尿病特点",
        "cypher": "MATCH (n:Disease {name: '糖尿病'})-[]->(m) RETURN m"
    },
    {
        "input": "鼻咽癌都有什么特点？",
        "cypher": "MATCH (n:Disease {name: '鼻咽癌'}) RETURN n"
    },
    {
        "input": "想了解红斑狼疮是什么疾病",
        "cypher": "MATCH (n:Disease {name:'红斑狼疮'}) RETURN n.name,n.desc"
    }
]