[
    {
        "input": "是否所有鼾症都需要手术治疗",
        "cypher": "MATCH (d:Disease {name: '鼾症'}) RETURN d.cure_way"
    },
    {
        "input": "玻璃体混浊如何治疗需注意些什么？",
        "cypher": "MATCH (d:Disease {name: '玻璃体混浊'}) RETURN d.cure_way"
    },
    {
        "input": "腹泻时应该吃些什么食物？",
        "cypher": "MATCH (v1:Disease {name: '腹泻'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "原发性胆汁性肝硬化治愈吗？",
        "cypher": "MATCH (d:Disease {name: '原发性胆汁性肝硬化'}) RETURN d.cure_way"
    },
    {
        "input": "小儿多动症可以自愈吗？",
        "cypher": "MATCH (m:Disease {name:'小儿多动症'}) RETURN m.cured_prob"
    },
    {
        "input": "孩子鼻出血很严重怎么办？",
        "cypher": "MATCH (m:Disease {name:'鼻出血'})<-[:belongs_to]->(n:Department) RETURN m.cureWay"
    },
    {
        "input": "得了甲状腺癌，吃什么好",
        "cypher": "MATCH (m:Disease {name: '甲状腺癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "宫外孕后果有哪些？",
        "cypher": "MATCH (m:Disease {name:'宫外孕'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "小儿脑瘫会有什么并发症呀",
        "cypher": "MATCH (m:Disease {name:'小儿脑瘫'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "膀胱癌是什么原因引起的",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'}) RETURN m.cause"
    },
    {
        "input": "睾丸肿瘤早期症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '睾丸肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "龟头炎要注意什么呀？",
        "cypher": "MATCH (m:Disease {name:'龟头炎'}) RETURN m.prevent"
    },
    {
        "input": "肝硬化检测都需要检查哪些项目呀",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "肛门疼痛是肛裂吗？",
        "cypher": "MATCH (m:Disease {name:'肛裂'})-[:has_symptom]->(n:Symptom {name:'肛门疼痛'}) RETURN m,n"
    },
    {
        "input": "脑梗塞去哪家医院看好？",
        "cypher": "MATCH (m:Disease {name: '脑梗塞'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "小儿烧伤起泡怎么办？",
        "cypher": "MATCH (d:Disease {name: '小儿烧伤'}) RETURN d.cure_way"
    },
    {
        "input": "胆管癌术后应怎么防止复发",
        "cypher": "MATCH (d:Disease {name: '胆管癌'})-[:belongs_to]->(dp:Department)<-[:belongs_to]-(d2:Disease) RETURN d2.name"
    },
    {
        "input": "放射性肠炎的症状具体是什么？",
        "cypher": "MATCH (m:Disease {name:'放射性肠炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脑萎缩会遗传吗?",
        "cypher": "MATCH (n:Disease {name: '脑萎缩'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "记忆障碍用什么药可以根治呢吃一些什么水果对身",
        "cypher": "MATCH (n:Disease {name:'记忆障碍'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "我妹妹25岁，患了二尖瓣狭窄，",
        "cypher": "MATCH (d:Disease {name: '二尖瓣狭窄'}) RETURN d.easy_get"
    },
    {
        "input": "不孕不育患者吃什么食物对身体比较好呢？",
        "cypher": "MATCH (v1:Disease {name: '不孕不育'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "中风后的后遗症是什么",
        "cypher": "MATCH (m:Disease {name:'中风'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "得了静脉曲张需要注意哪些",
        "cypher": "MATCH (m:Disease {name: '静脉曲张'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "支气管扩张怎样治疗",
        "cypher": "MATCH (d:Disease {name: '支气管扩张'}) RETURN d.cure_way"
    },
    {
        "input": "炎性乳腺癌的食谱有哪些？",
        "cypher": "MATCH (n:Disease {name: '炎性乳腺癌'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "请问直肠癌是什么病",
        "cypher": "MATCH (m:Disease {name: '直肠癌'}) RETURN m.name, m.desc"
    },
    {
        "input": "四十多岁的人尿精是怎么一回事？",
        "cypher": "MATCH (d:Disease {name: '尿精'}) RETURN d.easy_get"
    },
    {
        "input": "父亲正在接受肺癌放疗这个期间有什么要求？",
        "cypher": "MATCH (d:Disease {name: '肺癌'}) RETURN d.cure_way"
    },
    {
        "input": "请问红斑狼疮危害有哪些",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'}) RETURN m.desc"
    },
    {
        "input": "乳腺囊肿和纤维瘤的症状是什么？",
        "cypher": "MATCH (m:Disease {name:'乳腺囊肿'})-[:has_symptom]->(n:Symptom) RETURN m.name,collect(n.name)"
    },
    {
        "input": "怀孕期间胆结石应该注意什么",
        "cypher": "MATCH (d:Disease {name: '胆结石'}) RETURN d.easy_get"
    },
    {
        "input": "脱髓鞘要吃什么药",
        "cypher": "MATCH (v1:Disease {name: '脱髓鞘'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "乳腺增生的症状都会有哪些呢?",
        "cypher": "MATCH (m:Disease {name: '乳腺增生'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小脑梗塞；还有糖尿病的患者如何治疗更有效？？",
        "cypher": "MATCH (d:Disease {name: '小脑梗塞'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍注意事项有什么的呢？",
        "cypher": "MATCH (n:Disease)-[r1:acompany_with]->(m:Disease) WHERE n.name = '性功能障碍' RETURN m.name"
    },
    {
        "input": "先天性血管瘤要注意什么",
        "cypher": "MATCH (m:Disease {name: '先天性血管瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "一岁宝宝打水痘预防发烧如何解决",
        "cypher": "MATCH (d:Disease {name: '水痘'}) RETURN d.easy_get"
    },
    {
        "input": "脸色发黄是发生了什么",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '脸色发黄' RETURN m.name"
    },
    {
        "input": "心包炎手术治疗有没有什么风险？",
        "cypher": "MATCH (d:Disease {name: '心包炎'}) RETURN d.cure_way"
    },
    {
        "input": "心肌缺血是大病吗？",
        "cypher": "MATCH (n:Disease {name: '心肌缺血'}) RETURN n.get_prob"
    },
    {
        "input": "肺癌是什么原因导致发病的？",
        "cypher": "MATCH (m:Disease {name: '肺癌'}) RETURN m.cause"
    },
    {
        "input": "子宫内膜息肉14mm大吗？",
        "cypher": "MATCH (n:Disease {name:'子宫内膜息肉'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "新生儿脑瘫一般都有啥症状",
        "cypher": "MATCH (m:Disease {name:'新生儿脑瘫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "得了前列腺炎饮食需要注意什么",
        "cypher": "MATCH (v1:Disease {name: '前列腺炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "请问这个血管瘤是什么？",
        "cypher": "MATCH (m:Disease {name:'血管瘤'}) RETURN m"
    },
    {
        "input": "有精索静脉曲张可以当兵了？",
        "cypher": "MATCH (d:Disease {name: '精索静脉曲张'}) RETURN d.easy_get"
    },
    {
        "input": "原发性肝癌转移怎么办？",
        "cypher": "MATCH (m:Disease {name:'原发性肝癌'}) RETURN m.desc"
    },
    {
        "input": "细菌性痢疾应该吃什么药",
        "cypher": "MATCH (v1:Disease {name: '细菌性痢疾'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "恶性黑色素瘤骨转移肺转移脑转移能治吗",
        "cypher": "MATCH (d:Disease {name: '恶性黑色素瘤'}) RETURN d.cure_way"
    },
    {
        "input": "面瘫的前兆是什么？",
        "cypher": "MATCH (m:Disease {name:'面瘫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "打狂犬疫苗苗胎儿有损伤吗",
        "cypher": "MATCH (d:Disease {name: '狂犬病'}) RETURN d.easy_get"
    },
    {
        "input": "小儿星形细胞瘤二级能吗",
        "cypher": "MATCH (d:Disease {name: '小儿星形细胞瘤'}) RETURN d.cure_way"
    },
    {
        "input": "黑色素瘤有什么典型的特征",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "放射性肠炎有什么危害？",
        "cypher": "MATCH (m:Disease {name:'放射性肠炎'})RETURN m.desc"
    },
    {
        "input": "眩晕症有什么特效药？",
        "cypher": "MATCH (v1:Disease {name: '眩晕症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "如何预防盆腔炎而且比较妥帖？",
        "cypher": "MATCH (n:Disease {name: '盆腔炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "心脏病分为几种",
        "cypher": "MATCH (v1:Disease {name: '心脏病'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "请问每次性交都有明显的疼痛感怎么办",
        "cypher": "MATCH (m:Disease {name: '性交疼痛'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "乳腺增生的专治医院有哪些？",
        "cypher": "MATCH (n:Disease {name: '乳腺增生'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "得了混合痔之后要禁忌吃什么",
        "cypher": "MATCH (v1:Disease {name: '混合痔'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "前列腺囊肿患者要注意哪些？",
        "cypher": "MATCH (m:Disease {name:'前列腺囊肿'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "鼻咽癌的起因是什么",
        "cypher": "MATCH (n:Disease {name: '鼻咽癌'}) RETURN n.cause"
    },
    {
        "input": "手淫时早泄，做爱时一定早泄吗？",
        "cypher": "MATCH (m:Disease {name: '早泄'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "糖尿病控制好后能停药吗",
        "cypher": "MATCH (v1:Disease {name: '糖尿病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "盆腔积液怎么调理比较好",
        "cypher": "MATCH (v1:Disease {name: '盆腔积液'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "CT经常做有危害吗",
        "cypher": "MATCH (v:Disease)-[e:need_check]->(v1:Check) WHERE v1.name CONTAINS 'CT' RETURN v.name,v1.name"
    },
    {
        "input": "慢性附睾炎应该怎么治疗？",
        "cypher": "MATCH (m:Disease {name:'慢性附睾炎'}) RETURN m.cure_way"
    },
    {
        "input": "是宫外孕还是月经呢？",
        "cypher": "MATCH (m:Disease {name:'宫外孕'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "食管癌术后会出现哪些并发症",
        "cypher": "MATCH (m:Disease {name: '食管癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "胆囊结石的护理诊断？",
        "cypher": "MATCH (m:Disease {name: '胆囊结石'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "宫外孕检查项目该要多少钱呢",
        "cypher": "MATCH (n:Disease {name: '宫外孕'})-[:need_check]->(m:Check) RETURN m.cost_money"
    },
    {
        "input": "苯丙酮尿症有啥表现",
        "cypher": "MATCH (m:Disease {name: '苯丙酮尿症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "怀孕2个月细菌性阴道炎能吃药吗",
        "cypher": "MATCH (n:Disease {name: '细菌性阴道炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "卵巢囊肿治疗费用一般该花多少钱呢",
        "cypher": "MATCH (n:Disease {name:'卵巢囊肿'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "小儿支气管哮喘究竟怎么进行预防？",
        "cypher": "MATCH (n:Disease {name: '小儿支气管哮喘'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "左边乳房怀疑有小叶增生应该看什么科",
        "cypher": "MATCH (v1:Disease {name: '小叶增生'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "曾经宫外孕过现在要怎么保养？",
        "cypher": "MATCH (v1:Disease {name: '宫外孕'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "原发性肝癌有传染性吗",
        "cypher": "MATCH (m:Disease {name:'原发性肝癌'}) RETURN m.get_way"
    },
    {
        "input": "25岁高血压什么原因",
        "cypher": "MATCH (n:Disease {name: '高血压'})-[:acompany_with]-(m:Disease) RETURN m.cause"
    },
    {
        "input": "求问勃起功能障碍就是阳痿吗",
        "cypher": "MATCH (m:Disease {name: '勃起功能障碍'})-[:acompany_with]-(n:Disease {name: '阳痿'}) RETURN m, n"
    },
    {
        "input": "肠梗阻四大症状？",
        "cypher": "MATCH (m:Disease {name:'肠梗阻'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "膀胱癌术后应该用什么药化疗",
        "cypher": "MATCH (d:Disease {name: '膀胱癌'})-[:common_drug|:recommand_drug]->(dr:Drug) RETURN dr.name"
    },
    {
        "input": "矮小症小儿患者有什么症状",
        "cypher": "MATCH (m:Disease {name:'矮小症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "那里医院治疗精索静脉曲张好",
        "cypher": "MATCH (v1:Disease {name: '精索静脉曲张'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "我这是不是患上了肿瘤疾病的表现？",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "乙肝病毒传染几率大吗",
        "cypher": "MATCH (m:Disease {name: '乙肝'}) RETURN m.get_prob"
    },
    {
        "input": "喝啤酒对胎儿有伤害吗",
        "cypher": "MATCH (v1:Disease)-[v2:no_eat]->(v3:Food) WHERE v3.name = '啤酒' RETURN v1.name"
    },
    {
        "input": "高血压中高压高的原因有什么？",
        "cypher": "MATCH (m:Disease {name: '高血压'}) RETURN m.cause"
    },
    {
        "input": "我的老公身上有很多脂肪瘤",
        "cypher": "MATCH (m:Disease {name: '脂肪瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肺病是什么病",
        "cypher": "MATCH (n:Disease {name: '肺病'}) RETURN n"
    },
    {
        "input": "性冷淡是哪些症状？",
        "cypher": "MATCH (m:Disease {name:'性冷淡'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肝硬化晚期会有哪些样的并发症？",
        "cypher": "MATCH (m:Disease {name: '肝硬化'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "瘦人也会有脂肪肝倾向吗",
        "cypher": "MATCH (d:Disease {name: '脂肪肝'}) RETURN d.easy_get"
    },
    {
        "input": "怎么确认是否为精索静脉曲张？",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name='精索静脉曲张' RETURN m,n"
    },
    {
        "input": "想问乳腺癌会遗传吗？",
        "cypher": "MATCH (n:Disease {name: '乳腺癌'}) RETURN n.cause"
    },
    {
        "input": "得了红斑狼疮怀孕生育有没有事 ",
        "cypher": "MATCH (d:Disease {name: '红斑狼疮'}) RETURN d.easy_get"
    },
    {
        "input": "安徽哪有治疗红斑狼疮比较好的医院？",
        "cypher": "MATCH (v1:Disease {name: '红斑狼疮'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "患了血栓性静脉炎要怎样防治？",
        "cypher": "MATCH (m:Disease {name:'血栓性静脉炎'}) RETURN m.prevent"
    },
    {
        "input": "出现脑血栓前兆",
        "cypher": "MATCH (m:Disease {name: '脑血栓'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "黑色素瘤的原因是什么啊北京能治么？",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'})-[:belongs_to]->(n:Department) RETURN m.cause,n.name"
    },
    {
        "input": "胃癌诊疗需要多少钱",
        "cypher": "MATCH (n:Disease {name: '胃癌'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "子宫肌瘤为良性有恶变的可能吗",
        "cypher": "MATCH (m:Disease {name:'子宫肌瘤'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "小儿抽动症是属于什么科室",
        "cypher": "MATCH (v1:Disease {name: '小儿抽动症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "不了解前列腺囊肿是怎么引起的",
        "cypher": "MATCH (m:Disease {name:'前列腺囊肿'}) RETURN m.cause"
    },
    {
        "input": "怎么预防半乳糖血症",
        "cypher": "MATCH (m:Disease {name:'半乳糖血症'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "阴道炎是怎么引发的?",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})RETURN m.cause"
    },
    {
        "input": "关于阴茎癌的问题",
        "cypher": "MATCH (m:Disease {name: '阴茎癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "子宫内膜癌哪家医院能治",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "胰腺癌出现便秘怎么办",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'})-[:has_symptom]->(n:Symptom {name:'便秘'}) RETURN m.cureWay"
    },
    {
        "input": "3岁儿童夜间睡前和早上睡醒有阵咳嗽怎么办？",
        "cypher": "MATCH (m:Disease {name:'咳嗽'})-[:belongs_to]->(n:Department) RETURN m.cureWay"
    },
    {
        "input": "引发心脏病的原因是什么",
        "cypher": "MATCH (n:Disease {name:'心脏病'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "得了老年性癫痫怎么办？",
        "cypher": "MATCH (d:Disease {name: '老年性癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "小孩扁桃体炎哭闹如何合理饮食",
        "cypher": "MATCH (d:Disease {name: '扁桃体炎'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "患有男性不育症吃什么食物有益呢？",
        "cypher": "MATCH (v1:Disease {name: '男性不育症'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "妇科炎症吃什么增加抵抗力呢？",
        "cypher": "MATCH (v1:Disease {name: '妇科炎症'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "血精症改怎么办",
        "cypher": "MATCH (m:Disease {name: '血精症'}) RETURN m.cure_way"
    },
    {
        "input": "新生儿脐炎会复发吗",
        "cypher": "MATCH (m:Disease {name:'新生儿脐炎'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "宫颈糜烂有什么症状和危害",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "痛风有什么表现啊？",
        "cypher": "MATCH (m:Disease {name:'痛风'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "精索静脉曲张睾丸不舒服用啥药？",
        "cypher": "MATCH (n:Disease {name: '精索静脉曲张'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "宫颈癌前病变什么样子",
        "cypher": "MATCH (m:Disease {name:'宫颈癌前病变'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "胰腺炎的预防治疗怎么样",
        "cypher": "MATCH (d:Disease {name: '胰腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "肝损伤通常采用什么治疗方法效果好？",
        "cypher": "MATCH (d:Disease {name: '肝损伤'}) RETURN d.cure_way"
    },
    {
        "input": "心脏神经官能症能自愈么？",
        "cypher": "MATCH (n:Disease {name: '心脏神经官能症'}) RETURN n.cured_prob"
    },
    {
        "input": "甲状腺腺瘤有哪些症状",
        "cypher": "MATCH (m:Disease {name:'甲状腺腺瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肺气肿病人出现肺部感染如何保养？",
        "cypher": "MATCH (n:Disease {name: '肺气肿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "膀胱该看哪个科",
        "cypher": "MATCH (v1:Disease {name: '膀胱炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "应该是龟头炎但不知道是哪一类怎么办？",
        "cypher": "MATCH (m:Disease) WHERE m.name CONTAINS '龟头炎' RETURN m.desc"
    },
    {
        "input": "哪里可以做血吸虫病的检查？",
        "cypher": "MATCH (m:Disease {name:'血吸虫病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "山东哪家医院治疗阴茎硬结症的效果是最明显的呢",
        "cypher": "MATCH (n:Disease {name:'阴茎硬结症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "脊髓空洞症有什么症状",
        "cypher": "MATCH (m:Disease {name:'脊髓空洞症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "6月15日去体检，医生说我有脂肪肝，前列腺，",
        "cypher": "MATCH (n:Disease)-[r:belongs_to]->(m:Department) WHERE n.name = '脂肪肝' OR n.name = '前列腺' RETURN m.name"
    },
    {
        "input": "急性宫颈炎怎么医治？",
        "cypher": "MATCH (d:Disease {name: '急性宫颈炎'}) RETURN d.cure_way"
    },
    {
        "input": "手足口病怎么确诊，求帮助啊啊",
        "cypher": "MATCH (m:Disease {name:'手足口病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "小儿脑积水有后遗症吗？",
        "cypher": "MATCH (m:Disease {name:'小儿脑积水'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "血管瘤是什么？原因引起的",
        "cypher": "MATCH (m:Disease {name: '血管瘤'}) RETURN m.cause"
    },
    {
        "input": "癔症是什么情况的病症",
        "cypher": "MATCH (m:Disease {name:'癔症'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "小儿哮喘的中医治疗方式",
        "cypher": "MATCH (d:Disease {name: '小儿哮喘'}) RETURN d.cure_way"
    },
    {
        "input": "宫寒有什么症状表现啊？",
        "cypher": "MATCH (m:Disease {name:'宫寒'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "臂丛神经痛一般能治好吗",
        "cypher": "MATCH (d:Disease {name: '臂丛神经痛'}) RETURN d.cure_way"
    },
    {
        "input": "急性附件炎需要手术治疗吗？",
        "cypher": "MATCH (d:Disease {name: '急性附件炎'}) RETURN d.cure_way"
    },
    {
        "input": "怎样诊断得了混合痔呢",
        "cypher": "MATCH (m:Disease {name:'混合痔'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "胆总管结石怎么取出？",
        "cypher": "MATCH (d:Disease {name: '胆总管结石'}) RETURN d.cure_way"
    },
    {
        "input": "附睾炎的早期症状有什么",
        "cypher": "MATCH (v1:Disease {name: '附睾炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "是什么原因引起的糖尿病？",
        "cypher": "MATCH (m:Disease {name:'糖尿病'}) RETURN m.cause"
    },
    {
        "input": "贲门癌如何用药",
        "cypher": "MATCH (m:Disease {name: '贲门癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "甲亢会不会遗传呢",
        "cypher": "MATCH (m:Disease {name:'甲亢'}) RETURN m.desc"
    },
    {
        "input": "什么叫阴茎硬结症？",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '阴茎硬结症' RETURN m,r1,n"
    },
    {
        "input": "现在硬一下就软了，请问怎么回事啊？",
        "cypher": "MATCH (m:Disease)-[:belongs_to]->(n:Department) WHERE m.name = '阳痿' RETURN n.name"
    },
    {
        "input": "前列腺癌怎么治疗比较好",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'}) RETURN m.cure_way"
    },
    {
        "input": "人工流产手术要注意什么吗",
        "cypher": "MATCH (n:Disease {name: '人工流产'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "错构瘤属于哪种的疾病",
        "cypher": "MATCH (m:Disease {name:'错构瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "大夫我和我老婆同房是9月22左右早孕？",
        "cypher": "MATCH (n:Disease {name:'早孕'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "腹主动脉瘤修复手术适合70岁老人吗？",
        "cypher": "MATCH (d:Disease {name: '腹主动脉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "尿路感染的早期症状有哪些",
        "cypher": "MATCH (m:Disease {name: '尿路感染'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "如何预防乳腺增生",
        "cypher": "MATCH (d:Disease {name: '乳腺增生'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "青少年癫痫症状有哪些?",
        "cypher": "MATCH (m:Disease {name:'青少年癫痫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "如何检查肠梗阻结果准确",
        "cypher": "MATCH (m:Disease {name:'肠梗阻'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "为什么这个月月经只有一点点甚至没有？",
        "cypher": "MATCH (m:Disease)-[:has_symptom]->(n:Symptom {name:'月经不调'}) RETURN m.name"
    },
    {
        "input": "疝气的改善哪里会好一些呢",
        "cypher": "MATCH (m:Disease {name:'疝气'}) RETURN m.desc"
    },
    {
        "input": "医院治疗脑发育不良医院怎样",
        "cypher": "MATCH (v1:Disease {name: '脑发育不良'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "中度脂肪肝怎样治疗用药",
        "cypher": "MATCH (v1:Disease {name: '中度脂肪肝'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "哪些人更易得脑梗塞呢?",
        "cypher": "MATCH (d:Disease {name: '脑梗塞'}) RETURN d.easy_get"
    },
    {
        "input": "是不是感冒了还是得H7N9？",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom) RETURN m.name, collect(n.name)"
    },
    {
        "input": "肿瘤dfs是什么意思",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "帕金森吃中药还是西药好调理",
        "cypher": "MATCH (d:Disease {name: '帕金森病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "胃潴留会导致哪种病",
        "cypher": "MATCH (v1:Disease {name: '胃潴留'})-[:acompany_with]->(v2:Disease) RETURN v2.name"
    },
    {
        "input": "鼻咽癌的因素或病因有哪些",
        "cypher": "MATCH (n:Disease {name: '鼻咽癌'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "毛细血管瘤能遗传吗？",
        "cypher": "MATCH (m:Disease {name:'毛细血管瘤'}) RETURN m.get_prob"
    },
    {
        "input": "孩子喝奶粉查出来贫血怎么办?",
        "cypher": "MATCH (m:Disease {name:'贫血'})<-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "再生障碍性贫血两年治疗可康复吗？",
        "cypher": "MATCH (d:Disease {name: '再生障碍性贫血'}) RETURN d.cure_way"
    },
    {
        "input": "输卵管粘连的价格大概需多少钱",
        "cypher": "MATCH (n:Disease {name:'输卵管粘连'}) RETURN n.cost_money"
    },
    {
        "input": "尿毒症吃什么药好",
        "cypher": "MATCH (v1:Disease {name: '尿毒症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "染色体异常了怎么办啊",
        "cypher": "MATCH (d:Disease {name: '染色体异常'}) RETURN d.cure_way"
    },
    {
        "input": "58岁心源性休克，出院1个月药物治疗，后期治",
        "cypher": "MATCH (d:Disease {name: '心源性休克'}) RETURN d.cure_way"
    },
    {
        "input": "朋友患骨巨细胞瘤已5年，现在下",
        "cypher": "MATCH (d:Disease {name: '骨巨细胞瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "主动脉瘤?",
        "cypher": "MATCH (m:Disease {name: '主动脉瘤'}) RETURN m"
    },
    {
        "input": "请问大夫治疗肝癌哪家医院好？",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "你好！我这段时间经常小腿酸痛，是怎么回事",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '小腿酸痛' RETURN m.name"
    },
    {
        "input": "为什么宫颈炎药用完了月经没来",
        "cypher": "MATCH (n:Disease {name: '宫颈炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "不孕不育怎么导致的？",
        "cypher": "MATCH (m:Disease {name:'不孕不育'}) RETURN m.cause"
    },
    {
        "input": "黑色素瘤疾病会恶化吗",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "癫痫病患儿丙戊酸钠缓释片行吗？",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[:common_drug|:recommand_drug]->(v2:Drug {name: '丙戊酸钠缓释片'}) RETURN v1, v2"
    },
    {
        "input": "肺癌还会发生骨转移吗？都有哪些具体的症状呀？",
        "cypher": "MATCH (m:Disease {name: '肺癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "盆腔炎是个什么病",
        "cypher": "MATCH (m:Disease {name:'盆腔炎'}) RETURN m.name, m.desc"
    },
    {
        "input": "阴道炎是怎么回事",
        "cypher": "MATCH (m:Disease {name:'阴道炎'}) RETURN m.name,m.desc"
    },
    {
        "input": "多动症症状表现有哪些？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '多动症' RETURN n.name"
    },
    {
        "input": "血液检查结果，请予提示：属哪类病，不胜为感",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE m.name = '血液检查' RETURN n.name"
    },
    {
        "input": "中度脂肪肝治疗怎么做呢",
        "cypher": "MATCH (d:Disease {name: '中度脂肪肝'}) RETURN d.cure_way"
    },
    {
        "input": "咳嗽老是没好",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name CONTAINS '咳嗽' RETURN n.name"
    },
    {
        "input": "吞咽东西困难,多次检查未确诊什么病",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '吞咽困难' RETURN n.name"
    },
    {
        "input": "下面情况是帕金森还是老年痴呆",
        "cypher": "MATCH (m:Disease {name: '帕金森病'})-[:has_symptom]->(n:Symptom) RETURN m.name, collect(n.name)"
    },
    {
        "input": "怎样预防宫颈息肉再生",
        "cypher": "MATCH (n:Disease {name: '宫颈息肉'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "患上糖尿病早期症状怎么自查",
        "cypher": "MATCH (v1:Disease {name: '糖尿病'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "心包囊肿这种疾病是不是必须要进行手术治疗啊？",
        "cypher": "MATCH (d:Disease {name: '心包囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "咳嗽快一个月了怎样解决",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '咳嗽' RETURN d.name, d.cureWay"
    },
    {
        "input": "甲状腺囊肿如何治疗才能治疗好",
        "cypher": "MATCH (d:Disease {name: '甲状腺囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "胆管癌在饮食上需要注意什么",
        "cypher": "MATCH (v1:Disease {name: '胆管癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "请问外阴肿瘤有什么方法治疗？",
        "cypher": "MATCH (d:Disease {name: '外阴肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "细菌性阴道炎我应注意什么？",
        "cypher": "MATCH (m:Disease {name:'细菌性阴道炎'})RETURN m.prevent"
    },
    {
        "input": "如何防治多囊卵巢综合征",
        "cypher": "MATCH (d:Disease {name: '多囊卵巢综合征'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "肾结石吃什么食物较好",
        "cypher": "MATCH (v1:Disease {name: '肾结石'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "得了骨髓增生异常综合征有哪些症状？",
        "cypher": "MATCH (m:Disease {name:'骨髓增生异常综合征'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "直肠息肉挂什么科室？",
        "cypher": "MATCH (v1:Disease {name: '直肠息肉'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "常见的卵巢早衰的症状有哪些？",
        "cypher": "MATCH (n:Disease {name: '卵巢早衰'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "癫痫危害究竟有好大呢",
        "cypher": "MATCH (m:Disease {name:'癫痫'}) RETURN m.desc"
    },
    {
        "input": "子宫肌瘤能吃药控制的住嘛？",
        "cypher": "MATCH (n:Disease {name: '子宫肌瘤'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "急性播散性脑脊髓炎吃什么比较好啊，有什么忌口",
        "cypher": "MATCH (v1:Disease {name: '急性播散性脑脊髓炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肝硬化属于哪个科室",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肺气肿和肺心病的区别是什么",
        "cypher": "MATCH (v1:Disease {name: '肺气肿'})-[]->(v2) MATCH (v3:Disease {name: '肺心病'})-[]->(v4) RETURN v2,v4"
    },
    {
        "input": "上哪治肠套叠有好的效果？",
        "cypher": "MATCH (n:Disease {name: '肠套叠'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "桡骨头半脱位临床表现?",
        "cypher": "MATCH (m:Disease {name: '桡骨头半脱位'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "怀疑自己是不是有肾虚？",
        "cypher": "MATCH (n:Disease {name:'肾虚'}) RETURN n"
    },
    {
        "input": "附睾畸形是怎么一回事呢？",
        "cypher": "MATCH (m:Disease)WHERE m.name='附睾畸形' RETURN m.desc"
    },
    {
        "input": "疑似骨巨细胞瘤，需要挂哪个科室？",
        "cypher": "MATCH (v1:Disease {name: '骨巨细胞瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "周围神经炎通过什么检查",
        "cypher": "MATCH (v1:Disease {name: '周围神经炎'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "肝炎的治疗费用是多少",
        "cypher": "MATCH (v1:Disease {name: '肝炎'}) RETURN v1.cost_money"
    },
    {
        "input": "上医院检查支气管炎这是怎么了？",
        "cypher": "MATCH (m:Disease {name:'支气管炎'})<-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "腰肌劳损问题是什么意思",
        "cypher": "MATCH (m:Disease {name: '腰肌劳损'}) RETURN m"
    },
    {
        "input": "如何能够有效的缓解神经衰弱",
        "cypher": "MATCH (d:Disease {name: '神经衰弱'}) RETURN d.cure_way"
    },
    {
        "input": "肾移植后吃什么水果好？",
        "cypher": "MATCH (v1:Disease {name: '肾移植'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肿瘤化疗有什么禁忌吗",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:no_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "外阴瘙痒病症，应该吃些什么药？",
        "cypher": "MATCH (m:Disease {name:'外阴瘙痒'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "白血病饮食怎么办",
        "cypher": "MATCH (v1:Disease {name: '白血病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "淋巴癌会复发吗",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "射精射尿",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name CONTAINS '射精' OR s.name CONTAINS '射尿' RETURN d.name, s.name"
    },
    {
        "input": "阴茎异常勃起的原因究竟有哪些呢?",
        "cypher": "MATCH (m:Disease {name:'阴茎异常勃起'}) RETURN m.cause"
    },
    {
        "input": "摁压孕妇肚子流产片段？",
        "cypher": "MATCH (m:Disease {name:'流产'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    }
]