[
    {
        "input": "医生重症肌无力的病理是什么？",
        "cypher": "MATCH (n1:Disease {name: '重症肌无力'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "有没有宫外孕的可能",
        "cypher": "MATCH (d:Disease {name: '宫外孕'})-[:acompany_with]->(dd:Disease) RETURN dd.name"
    },
    {
        "input": "请问：肾肿瘤产生的原因有哪些？",
        "cypher": "MATCH (m:Disease {name:'肾肿瘤'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "得了间质性肺炎怎么治疗",
        "cypher": "MATCH (d:Disease {name: '间质性肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "什么样算包皮过长",
        "cypher": "MATCH (n:Disease {name:'包皮过长'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "怎么估测肺动脉高压",
        "cypher": "MATCH (m:Disease {name:'肺动脉高压'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "求教肾功能不全是什么病",
        "cypher": "MATCH (m:Disease) WHERE m.name = '肾功能不全' RETURN m.desc"
    },
    {
        "input": "脑胶质瘤的病因是什么？？？",
        "cypher": "MATCH (n:Disease {name: '脑胶质瘤'}) RETURN n.cause"
    },
    {
        "input": "淋菌性尿道炎有哪些注意事项？",
        "cypher": "MATCH (m:Disease {name:'淋菌性尿道炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "每个婴儿都有胎毒吗",
        "cypher": "MATCH (d:Disease {name: '胎毒'}) RETURN d.easy_get"
    },
    {
        "input": "治疗纵膈肿瘤哪家医院好",
        "cypher": "MATCH (n:Disease {name: '纵膈肿瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肛肠科怎么办",
        "cypher": "MATCH (v1:Disease)-[v2:belongs_to]->(v3:Department) WHERE v3.name = '肛肠科' RETURN v1,v2,v3"
    },
    {
        "input": "急性肾炎严重吗?",
        "cypher": "MATCH (n:Disease {name: '急性肾炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "我得了盆腔炎吃什么药好的快",
        "cypher": "MATCH (d:Disease {name: '盆腔炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "低血糖有哪些症状",
        "cypher": "MATCH (m:Disease {name:'低血糖'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "老年便秘用什么药",
        "cypher": "MATCH (v1:Disease {name: '老年便秘'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "阴茎硬结症怎么治疗效果好点",
        "cypher": "MATCH (m:Disease {name: '阴茎硬结症'}) RETURN m.cure_way"
    },
    {
        "input": "求问脑梗塞后遗症怎么治疗",
        "cypher": "MATCH (m:Disease {name: '脑梗塞'})-[:acompany_with]->(n:Disease) RETURN n.cureWay"
    },
    {
        "input": "孩子患有有过敏性哮喘，到底怎么回事?",
        "cypher": "MATCH (m:Disease {name:'过敏性哮喘'}) RETURN m.get_way"
    },
    {
        "input": "一个月来三次月经该做什么检查",
        "cypher": "MATCH (d:Disease)-[r:need_check]->(c:Check) WHERE d.name CONTAINS '月经不调' RETURN c.name"
    },
    {
        "input": "低钾血症如何恢复",
        "cypher": "MATCH (d:Disease {name: '低钾血症'}) RETURN d.cure_way"
    },
    {
        "input": "红斑狼疮的药物有没有副作用",
        "cypher": "MATCH (n:Disease {name: '红斑狼疮'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "胰腺癌肿瘤一般多大",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'})-[:acompany_with]-(n:Disease) RETURN n.cure_lasttime"
    },
    {
        "input": "想咨询慢性肝炎会传染吗？",
        "cypher": "MATCH (n:Disease {name: '慢性肝炎'}) RETURN n.get_way"
    },
    {
        "input": "脐炎，能做手术吗，有什么好方法治疗，现",
        "cypher": "MATCH (d:Disease {name: '脐炎'}) RETURN d.cure_way"
    },
    {
        "input": "专治肺纤维化的医院，有肺部纤维化这个疾病",
        "cypher": "MATCH (v1:Disease {name: '肺纤维化'})-[:belongs_to]->(v2:Department) RETURN v2"
    },
    {
        "input": "想知道前列腺囊肿有哪些危害",
        "cypher": "MATCH (n:Disease {name: '前列腺囊肿'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "胸腺囊肿28MM乘18MM严重吗",
        "cypher": "MATCH (d:Disease {name: '胸腺囊肿'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "前列腺癌预后怎么样?",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'}) RETURN m.cure_lasttime"
    },
    {
        "input": "请解答前列腺脓肿问题",
        "cypher": "MATCH (m:Disease {name: '前列腺脓肿'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "得了输尿管结石大概要多少钱？",
        "cypher": "MATCH (m:Disease {name:'输尿管结石'}) RETURN m.cost_money"
    },
    {
        "input": "北京哪个做子宫息肉的医院好?",
        "cypher": "MATCH (v1:Disease {name: '子宫息肉'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "闭经的病因具体是什么",
        "cypher": "MATCH (n:Disease {name: '闭经'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "出现癫痫持续状态怎么办",
        "cypher": "MATCH (d:Disease {name: '癫痫持续状态'}) RETURN d.cure_way"
    },
    {
        "input": "咨询一下隐睾和精索静脉曲张怎么办",
        "cypher": "MATCH (m:Disease {name: '隐睾'}) RETURN m.cure_way"
    },
    {
        "input": "医治检查宫颈炎症状是什么样的？",
        "cypher": "MATCH (n:Disease {name: '宫颈炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "请问大夫我母亲有甲状腺疾病，治不好是吗？",
        "cypher": "MATCH (d:Disease {name: '甲状腺疾病'}) RETURN d.cure_way"
    },
    {
        "input": "共济失调的表现有哪些？",
        "cypher": "MATCH (m:Disease {name:'共济失调'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "是老年痴呆是脑萎缩吗？",
        "cypher": "MATCH (m:Disease {name: '老年痴呆'})-[:acompany_with]-(n:Disease {name: '脑萎缩'}) RETURN m, n"
    },
    {
        "input": "腔隙性脑梗死治疗方法？",
        "cypher": "MATCH (d:Disease {name: '腔隙性脑梗死'}) RETURN d.cure_way"
    },
    {
        "input": "幼儿疝气应注意些什么?",
        "cypher": "MATCH (m:Disease {name:'疝气'}) RETURN m.prevent"
    },
    {
        "input": "月经第17天卵泡还在卵巢里属于正常吗？",
        "cypher": "MATCH (m:Disease {name: '月经不调'})-[:belongs_to]->(n:Department {name: '妇科'}) RETURN m.cure_lasttime"
    },
    {
        "input": "痛经有什么类型",
        "cypher": "MATCH (v1:Disease {name: '痛经'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "大咯血能否进行药物治疗",
        "cypher": "MATCH (n:Disease {name: '大咯血'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "附件炎能否要孩子",
        "cypher": "MATCH (d:Disease {name: '附件炎'}) RETURN d.easy_get"
    },
    {
        "input": "有时外阴瘙痒",
        "cypher": "MATCH (m:Disease {name: '外阴瘙痒'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脑瘤治好的几率多大",
        "cypher": "MATCH (m:Disease {name: '脑瘤'}) RETURN m.cured_prob"
    },
    {
        "input": "肺气肿用噻托溴铵粉雾剂用多长时间",
        "cypher": "MATCH (v1:Disease {name: '肺气肿'})-[:common_drug|:recommand_drug]->(v2:Drug {name: '噻托溴铵粉雾剂'}) RETURN v2.cure_last"
    },
    {
        "input": "产后甲状腺炎怎么调养 ",
        "cypher": "MATCH (m:Disease {name:'产后甲状腺炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "宫颈炎的症状有哪些?",
        "cypher": "MATCH (m:Disease {name:'宫颈炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "功血可以吃什么食物调节？",
        "cypher": "MATCH (v1:Disease {name: '功血'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "如何确诊内分泌失调呢",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name = '内分泌失调' RETURN n.name"
    },
    {
        "input": "女性癫痫都有哪些影响",
        "cypher": "MATCH (d:Disease {name: '女性癫痫'}) RETURN d.easy_get"
    },
    {
        "input": "肛肠病有什么症状",
        "cypher": "MATCH (m:Disease {name: '肛肠病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "患了鼻咽癌后咋有效减轻症状",
        "cypher": "MATCH (d:Disease {name: '鼻咽癌'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "癌症不宜吃什么食物",
        "cypher": "MATCH (v1:Disease {name: '癌症'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾阳虚，还是肾阳虚，吃啥药",
        "cypher": "MATCH (d:Disease {name: '肾阳虚'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "是肠痉挛吗？",
        "cypher": "MATCH (m:Disease {name:'肠痉挛'}) RETURN m"
    },
    {
        "input": "纵隔副神经节起源的肿瘤需要注意些什么",
        "cypher": "MATCH (m:Disease {name:'纵隔副神经节起源的肿瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "13岁遗精后还能长多高",
        "cypher": "MATCH (n:Disease {name:'遗精'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "更年期综合征应该怎样自我调理",
        "cypher": "MATCH (d:Disease {name: '更年期综合征'}) RETURN d.cure_way"
    },
    {
        "input": "小儿室间隔缺损能自愈吗？",
        "cypher": "MATCH (n:Disease {name: '小儿室间隔缺损'}) RETURN n.cured_prob"
    },
    {
        "input": "小儿急性小脑性共济失调吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '小儿急性小脑性共济失调'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "宝宝腹泻呕吐去医院验了血说是病毒引起？",
        "cypher": "MATCH (m:Disease {name: '病毒性肠炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "三叉神经痛哪家医院治的好疗效快三叉神经痛三叉",
        "cypher": "MATCH (m:Disease {name: '三叉神经痛'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "关于甲状腺炎的症状是什么",
        "cypher": "MATCH (m:Disease {name:'甲状腺炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "毛细血管瘤，吃什么药好？",
        "cypher": "MATCH (m:Disease {name:'毛细血管瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "原位癌临床如何进行治疗？",
        "cypher": "MATCH (d:Disease {name: '原位癌'}) RETURN d.cure_way"
    },
    {
        "input": "治疗神经衰弱哪家医院好?",
        "cypher": "MATCH (v1:Disease {name: '神经衰弱'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "男宝宝尿道下裂能自己痊愈吗",
        "cypher": "MATCH (m:Disease {name:'尿道下裂'}) RETURN m.cure_lasttime"
    },
    {
        "input": "鼻咽癌晚期能活多长时间？",
        "cypher": "MATCH (m:Disease {name: '鼻咽癌'}) RETURN m.cure_lasttime"
    },
    {
        "input": "脑萎缩一般检查需要多少钱？",
        "cypher": "MATCH (n:Disease {name: '脑萎缩'})-[:need_check]->(m:Check) RETURN m.cost_money"
    },
    {
        "input": "刚结婚性功能却下降怎么回事？",
        "cypher": "MATCH (m:Disease {name:'性功能障碍'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "食管血管瘤要注意哪些问题",
        "cypher": "MATCH (d:Disease {name: '食管血管瘤'}) RETURN d.easy_get"
    },
    {
        "input": "请问如何快速的醒酒？谢谢了",
        "cypher": "MATCH (d:Disease {name: '宿醉'}) RETURN d.cure_way"
    },
    {
        "input": "疑似血管瘤该注意些什么？",
        "cypher": "MATCH (m:Disease {name:'血管瘤'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "癌症吃药可以好吗",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "有甲状腺肿瘤要注意什么问题",
        "cypher": "MATCH (m:Disease {name: '甲状腺肿瘤'})-[:no_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "癫痫一年了，共大发作四次",
        "cypher": "MATCH (d:Disease {name: '癫痫'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "胃炎时间长了会不会得胃癌？",
        "cypher": "MATCH (v1:Disease {name: '胃炎'})-[:acompany_with]-(v2:Disease {name: '胃癌'}) RETURN v1,v2"
    },
    {
        "input": "我最近突然就感觉阳痿了怎么才能恢复到以前呢？",
        "cypher": "MATCH (d:Disease {name: '阳痿'}) RETURN d.cure_way"
    },
    {
        "input": "神经源性肿瘤",
        "cypher": "MATCH (m:Disease {name: '神经源性肿瘤'}) RETURN m"
    },
    {
        "input": "总熬夜有前列腺炎是早泄原因吗",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:acompany_with]->(n:Disease {name:'早泄'}) RETURN m.name, n.name"
    },
    {
        "input": "脊柱裂引起小儿内翻足怎么治？",
        "cypher": "MATCH (d:Disease {name: '脊柱裂'}) RETURN d.cure_way"
    },
    {
        "input": "小孩鼻子出血是什么原因？",
        "cypher": "MATCH (m:Disease {name: '鼻出血'}) RETURN m.cause"
    },
    {
        "input": "女，31岁，有哮喘和过敏性哮喘七八年了，可以",
        "cypher": "MATCH (d:Disease {name: '哮喘'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "重庆哪家医院治疗膀胱结石最好",
        "cypher": "MATCH (v1:Disease {name: '膀胱结石'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "如何判断产后甲状腺炎？",
        "cypher": "MATCH (m:Disease {name:'产后甲状腺炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "新生儿巨细胞病毒感染的检查？",
        "cypher": "MATCH (m:Disease {name:'新生儿巨细胞病毒感染'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "卵巢癌晚期已肾衰竭如何缓解",
        "cypher": "MATCH (d:Disease {name: '卵巢癌'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "血色病性骨关节病的病因有哪些呢？",
        "cypher": "MATCH (n:Disease {name: '血色病性骨关节病'}) RETURN n.cause"
    },
    {
        "input": "血管肉瘤的最佳治疗方法有什么",
        "cypher": "MATCH (d:Disease {name: '血管肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "癫痫吃药后发烧是怎么回事呀",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m.cure_lasttime"
    },
    {
        "input": "宝宝为什么发低烧有时正常又有时发烧的",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '低烧' RETURN d.name"
    },
    {
        "input": "糖尿病要如何服药？",
        "cypher": "MATCH (m:Disease {name:'糖尿病'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "脑萎缩吃什么药会比较管用呢",
        "cypher": "MATCH (m:Disease {name:'脑萎缩'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "睾丸炎医院哪家能更好改善些呢",
        "cypher": "MATCH (m:Disease {name:'睾丸炎'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "气胸严重吗？",
        "cypher": "MATCH (m:Disease {name: '气胸'}) RETURN m.cure_lasttime"
    },
    {
        "input": "想知道帕金森病会遗传吗？",
        "cypher": "MATCH (n:Disease {name: '帕金森病'}) RETURN n.get_way"
    },
    {
        "input": "哪些因素容易造成包皮过长？",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '包皮过长' RETURN r1.cause"
    },
    {
        "input": "变应性血管炎的病因是什么",
        "cypher": "MATCH (m:Disease {name: '变应性血管炎'}) RETURN m.cause"
    },
    {
        "input": "肺癌术后饮食方面要注意什么？",
        "cypher": "MATCH (n:Disease {name: '肺癌'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "新生儿溶血病确诊与医治",
        "cypher": "MATCH (d:Disease {name: '新生儿溶血病'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "小儿缺铁性贫血应该多吃什麽食物?",
        "cypher": "MATCH (m:Disease {name:'小儿缺铁性贫血'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "哪有比较权威的专治睾丸癌医院？",
        "cypher": "MATCH (n1:Disease {name: '睾丸癌'})-[:belongs_to]->(n2:Department) RETURN n2"
    },
    {
        "input": "疝气不用补片可以吗",
        "cypher": "MATCH (n:Disease {name: '疝气'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "脂肪肝的严重后果是什么",
        "cypher": "MATCH (m:Disease {name: '脂肪肝'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "宫颈糜烂在哪个位置？",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "非细菌性前列腺炎用药没改变怎么办",
        "cypher": "MATCH (m:Disease {name:'非细菌性前列腺炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "我的胸腔积液很少但吸收很慢怎么办",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '胸腔积液' AND d.name = '胸腔积液' RETURN d.cureWay"
    },
    {
        "input": "卵巢交界性肿瘤会复发吗",
        "cypher": "MATCH (m:Disease {name:'卵巢交界性肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "乳腺癌手术用保健品吗",
        "cypher": "MATCH (v1:Disease {name: '乳腺癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "结婚前夕体检查出输卵管阻塞，我该怎么办？",
        "cypher": "MATCH (d:Disease {name: '输卵管阻塞'}) RETURN d.cure_way"
    },
    {
        "input": "肺心病患者有哪些忌口",
        "cypher": "MATCH (v1:Disease {name: '肺心病'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "最好的治脂肪瘤医院都有哪几家呢？",
        "cypher": "MATCH (n:Disease {name: '脂肪瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "阴囊炎做了激光能好吗？",
        "cypher": "MATCH (d:Disease {name: '阴囊炎'}) RETURN d.cure_way"
    },
    {
        "input": "勃起是露出鬼头不勃起只是包皮过长吗？",
        "cypher": "MATCH (m:Disease {name: '勃起功能障碍'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "请问心力衰竭有哪几种分类法",
        "cypher": "MATCH (n:Disease {name: '心力衰竭'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "前列腺钙化是什么意思呢？",
        "cypher": "MATCH (m:Disease {name: '前列腺钙化'}) RETURN m.desc"
    },
    {
        "input": "白血病有哪些呢忌口的东西",
        "cypher": "MATCH (v1:Disease {name: '白血病'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "感冒头会痛是什么原因导致的",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom {name:'头痛'}) RETURN m.cause"
    },
    {
        "input": "甲状腺结节治疗费用大概多少",
        "cypher": "MATCH (m:Disease {name:'甲状腺结节'})-[:belongs_to]->(n:Department) RETURN m.cost_money"
    },
    {
        "input": "预防老烂腿的关键步骤有哪些？",
        "cypher": "MATCH (m:Disease {name:'老烂腿'}) RETURN m.desc"
    },
    {
        "input": "乙肝有什么新药可以试用？",
        "cypher": "MATCH (v1:Disease {name: '乙肝'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "胸腺癌吃什么中药好点",
        "cypher": "MATCH (v1:Disease {name: '胸腺癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "原发性肝癌需要注意什么",
        "cypher": "MATCH (m:Disease {name: '原发性肝癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "睡眠型癫痫是什么意思",
        "cypher": "MATCH (m:Disease) WHERE m.name = '睡眠型癫痫' RETURN m.desc"
    },
    {
        "input": "请问卵巢囊肿怎么回事",
        "cypher": "MATCH (m:Disease {name:'卵巢囊肿'}) RETURN m.name,m.desc"
    },
    {
        "input": "为什么总是浑身发冷",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '浑身发冷' RETURN m.name"
    },
    {
        "input": "福建哪家治疗肝吸虫病医院好",
        "cypher": "MATCH (v1:Disease {name: '肝吸虫病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "腰肌劳损有哪些并发症的问题",
        "cypher": "MATCH (m:Disease {name:'腰肌劳损'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "帕金森属于什么样的疾病",
        "cypher": "MATCH (m:Disease {name: '帕金森病'}) RETURN m"
    },
    {
        "input": "治疗血液病医院排名 您知道吗 求解答",
        "cypher": "MATCH (n:Disease {name:'血液病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "消化科胃食管反流病咋治？",
        "cypher": "MATCH (d:Disease {name: '胃食管反流病'}) RETURN d.cure_way"
    },
    {
        "input": "小脑梗塞有什么症状?",
        "cypher": "MATCH (m:Disease {name:'小脑梗塞'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "纵隔肿瘤7cm是晚期吗",
        "cypher": "MATCH (m:Disease {name:'纵隔肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "有肾病的人会不会影响月经",
        "cypher": "MATCH (d:Disease {name: '肾病'}) RETURN d.easy_get"
    },
    {
        "input": "患有乳腺结节较近乳房胀痛能是哪些情况吗",
        "cypher": "MATCH (m:Disease {name:'乳腺结节'})-[:has_symptom]->(n:Symptom {name:'乳房胀痛'}) RETURN m.name"
    },
    {
        "input": "小儿便秘如何用药治疗",
        "cypher": "MATCH (m:Disease {name:'小儿便秘'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "我现在很是想知道高血压脑病到底是怎么一回事那",
        "cypher": "MATCH (n:Disease {name: '高血压脑病'}) RETURN n"
    },
    {
        "input": "头晕是哪些疾病引起？",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '头晕' RETURN m.name"
    },
    {
        "input": "肾动脉狭窄食谱大全有哪些？",
        "cypher": "MATCH (m:Disease {name:'肾动脉狭窄'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "为什么会得脑血栓呢",
        "cypher": "MATCH (m:Disease {name: '脑血栓'}) RETURN m.cause"
    },
    {
        "input": "性功能障碍的基本表现是什么？",
        "cypher": "MATCH (n:Disease)-[r1:has_symptom]->(m:Symptom) WHERE n.name = '性功能障碍' RETURN m.name"
    },
    {
        "input": "手淫使得阴茎不勃起如何解决？我该吃什么药？",
        "cypher": "MATCH (m:Disease {name: '阳痿'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "宝宝有一个睾丸一直没下来怎么治？",
        "cypher": "MATCH (m:Disease {name: '睾丸下降不全'}) RETURN m.cure_way"
    },
    {
        "input": "小儿急性胃炎注意什么",
        "cypher": "MATCH (m:Disease {name:'小儿急性胃炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "球形肺炎怎么治疗 ",
        "cypher": "MATCH (d:Disease {name: '球形肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "卵巢性不孕怎么治疗好？",
        "cypher": "MATCH (d:Disease {name: '卵巢性不孕'}) RETURN d.cure_way"
    },
    {
        "input": "如何排除新生儿湿肺？",
        "cypher": "MATCH (m:Disease {name:'新生儿湿肺'})-[:need_check]->(n:Check) RETURN m.name, n.name"
    },
    {
        "input": "病毒性肝炎会传染么",
        "cypher": "MATCH (v1:Disease {name: '病毒性肝炎'})-[]->(v2) RETURN v2.get_way"
    },
    {
        "input": "阴囊有时有一点痛，不易勃起，感觉精冷，早泄",
        "cypher": "MATCH (m:Disease {name: '早泄'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "传导性耳聋怎么治疗",
        "cypher": "MATCH (d:Disease {name: '传导性耳聋'}) RETURN d.cure_way"
    },
    {
        "input": "请问是胸主动脉瘤吗干预治疗好还是手术好?",
        "cypher": "MATCH (d:Disease {name: '胸主动脉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "什么原因会造成面瘫？",
        "cypher": "MATCH (m:Disease {name:'面瘫'}) RETURN m.cause"
    },
    {
        "input": "甲状腺功能减退症的治疗方法",
        "cypher": "MATCH (d:Disease {name: '甲状腺功能减退症'}) RETURN d.cure_way"
    },
    {
        "input": "睾丸囊上面起了老多疙瘩严不严重？",
        "cypher": "MATCH (m:Disease {name: '睾丸囊肿'}) RETURN m.cause"
    },
    {
        "input": "青岛哪里看胃好点",
        "cypher": "MATCH (v1:Disease {name: '胃病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "脑血栓形成的原因是什么？",
        "cypher": "MATCH (m:Disease {name:'脑血栓'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "外阴脂肪瘤怎么治？",
        "cypher": "MATCH (d:Disease {name: '外阴脂肪瘤'}) RETURN d.cure_way"
    },
    {
        "input": "胆结石穴位在哪里呢",
        "cypher": "MATCH (m:Disease {name: '胆结石'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "宝宝黄疸是19.2，问题严重吗？",
        "cypher": "MATCH (m:Disease {name:'黄疸'})-[:acompany_with]-(n:Disease) RETURN n.get_prob"
    },
    {
        "input": "我的症状是不是脑瘤阿？",
        "cypher": "MATCH (m:Disease {name:'脑瘤'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "肾阳虛怎么治疗",
        "cypher": "MATCH (d:Disease {name: '肾阳虚'}) RETURN d.cure_way"
    },
    {
        "input": "得了乳腺增生应该注意什么？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "脑膜瘤患者是酸性体质吗怎样辨别",
        "cypher": "MATCH (d:Disease {name: '脑膜瘤'}) RETURN d.easy_get"
    },
    {
        "input": "阴道炎是中药好还是西药好？",
        "cypher": "MATCH (n1:Disease {name: '阴道炎'})-[:common_drug|:recommand_drug]->(n2:Drug) RETURN n2.name"
    },
    {
        "input": "脉管畸形怎么护理？",
        "cypher": "MATCH (d:Disease {name: '脉管畸形'}) RETURN d.cure_way"
    },
    {
        "input": "怎么推测自己如何得了面瘫？",
        "cypher": "MATCH (m:Disease {name:'面瘫'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "小儿癫痫一直用药物治疗好不好呢？",
        "cypher": "MATCH (n:Disease {name:'小儿癫痫'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肝肾综合征一般咋缓解治疗呢",
        "cypher": "MATCH (d:Disease {name: '肝肾综合征'}) RETURN d.cure_way"
    },
    {
        "input": "动脉血氧饱和度降低是怎么回事？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'动脉血氧饱和度降低'}) RETURN m.name, m.desc"
    },
    {
        "input": "吃什么有助于缓解脑萎缩",
        "cypher": "MATCH (v1:Disease {name: '脑萎缩'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "前列腺检查是正常的吗",
        "cypher": "MATCH (v:Disease)-[e:need_check]->(v1:Check) WHERE v1.name = '前列腺检查' RETURN v1.name AS name, '正常' AS result"
    },
    {
        "input": "子宫息肉患者需要注意什么饮食",
        "cypher": "MATCH (v1:Disease {name: '子宫息肉'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "纵隔肿瘤检查什么数值属于正常",
        "cypher": "MATCH (m:Disease {name: '纵隔肿瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "性欲减退是怎么回事",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'性欲减退'}) RETURN m.name, m.desc"
    },
    {
        "input": "请问非霍奇金淋巴瘤能活多久",
        "cypher": "MATCH (m:Disease {name: '非霍奇金淋巴瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "长了外痔大概有3天能治吗？",
        "cypher": "MATCH (m:Disease {name:'外痔'}) RETURN m.cure_lasttime"
    },
    {
        "input": "小儿肺炎如何早期识别",
        "cypher": "MATCH (d:Disease {name: '小儿肺炎'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "诊断睾丸癌的方法有哪些",
        "cypher": "MATCH (m:Disease {name: '睾丸癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "肋间神经痛左边右边都痛，怎么办?",
        "cypher": "MATCH (m:Disease {name:'肋间神经痛'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "泌尿系结石怎么引起的？",
        "cypher": "MATCH (m:Disease {name:'泌尿系结石'}) RETURN m.cause"
    },
    {
        "input": "我的孩子有遗尿的习惯咋办？",
        "cypher": "MATCH (d:Disease {name: '遗尿'}) RETURN d.cure_way"
    },
    {
        "input": "内痔便血多少天算早期",
        "cypher": "MATCH (m:Disease {name: '内痔'})-[:has_symptom]->(n:Symptom {name: '便血'}) RETURN n.get_prob"
    },
    {
        "input": "哪里可以治疗子宫内膜炎？",
        "cypher": "MATCH (n1:Disease {name: '子宫内膜炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "不稳定型心绞痛怎么回事",
        "cypher": "MATCH (m:Disease {name:'不稳定型心绞痛'}) RETURN m.name, m.desc"
    },
    {
        "input": "5岁宝宝患癫痫要做脑电图吗",
        "cypher": "MATCH (d:Disease {name: '癫痫'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "小儿中耳炎吃什么药效果好？",
        "cypher": "MATCH (v1:Disease {name: '小儿中耳炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "乳头溢液服药可以治好吗",
        "cypher": "MATCH (n:Disease {name: '乳头溢液'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "血色病是什么呢？",
        "cypher": "MATCH (m:Disease {name:'血色病'}) RETURN m.name,m.desc"
    },
    {
        "input": "孩子得支气管哮喘和遗传有没有关系？",
        "cypher": "MATCH (d:Disease {name: '支气管哮喘'}) RETURN d.easy_get"
    },
    {
        "input": "男人四十之后性欲减退怎么办",
        "cypher": "MATCH (d:Disease {name: '性欲减退'}) RETURN d.cure_way"
    },
    {
        "input": "痛风性关节炎，在大拇指趾骨",
        "cypher": "MATCH (m:Disease {name: '痛风性关节炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "肾囊肿看那个科室？",
        "cypher": "MATCH (v1:Disease {name: '肾囊肿'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "老人有急性胃肠炎怎么办",
        "cypher": "MATCH (d:Disease {name: '急性胃肠炎'}) RETURN d.easy_get"
    },
    {
        "input": "甲亢眼突能治愈吗",
        "cypher": "MATCH (d:Disease {name: '甲亢眼突'}) RETURN d.cure_way"
    },
    {
        "input": "血管瘤的治疗方法和最佳时间是什么时候呀？",
        "cypher": "MATCH (d:Disease {name: '血管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "急性膀胱炎咋回事",
        "cypher": "MATCH (m:Disease {name: '急性膀胱炎'}) RETURN m"
    },
    {
        "input": "淋巴瘤要忌口什么吗？",
        "cypher": "MATCH (m:Disease {name:'淋巴瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "如何检查自己的尿路感染已经好了",
        "cypher": "MATCH (m:Disease {name: '尿路感染'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "再生一个孩子能将产后风给带好?",
        "cypher": "MATCH (d:Disease {name: '产后风'}) RETURN d.easy_get"
    },
    {
        "input": "睾丸癌平时不可以吃什么",
        "cypher": "MATCH (m:Disease {name: '睾丸癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "脑梗塞的恢复期有多久？",
        "cypher": "MATCH (m:Disease {name:'脑梗塞'}) RETURN m.cure_lasttime"
    },
    {
        "input": "卵巢癌预防措施是什么呀？",
        "cypher": "MATCH (n:Disease {name: '卵巢癌'}) RETURN n.prevent"
    },
    {
        "input": "附睾畸形是一种什么样的泌尿疾病呢？",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '附睾畸形' RETURN m,n"
    },
    {
        "input": "糜烂性胃炎饮食禁忌什么",
        "cypher": "MATCH (v1:Disease {name: '糜烂性胃炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "两岁宝宝吃东西消化不好吃些什么呢 ",
        "cypher": "MATCH (v1:Disease {name: '消化不良'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "食道溃疡哪家医院能做试管镜手术？",
        "cypher": "MATCH (n1:Disease {name: '食道溃疡'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "总是恶心，胃帐，厌食是怎么回事",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '恶心' OR n.name = '胃帐' OR n.name = '厌食' RETURN m.name"
    },
    {
        "input": "癌症怎么可以预防呢",
        "cypher": "MATCH (n:Disease {name: '癌症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "胆囊癌检查项目有哪些该注意什么？",
        "cypher": "MATCH (m:Disease {name: '胆囊癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "什么是先天性脑积水",
        "cypher": "MATCH (m:Disease {name: '先天性脑积水'}) RETURN m"
    },
    {
        "input": "百日咳引发的咳嗽症状是怎样的？",
        "cypher": "MATCH (n:Disease {name: '百日咳'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "治疗小叶增生使用哪些药比较好",
        "cypher": "MATCH (m:Disease {name:'小叶增生'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "现在我患上了胃癌还能活多长时间那?",
        "cypher": "MATCH (n:Disease {name: '胃癌'}) RETURN n.cure_lasttime"
    },
    {
        "input": "腹泻到底是怎么了？",
        "cypher": "MATCH (m:Disease {name: '腹泻'}) RETURN m"
    },
    {
        "input": "宫颈糜烂和霉菌性阴道炎指的是什么",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'}) RETURN m.name,m.desc"
    },
    {
        "input": "甲状腺功能减退会引起怀孕吗？",
        "cypher": "MATCH (d:Disease {name: '甲状腺功能减退'}) RETURN d.easy_get"
    },
    {
        "input": "急性胰腺炎愈后做胆囊切除术后吃什么好",
        "cypher": "MATCH (v1:Disease {name: '急性胰腺炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "胃炎晚上饿怎么调整",
        "cypher": "MATCH (d:Disease {name: '胃炎'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "是脂肪瘤还是毛囊炎",
        "cypher": "MATCH (m:Disease {name:'脂肪瘤'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "子宫平滑肌肉瘤吃药治疗能好吗",
        "cypher": "MATCH (m:Disease {name:'子宫平滑肌肉瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m.cure_lasttime, m.cured_prob"
    },
    {
        "input": "下肢深静脉血栓形成会导致死亡吗",
        "cypher": "MATCH (m:Disease {name:'下肢深静脉血栓形成'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "为什么我会得结肠炎？",
        "cypher": "MATCH (m:Disease {name:'结肠炎'}) RETURN m.cause"
    },
    {
        "input": "习惯性流产怀孕后要做什么检查？",
        "cypher": "MATCH (m:Disease {name:'习惯性流产'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "怎样让癌症病人有食欲",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "针对宫颈肥大是怎么回事",
        "cypher": "MATCH (m:Disease {name:'宫颈肥大'}) RETURN m.name, m.desc"
    },
    {
        "input": "哪家医院治疗巧克力囊肿好",
        "cypher": "MATCH (n:Disease {name:'巧克力囊肿'})-[:belongs_to]->(m:Department) RETURN m.name"
    }
]