[
    {
        "input": "小儿麻痹症后遗症可以治疗吗？",
        "cypher": "MATCH (d:Disease {name: '小儿麻痹症'}) RETURN d.cure_way"
    },
    {
        "input": "胃肠疾病用什么药物治疗",
        "cypher": "MATCH (v1:Disease {name: '胃肠疾病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "请问腰椎病有什么好的治疗方法",
        "cypher": "MATCH (d:Disease {name: '腰椎病'}) RETURN d.cure_way"
    },
    {
        "input": "子宫内膜异位症会导致不孕么",
        "cypher": "MATCH (d:Disease {name: '子宫内膜异位症'}) RETURN d.easy_get"
    },
    {
        "input": "食道超声和胃镜哪个更准确",
        "cypher": "MATCH (v1:Disease)-[e1:need_check]->(v2:Check) WHERE v2.name = '食道超声' OR v2.name = '胃镜' RETURN v1.name, v2.name"
    },
    {
        "input": "身上蜘蛛痣越来越多怎么办",
        "cypher": "MATCH (m:Disease {name: '蜘蛛痣'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "排卵期出血同房了会是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'排卵期出血'})-[:acompany_with]->(n:Disease) RETURN m.name,n.name"
    },
    {
        "input": "巨大肥厚性胃炎必须做手术吗？",
        "cypher": "MATCH (d:Disease {name: '巨大肥厚性胃炎'}) RETURN d.cure_way"
    },
    {
        "input": "在生活中该怎样预防直肠癌",
        "cypher": "MATCH (m:Disease {name: '直肠癌'})-[:belongs_to]->(n:Department) RETURN m.prevent AS 预防措施"
    },
    {
        "input": "非霍奇金淋巴瘤该怎么快速治呢?能治好吗?",
        "cypher": "MATCH (d:Disease {name: '非霍奇金淋巴瘤'}) RETURN d.cure_way"
    },
    {
        "input": "小儿咳嗽食疗有哪些食谱？",
        "cypher": "MATCH (v1:Disease {name: '小儿咳嗽'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "乳腺增生对人体的危害有什么？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'}) RETURN m.desc"
    },
    {
        "input": "遗精多久检查精液不影响效果呢？",
        "cypher": "MATCH (n:Disease {name:'遗精'})-[:need_check]->(m:Check {name:'精液检查'}) RETURN m.get_way"
    },
    {
        "input": "哪个医院能更好的治疗三叉神经痛这种疾病啊？",
        "cypher": "MATCH (n:Disease {name: '三叉神经痛'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "狼疮性肾炎的分型有什么",
        "cypher": "MATCH (n:Disease {name: '狼疮性肾炎'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "四个月大的宝宝查出得了支气管肺炎，一定要住院",
        "cypher": "MATCH (d:Disease {name: '支气管肺炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "肺脓肿可以根除吗",
        "cypher": "MATCH (d:Disease {name: '肺脓肿'}) RETURN d.cure_way"
    },
    {
        "input": "治痔疮多少钱",
        "cypher": "MATCH (m:Disease {name:'痔疮'}) RETURN m.cost_money"
    },
    {
        "input": "脑性瘫痪后遗症",
        "cypher": "MATCH (m:Disease {name:'脑性瘫痪'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "手淫完会不会对肾和前列腺不好",
        "cypher": "MATCH (d:Disease)-[r:belongs_to]->(dp:Department) WHERE d.name = '前列腺炎' RETURN dp.name"
    },
    {
        "input": "像我这个年纪长鹅口疮艾滋病感染的几率有多",
        "cypher": "MATCH (d:Disease {name: '鹅口疮'}) RETURN d.easy_get"
    },
    {
        "input": "肾损伤做什么检查？",
        "cypher": "MATCH (m:Disease {name:'肾损伤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "生活中怎样预防偏瘫",
        "cypher": "MATCH (m:Disease {name:'偏瘫'})-[:belongs_to]->(n:Department) RETURN m.prevent,n.name"
    },
    {
        "input": "恶性胸腔积液抗生素缓解有用吗？",
        "cypher": "MATCH (d:Disease {name: '恶性胸腔积液'}) RETURN d.cure_way"
    },
    {
        "input": "妇科炎症有哪些种类？",
        "cypher": "MATCH (v1:Disease {name: '妇科炎症'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "医院看子宫内膜癌大概要多少钱改善呢",
        "cypher": "MATCH (m:Disease {name:'子宫内膜癌'})-[:belongs_to]->(n:Department) RETURN n.name AS 科室名称, m.cost_money AS 费用"
    },
    {
        "input": "尤文氏肉瘤应该如何预防",
        "cypher": "MATCH (n:Disease {name: '尤文氏肉瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "脑梗塞和高血压吃什么药好?",
        "cypher": "MATCH (m:Disease {name:'脑梗塞'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m.name, n.name"
    },
    {
        "input": "孕妇为什么会肝血管瘤？",
        "cypher": "MATCH (d:Disease {name: '肝血管瘤'}) RETURN d.easy_get"
    },
    {
        "input": "痔疮反复发作的原因是什么",
        "cypher": "MATCH (m:Disease {name: '痔疮'})-[:acompany_with]-(n:Disease) RETURN n.cause"
    },
    {
        "input": "腹痛检查结果怎么查看",
        "cypher": "MATCH (v1:Disease {name: '腹痛'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "医生说我是卵泡囊肿咋办？",
        "cypher": "MATCH (m:Disease {name:'卵泡囊肿'})-[:belongs_to]->(b:Department) RETURN b.name AS name"
    },
    {
        "input": "脑鸣有没有办法治疗 ",
        "cypher": "MATCH (d:Disease {name: '脑鸣'}) RETURN d.cure_way"
    },
    {
        "input": "今年六月开始准备要宝宝精子不合格怎么办？",
        "cypher": "MATCH (d:Disease {name: '不孕不育'}) RETURN d.cure_way"
    },
    {
        "input": "口臭了是怎么回事呢？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'口臭'}) RETURN m.name AS name,m.desc AS desc"
    },
    {
        "input": "小儿癫痫的病因及其留意点有什么？",
        "cypher": "MATCH (m:Disease {name:'小儿癫痫'})-[:acompany_with]->(n:Disease) RETURN m.cause,n.name"
    },
    {
        "input": "肾萎缩的症状都有什么",
        "cypher": "MATCH (v1:Disease {name: '肾萎缩'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "尖锐湿疣的患者怎么饮食",
        "cypher": "MATCH (m:Disease {name: '尖锐湿疣'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "有什么药是能提高癌症病人抵抗力的？",
        "cypher": "MATCH (v1:Disease {name: '癌症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "少突胶质细胞瘤二级手术后怎么样治疗",
        "cypher": "MATCH (d:Disease {name: '少突胶质细胞瘤'}) RETURN d.cure_way"
    },
    {
        "input": "快速治疗疱疹",
        "cypher": "MATCH (d:Disease {name: '疱疹'}) RETURN d.cure_way"
    },
    {
        "input": "求问小儿麻痹症会遗传吗",
        "cypher": "MATCH (n:Disease {name: '小儿麻痹症'})-[:acompany_with]->(m:Disease) RETURN m.get_prob"
    },
    {
        "input": "45岁后要服药预防心脑血管疾病吗",
        "cypher": "MATCH (n:Disease {name: '心脑血管疾病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "四年前有宫颈癌，现在查出来是肺癌，陕西哪家肺",
        "cypher": "MATCH (d:Disease {name: '肺癌'})-[:belongs_to]->(dp:Department)<-[:belongs_to]-(d2:Disease {name: '宫颈癌'}) RETURN dp"
    },
    {
        "input": "乳腺囊肿的病因主要有哪些",
        "cypher": "MATCH (n:Disease {name: '乳腺囊肿'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "最近老是尿频。尿急。而且还很痛是什么原因",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '尿频' OR n.name = '尿急' OR n.name = '尿痛' RETURN m.name"
    },
    {
        "input": "纵膈肿瘤这个病是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'纵膈肿瘤'}) RETURN m"
    },
    {
        "input": "请问医生表面抗原阳性一定是乙肝有问题吗",
        "cypher": "MATCH (m:Disease {name:'乙肝'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "脑性瘫痪综合征应该如何治",
        "cypher": "MATCH (d:Disease {name: '脑性瘫痪综合征'}) RETURN d.cure_way"
    },
    {
        "input": "新生儿肺炎疗程是多久？",
        "cypher": "MATCH (n:Disease {name: '新生儿肺炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "子宫肌瘤这种疾病严重吗",
        "cypher": "MATCH (n:Disease {name: '子宫肌瘤'}) RETURN n.cause"
    },
    {
        "input": "脑震荡的临床症状",
        "cypher": "MATCH (d:Disease {name: '脑震荡'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "风湿病在生活中要怎么保养啊？",
        "cypher": "MATCH (n:Disease {name: '风湿病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "得了肾囊肿不及时治疗会要紧吗？",
        "cypher": "MATCH (n:Disease {name: '肾囊肿'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "盆腔炎要做什么检查可以查出来？",
        "cypher": "MATCH (m:Disease {name:'盆腔炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "甲状腺癌检查基本上要多少钱",
        "cypher": "MATCH (n:Disease {name: '甲状腺癌'})-[:need_check]->(m:Check) RETURN m.name, n.cost_money"
    },
    {
        "input": "新生儿低钙血症的护理是啥啊",
        "cypher": "MATCH (d:Disease {name: '新生儿低钙血症'}) RETURN d.cure_way"
    },
    {
        "input": "早泄怎么治疗才好呢？有什么好的治疗方法？",
        "cypher": "MATCH (m:Disease {name:'早泄'}) RETURN m.cure_way"
    },
    {
        "input": "结肠炎会导致腹泻还是便秘",
        "cypher": "MATCH (v1:Disease {name: '结肠炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "小孩发烧，发抖怎么办",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '发烧' OR s.name = '发抖' RETURN d.name, d.desc"
    },
    {
        "input": "2岁孩子为什么会得睡眠型癫痫",
        "cypher": "MATCH (d:Disease {name: '睡眠型癫痫'}) RETURN d.easy_get"
    },
    {
        "input": "肾虚应注意什么？",
        "cypher": "MATCH (n:Disease {name: '肾虚'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "肾病综合征都有哪些症状",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '肾病综合征' RETURN n.name"
    },
    {
        "input": "宝宝一觉醒来有点咳嗽怎么办？",
        "cypher": "MATCH (m:Disease {name:'咳嗽'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "治疗子宫内膜炎费用大概需多少",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜炎'})-[]->(v2) RETURN v2.cost_money"
    },
    {
        "input": "菌血症是血液脏吗吗？",
        "cypher": "MATCH (m:Disease {name:'菌血症'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "你好!我孩子得了视神经炎,一个",
        "cypher": "MATCH (d:Disease {name: '视神经炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "胆囊炎去医院怎么检查",
        "cypher": "MATCH (m:Disease {name: '胆囊炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "治疗肠炎的药有什么？",
        "cypher": "MATCH (v1:Disease {name: '肠炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "面瘫忌口有哪些还有其他方面我该注意些什么？",
        "cypher": "MATCH (m:Disease {name:'面瘫'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "风湿性心脏病，该如何饮食调理？",
        "cypher": "MATCH (n:Disease {name: '风湿性心脏病'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "我孩子得了小儿肠套叠应该怎么做灌肠治疗？",
        "cypher": "MATCH (d:Disease {name: '小儿肠套叠'}) RETURN d.cure_way"
    },
    {
        "input": "刚做完流产用什么药能防炎症发生",
        "cypher": "MATCH (v1:Disease {name: '流产'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脂肪肝如果不治疗会有什么后果",
        "cypher": "MATCH (v1:Disease {name: '脂肪肝'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "子宫内膜炎晚期什么症状",
        "cypher": "MATCH (n:Disease {name: '子宫内膜炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "风湿性心脏病不能吃什么",
        "cypher": "MATCH (v1:Disease {name: '风湿性心脏病'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "内分泌失调检查哪些",
        "cypher": "MATCH (v1:Disease {name: '内分泌失调'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "怎么判断可能得阴茎癌",
        "cypher": "MATCH (m:Disease {name: '阴茎癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "10年甲亢，14年甲减用什么药",
        "cypher": "MATCH (d:Disease {name: '甲亢'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "小脑扁桃体下疝畸形何时做手术好风险怎么样？",
        "cypher": "MATCH (d:Disease {name: '小脑扁桃体下疝畸形'}) RETURN d.cure_way"
    },
    {
        "input": "哪些疾病的出现会导致直肠癌",
        "cypher": "MATCH (v1:Disease {name: '直肠癌'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "胸壁结核吃什么好",
        "cypher": "MATCH (v1:Disease {name: '胸壁结核'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "入职体检脂肪肝",
        "cypher": "MATCH (n:Disease {name:'脂肪肝'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "狼疮性肾炎进厂工作行吗",
        "cypher": "MATCH (d:Disease {name: '狼疮性肾炎'}) RETURN d.easy_get"
    },
    {
        "input": "不知道我是不是风湿病？",
        "cypher": "MATCH (m:Disease {name: '风湿病'}) RETURN m"
    },
    {
        "input": "恶心，肚子疼怎么处理",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '恶心' OR s.name = '肚子疼' RETURN d.name, d.prevent"
    },
    {
        "input": "宝宝老是流容鼻涕",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '流鼻涕' RETURN d.name"
    },
    {
        "input": "口腔癌疾病的早期症状特点？",
        "cypher": "MATCH (n:Disease {name: '口腔癌'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "龟头炎需要吃些什么",
        "cypher": "MATCH (v1:Disease {name: '龟头炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "附睾炎要检查什么",
        "cypher": "MATCH (v1:Disease {name: '附睾炎'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "什么是阴茎异常勃起？",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '阴茎异常勃起' RETURN m,r1,n"
    },
    {
        "input": "低血压平时应注意什么",
        "cypher": "MATCH (d:Disease {name: '低血压'}) RETURN d.easy_get"
    },
    {
        "input": "治疗幽门螺杆菌感染的专业医院是哪家",
        "cypher": "MATCH (n:Disease {name: '幽门螺杆菌感染'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "腔隙性脑梗死问题严重吗",
        "cypher": "MATCH (m:Disease {name: '腔隙性脑梗死'}) RETURN m.cause"
    },
    {
        "input": "想要治疗癌症去哪家医院好？",
        "cypher": "MATCH (v1:Disease {name: '癌症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "脑血栓形成有哪些病因？",
        "cypher": "MATCH (m:Disease {name:'脑血栓形成'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "脑梗塞动手术大概要花多少钱？",
        "cypher": "MATCH (n:Disease {name: '脑梗塞'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "怎么样诊断脂肪肝",
        "cypher": "MATCH (m:Disease {name: '脂肪肝'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "小儿癫痫的预防怎么做",
        "cypher": "MATCH (n:Disease {name: '小儿癫痫'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "子宫肌瘤会引起的尿频吗",
        "cypher": "MATCH (m:Disease {name:'子宫肌瘤'})-[:has_symptom]->(n:Symptom {name:'尿频'}) RETURN m,n"
    },
    {
        "input": "脂肪肝会复发吗?",
        "cypher": "MATCH (n:Disease {name: '脂肪肝'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "慢性肾炎检查项目有哪些？首先吃什么？",
        "cypher": "MATCH (m:Disease {name:'慢性肾炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "前列腺结石挂什么科？",
        "cypher": "MATCH (v1:Disease {name: '前列腺结石'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "今天遗精了会影响身高吗？",
        "cypher": "MATCH (m:Disease {name:'遗精'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "5岁小孩鼻窦炎",
        "cypher": "MATCH (d:Disease {name: '鼻窦炎'}) RETURN d.easy_get"
    },
    {
        "input": "想知道一切小儿脑瘫的原因是什么?",
        "cypher": "MATCH (n:Disease {name: '小儿脑瘫'}) RETURN n.cause"
    },
    {
        "input": "乳腺肿瘤是属于什么性质？",
        "cypher": "MATCH (n:Disease {name: '乳腺肿瘤'}) RETURN n.cause"
    },
    {
        "input": "膀胱结石为什么总爱光顾男性",
        "cypher": "MATCH (d:Disease {name: '膀胱结石'}) RETURN d.easy_get"
    },
    {
        "input": "怎么知道自己的盆腔积液是病理性的？",
        "cypher": "MATCH (m:Disease {name:'盆腔积液'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "乳腺结节影响大吗？",
        "cypher": "MATCH (m:Disease {name:'乳腺结节'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "如何自己判断是否得了乳腺癌",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "谁知道治疗慢性宫颈炎费用是多少吗？",
        "cypher": "MATCH (n:Disease {name: '慢性宫颈炎'}) RETURN n.cost_money"
    },
    {
        "input": "济南哪家医院治肛裂最好",
        "cypher": "MATCH (v1:Disease {name: '肛裂'})-[:belongs_to]->(v2:Department)<-[:belongs_to]-(v3:Disease {name: '肛裂'}) RETURN v2"
    },
    {
        "input": "患了癫痫会染吗？",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "分娩要准备拿哪些东西",
        "cypher": "MATCH (d:Disease {name: '分娩'}) RETURN d.easy_get"
    },
    {
        "input": "急性化脓性脊髓炎有哪些病症？",
        "cypher": "MATCH (m:Disease {name:'急性化脓性脊髓炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "幽门螺杆菌感染用药会不会出现不良反应",
        "cypher": "MATCH (v1:Disease {name: '幽门螺杆菌感染'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "月经延期，担心宫外孕怎么预防？",
        "cypher": "MATCH (m:Disease {name:'宫外孕'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "坐骨神经痛去哪家医院治疗要怎么治疗效果才能完",
        "cypher": "MATCH (d:Disease {name: '坐骨神经痛'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "神经鞘瘤要如何预防",
        "cypher": "MATCH (d:Disease {name: '神经鞘瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "卵巢早衰会引起什么危害",
        "cypher": "MATCH (m:Disease {name: '卵巢早衰'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "左肾萎缩、右肾囊肿，肾功能不全能否手术治疗？",
        "cypher": "MATCH (d:Disease {name: '肾功能不全'}) RETURN d.cure_way"
    },
    {
        "input": "尿频是什么病症?",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '尿频' RETURN m.name"
    },
    {
        "input": "什么男性会患上死精症呢？",
        "cypher": "MATCH (d:Disease {name: '死精症'}) RETURN d.easy_get"
    },
    {
        "input": "胃肠道癌哪里治疗好 ",
        "cypher": "MATCH (v1:Disease {name: '胃肠道癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "泌尿感染会引起腰痛吗",
        "cypher": "MATCH (m:Disease {name:'泌尿感染'})-[:has_symptom]->(n:Symptom) WHERE n.name = '腰痛' RETURN m"
    },
    {
        "input": "水肿在恢复后包皮变厚?",
        "cypher": "MATCH (m:Disease {name:'水肿'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "请问禽流感什么时候结束？",
        "cypher": "MATCH (m:Disease {name:'禽流感'}) RETURN m.cure_lasttime"
    },
    {
        "input": "男45岁这几年没有性欲怎么办",
        "cypher": "MATCH (m:Disease {name: '性欲减退'})-[:has_symptom]->(n:Symptom {name: '性欲减退'}) RETURN m, n"
    },
    {
        "input": "肿瘤家族遗传病史吗？",
        "cypher": "MATCH (d:Disease {name: '肿瘤'}) RETURN d.easy_get"
    },
    {
        "input": "颅内黑色素瘤应该怎么治疗",
        "cypher": "MATCH (d:Disease {name: '颅内黑色素瘤'}) RETURN d.cure_way"
    },
    {
        "input": "肾积水会有哪些症状表现",
        "cypher": "MATCH (m:Disease {name:'肾积水'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肛乳头瘤保守治疗方法是什么？",
        "cypher": "MATCH (d:Disease {name: '肛乳头瘤'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺增生用什么药最有效",
        "cypher": "MATCH (m:Disease {name:'前列腺增生'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "骨髓纤维化打得干扰素效果不是很好，还有其他治",
        "cypher": "MATCH (d:Disease {name: '骨髓纤维化'}) RETURN d.cure_way"
    },
    {
        "input": "疝气是要要怎样检查？",
        "cypher": "MATCH (m:Disease {name:'疝气'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "治疗幽门螺杆菌感染的中医院都有哪家",
        "cypher": "MATCH (v1:Disease {name: '幽门螺杆菌感染'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "妇科病月经不调怎么办？",
        "cypher": "MATCH (m:Disease {name:'月经不调'})-[:belongs_to]->(n:Department {name:'妇科'}) RETURN n"
    },
    {
        "input": "结肠癌转移方式是什么",
        "cypher": "MATCH (m:Disease {name: '结肠癌'})-[:acompany_with]->(n:Disease) RETURN n.get_way"
    },
    {
        "input": "睾丸扭转的治疗方法有哪些？",
        "cypher": "MATCH (d:Disease {name: '睾丸扭转'}) RETURN d.cure_way"
    },
    {
        "input": "更年期综合征症状有什么",
        "cypher": "MATCH (v1:Disease {name: '更年期综合征'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "急性胆管炎严重吗？",
        "cypher": "MATCH (m:Disease {name:'急性胆管炎'}) RETURN m.cure_lasttime"
    },
    {
        "input": "甲状腺癌长在峡部危害",
        "cypher": "MATCH (m:Disease {name: '甲状腺癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "检查出有附睾畸形有什么办法？",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name='附睾畸形' RETURN n.name"
    },
    {
        "input": "便检能看出是肠套叠吗？",
        "cypher": "MATCH (m:Disease {name:'肠套叠'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "新生儿锁骨骨折多久才能好",
        "cypher": "MATCH (d:Disease {name: '新生儿锁骨骨折'}) RETURN d.cure_way"
    },
    {
        "input": "您好我父亲患有胆结石，想做保胆取石，北京哪家",
        "cypher": "MATCH (d:Disease {name: '胆结石'})-[:belongs_to]->(dp:Department)<-[:belongs_to]-(d2:Disease) RETURN dp.name"
    },
    {
        "input": "阳痿该如何预防和治疗",
        "cypher": "MATCH (d:Disease {name: '阳痿'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称, d.prevent AS 预防措施, d.cure_lasttime AS 治疗周期"
    },
    {
        "input": "神经衰弱会怎样？",
        "cypher": "MATCH (m:Disease {name:'神经衰弱'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "细菌性阴道炎病因什么样！",
        "cypher": "MATCH (n:Disease {name: '细菌性阴道炎'}) RETURN n.cause"
    },
    {
        "input": "56岁女，肾小管性酸中毒导致双肾多发结石，如",
        "cypher": "MATCH (d:Disease {name: '肾小管性酸中毒'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "乳头溢液是怎么了？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'乳头溢液'}) RETURN m.name"
    },
    {
        "input": "关于性冷淡的问题？",
        "cypher": "MATCH (n:Disease {name:'性冷淡'})-[]->(m) RETURN m"
    }
]