[
    {
        "input": "一般怎样能预防前列腺炎的发生",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "甲状腺结节看什么科?",
        "cypher": "MATCH (n1:Disease {name: '甲状腺结节'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "怎样才能预防子宫内膜癌",
        "cypher": "MATCH (m:Disease {name:'子宫内膜癌'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "粘液表皮样癌手术后怎么护理？",
        "cypher": "MATCH (d:Disease {name: '粘液表皮样癌'}) RETURN d.cure_way"
    },
    {
        "input": "儿童睡眠障碍会有什么影响？",
        "cypher": "MATCH (m:Disease {name:'儿童睡眠障碍'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "乳腺增生的中药方子是哪些",
        "cypher": "MATCH (v1:Disease {name: '乳腺增生'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "网站预约下肢静脉曲张医院",
        "cypher": "MATCH (v1:Disease {name: '下肢静脉曲张'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "6个月婴儿三四天没有大便，应该如何解决？",
        "cypher": "MATCH (d:Disease {name: '便秘'}) RETURN d.cure_way"
    },
    {
        "input": "子宫内膜炎都变现在哪些方面",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "甲状腺癌的术后食物有哪些？",
        "cypher": "MATCH (v1:Disease {name: '甲状腺癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "做完摘胆手术吃的补品有什么",
        "cypher": "MATCH (v1:Disease {name: '胆结石'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "葡萄胎会有孕囊吗",
        "cypher": "MATCH (m:Disease {name:'葡萄胎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "您好，我是一位甲状腺癌转移淋巴癌术后8个月，",
        "cypher": "MATCH (d:Disease {name:'甲状腺癌'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "医院治疗甲状腺癌费用多少钱？",
        "cypher": "MATCH (m:Disease {name:'甲状腺癌'})-[:belongs_to]->(n:Department) RETURN n.name, m.cost_money"
    },
    {
        "input": "胃癌患者平时应该如何饮食呢",
        "cypher": "MATCH (m:Disease {name: '胃癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "肛乳头瘤高危人群有哪些？",
        "cypher": "MATCH (d:Disease {name: '肛乳头瘤'}) RETURN d.easy_get"
    },
    {
        "input": "肾结石预防方法有哪些",
        "cypher": "MATCH (n:Disease {name: '肾结石'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "子宫肥大有血块怎么办才合适？",
        "cypher": "MATCH (d:Disease {name: '子宫肥大'}) RETURN d.cure_way"
    },
    {
        "input": "肝癌的复发情况的可能性有多少？",
        "cypher": "MATCH (m:Disease {name:'肝癌'})-[:acompany_with]-(n:Disease) RETURN n.get_prob"
    },
    {
        "input": "膀胱癌能活多长时间",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'}) RETURN m.cure_lasttime"
    },
    {
        "input": "孕妇痔疮能吃阿奇霉素片吗",
        "cypher": "MATCH (d:Disease {name: '痔疮'}) RETURN d.easy_get"
    },
    {
        "input": "内痔怎么形成的原因？",
        "cypher": "MATCH (m:Disease {name: '内痔'}) RETURN m.cause"
    },
    {
        "input": "软组织肿瘤能缩小吗？",
        "cypher": "MATCH (d:Disease {name: '软组织肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "小孩六个月结膜炎怎么治疗",
        "cypher": "MATCH (d:Disease {name: '结膜炎'}) RETURN d.cure_way"
    },
    {
        "input": "颈动脉狭窄怎么治",
        "cypher": "MATCH (d:Disease {name: '颈动脉狭窄'}) RETURN d.cure_way"
    },
    {
        "input": "9个月大宝宝咳嗽的厉害需要住院吗",
        "cypher": "MATCH (v1:Disease {name: '咳嗽'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "吃什么食物可以有效恢复三叉神经痛",
        "cypher": "MATCH (v1:Disease {name: '三叉神经痛'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肝纤维化是怎么样治比较好？",
        "cypher": "MATCH (d:Disease {name: '肝纤维化'}) RETURN d.cure_way"
    },
    {
        "input": "这是什么类型的感冒",
        "cypher": "MATCH (m:Disease {name:'感冒'})<-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "神经炎该怎么治疗",
        "cypher": "MATCH (d:Disease {name: '神经炎'}) RETURN d.cure_way"
    },
    {
        "input": "染色体异常是吃药引起的吗",
        "cypher": "MATCH (m:Disease {name: '染色体异常'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "食管癌引发的原因有什么？",
        "cypher": "MATCH (m:Disease {name:'食管癌'})-[:acompany_with]-(n:Disease) RETURN n.cause"
    },
    {
        "input": "48岁高血压饮食注意什么",
        "cypher": "MATCH (v1:Disease {name: '高血压'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肺癌肝转移怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '肺癌肝转移'}) RETURN d.cure_way"
    },
    {
        "input": "宫颈癌这种病患术后饮食上注意什么",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "得了小儿肠套叠表现有哪些？",
        "cypher": "MATCH (m:Disease {name:'小儿肠套叠'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "妇科炎症有多少种",
        "cypher": "MATCH (v:Disease)-[e:belongs_to]->(v2:Department) WHERE v2.name = '妇科' AND v.name CONTAINS '炎症' RETURN COUNT(v)"
    },
    {
        "input": "88岁老人包皮水肿怎么办呢",
        "cypher": "MATCH (d:Disease {name: '包皮水肿'}) RETURN d.easy_get"
    },
    {
        "input": "我得的是不是急性淋巴结炎？",
        "cypher": "MATCH (m:Disease {name:'急性淋巴结炎'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "昏迷病人的饮食",
        "cypher": "MATCH (v1:Disease {name: '昏迷'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "患有呼吸疾病",
        "cypher": "MATCH (n:Disease {name: '呼吸疾病'})-[]->(m) RETURN m"
    },
    {
        "input": "应该注意哪些饮食问题?",
        "cypher": "MATCH (m:Disease {name:'高血压'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "治淋巴癌的药物有哪些？",
        "cypher": "MATCH (v1:Disease {name: '淋巴癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脂肪肝喝什么中药",
        "cypher": "MATCH (v1:Disease {name: '脂肪肝'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "做了卵巢囊肿手术后要注意什么",
        "cypher": "MATCH (n:Disease {name: '卵巢囊肿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "脾功能亢进怎么回事",
        "cypher": "MATCH (m:Disease {name:'脾功能亢进'}) RETURN m"
    },
    {
        "input": "痛风是一种风湿病吗",
        "cypher": "MATCH (m:Disease {name:'痛风'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "诊断慢性盆腔炎方法有哪些？",
        "cypher": "MATCH (m:Disease {name:'慢性盆腔炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "怀孕初期发现黄体囊肿怎么办",
        "cypher": "MATCH (d:Disease {name: '黄体囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "睾丸炎的预防可采用哪些方法？",
        "cypher": "MATCH (n:Disease {name: '睾丸炎'}) RETURN n.prevent"
    },
    {
        "input": "哪家治卵巢癌专业性比较强？",
        "cypher": "MATCH (n:Disease {name: '卵巢癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "一直就有癫痫病，有时候经常突如其来的就发作",
        "cypher": "MATCH (m:Disease {name: '癫痫'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "室友得了强直性脊柱炎这病的病因是什么呢？",
        "cypher": "MATCH (n:Disease {name: '强直性脊柱炎'}) RETURN n.cause"
    },
    {
        "input": "治脑积水有什么药物",
        "cypher": "MATCH (v1:Disease {name: '脑积水'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肠胃炎改如何调理呢",
        "cypher": "MATCH (m:Disease {name:'肠胃炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "男性不育症能救治吗？",
        "cypher": "MATCH (d:Disease {name: '男性不育症'}) RETURN d.cure_way"
    },
    {
        "input": "酒精中毒适合吃什么",
        "cypher": "MATCH (v1:Disease {name: '酒精中毒'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "新生儿窒息状况怎么样？",
        "cypher": "MATCH (m:Disease {name: '新生儿窒息'}) RETURN m.get_prob"
    },
    {
        "input": "哪做额叶癫痫手术做的好",
        "cypher": "MATCH (n:Disease {name: '额叶癫痫'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "我儿子胳膊骨折没长好伸不直怎么办",
        "cypher": "MATCH (d:Disease {name: '骨折'}) RETURN d.cure_way"
    },
    {
        "input": "怀孕流产术后致使血小板减少症怎么办？",
        "cypher": "MATCH (d:Disease {name: '血小板减少症'}) RETURN d.cure_way"
    },
    {
        "input": "子宫内膜癌要如何诊断会好些呢",
        "cypher": "MATCH (m:Disease {name:'子宫内膜癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "扩张型心肌病怎么治",
        "cypher": "MATCH (d:Disease {name: '扩张型心肌病'}) RETURN d.cure_way"
    },
    {
        "input": "孩子斜视能治吗？",
        "cypher": "MATCH (d:Disease {name: '斜视'}) RETURN d.cure_way"
    },
    {
        "input": "男人阳痿会影响老婆吗?",
        "cypher": "MATCH (m:Disease {name:'阳痿'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "对于那些微小的肝血管瘤如何抑制它的长大？",
        "cypher": "MATCH (d:Disease {name: '肝血管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "帮我判定我的孩子是不是患了淋巴炎",
        "cypher": "MATCH (m:Disease {name:'淋巴炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小儿发烧39才8个月吃什么退烧快？",
        "cypher": "MATCH (v1:Disease {name: '小儿发烧'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "软组织肉瘤晚期有什么有效方法可以控制病情发展",
        "cypher": "MATCH (d:Disease {name: '软组织肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "肠癌手术后吃什么对身体好",
        "cypher": "MATCH (v1:Disease {name: '肠癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "结肠炎这个病要怎么调养呢？",
        "cypher": "MATCH (m:Disease {name:'结肠炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "食管癌是什么？",
        "cypher": "MATCH (m:Disease {name:'食管癌'}) RETURN m.name, m.desc"
    },
    {
        "input": "心力衰竭怎么处理",
        "cypher": "MATCH (d:Disease {name: '心力衰竭'}) RETURN d.cure_way"
    },
    {
        "input": "面瘫激素有哪些？",
        "cypher": "MATCH (m:Disease {name:'面瘫'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "卵巢囊肿吃啥药好呢？",
        "cypher": "MATCH (n:Disease {name: '卵巢囊肿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "哪家医院治肾囊肿治得好",
        "cypher": "MATCH (d:Disease {name: '肾囊肿'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "冠心病最重要的危险因素是什么",
        "cypher": "MATCH (n:Disease {name:'冠心病'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "癫痫咋回事啊？",
        "cypher": "MATCH (m:Disease {name:'癫痫'}) RETURN m"
    },
    {
        "input": "输卵管积水对患者有什么危害",
        "cypher": "MATCH (d:Disease {name: '输卵管积水'}) RETURN d.easy_get"
    },
    {
        "input": "肺结节0.5cm是很大吗",
        "cypher": "MATCH (m:Disease {name: '肺结节'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "冠心病的注意事项有哪些",
        "cypher": "MATCH (n:Disease {name: '冠心病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "怎么预防膀胱癌的发生",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'}) RETURN m.prevent"
    },
    {
        "input": "什么叫附件炎",
        "cypher": "MATCH (m:Disease) WHERE m.name = '附件炎' RETURN m.desc"
    },
    {
        "input": "睾丸炎的具体病因是什么",
        "cypher": "MATCH (n:Disease {name: '睾丸炎'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "阳痿是由什么原因引起的？",
        "cypher": "MATCH (n:Disease {name: '阳痿'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "癫痫日常注意事项有什么",
        "cypher": "MATCH (m:Disease {name: '癫痫'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "神经系统副肿瘤综合征可以吃什么食物调节",
        "cypher": "MATCH (v1:Disease {name: '神经系统副肿瘤综合征'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "结肠癌不化疗会怎么样？",
        "cypher": "MATCH (m:Disease {name:'结肠癌'}) RETURN m.desc"
    },
    {
        "input": "膀胱炎饮食上吃什么好",
        "cypher": "MATCH (v1:Disease {name: '膀胱炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "经期能喝豆浆吗",
        "cypher": "MATCH (v1:Disease)-[e1:do_eat]->(v2:Food) WHERE v2.name = '豆浆' RETURN v1.name"
    },
    {
        "input": "慢性细菌性前列腺炎如何治疗好",
        "cypher": "MATCH (d:Disease {name: '慢性细菌性前列腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "月经不调症状",
        "cypher": "MATCH (v1:Disease {name: '月经不调'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "慢性肝炎需要注意什么?",
        "cypher": "MATCH (d:Disease {name: '慢性肝炎'}) RETURN d.easy_get"
    },
    {
        "input": "甲状腺肿瘤是恶性还是良性",
        "cypher": "MATCH (m:Disease {name:'甲状腺肿瘤'}) RETURN m.cause"
    },
    {
        "input": "手心脚心发热早泄滑精怎么办？",
        "cypher": "MATCH (m:Disease {name:'早泄'})-[:belongs_to]->(n:Department) RETURN m.cure_way,n.name"
    },
    {
        "input": "什么是急性心包炎？",
        "cypher": "MATCH (m:Disease {name:'急性心包炎'}) RETURN m"
    },
    {
        "input": "附睾炎要吃抗生素吗",
        "cypher": "MATCH (v1:Disease {name: '附睾炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "请问阳早泄是什么样的状况呢",
        "cypher": "MATCH (m:Disease) WHERE m.name = '早泄' RETURN m"
    },
    {
        "input": "17 个月婴儿，先天性心脏病，何时手术？",
        "cypher": "MATCH (d:Disease {name: '先天性心脏病'}) RETURN d.cure_way"
    },
    {
        "input": "通常情况下肺癌患者生活中吃什么比较好？",
        "cypher": "MATCH (m:Disease {name: '肺癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "胰腺癌白细胞低吃什么好？",
        "cypher": "MATCH (v1:Disease {name: '胰腺癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "男性尿道 医生诊断为前列腺炎，尿道炎",
        "cypher": "MATCH (d:Disease {name: '前列腺炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "尿布皮炎反复复发怎么办？",
        "cypher": "MATCH (d:Disease {name: '尿布皮炎'}) RETURN d.cure_way"
    },
    {
        "input": "脉管炎有什么有效的治疗方法吗？",
        "cypher": "MATCH (d:Disease {name: '脉管炎'}) RETURN d.cure_way"
    },
    {
        "input": "气胸病老是复发是怎么回事",
        "cypher": "MATCH (m:Disease {name: '气胸'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "引起性功能障碍的原因是哪些呢？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '性功能障碍' RETURN m.cause"
    },
    {
        "input": "我得了肾病综合征怎么治？",
        "cypher": "MATCH (d:Disease {name: '肾病综合征'}) RETURN d.cure_way"
    },
    {
        "input": "想知道得了炎性乳腺癌怎么治疗",
        "cypher": "MATCH (d:Disease {name: '炎性乳腺癌'}) RETURN d.cure_way"
    },
    {
        "input": "手足口病传染性在病程多长时间",
        "cypher": "MATCH (n:Disease {name: '手足口病'})-[:acompany_with]->(m:Disease) RETURN m.get_way"
    },
    {
        "input": "小孩扁桃体炎吞咽困难饮食该注意什么",
        "cypher": "MATCH (m:Disease {name:'扁桃体炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "心律失常持续多长时间？",
        "cypher": "MATCH (n:Disease {name: '心律失常'}) RETURN n.cure_lasttime"
    },
    {
        "input": "请问我是月经不调还是别的什么病",
        "cypher": "MATCH (m:Disease {name: '月经不调'}) RETURN m"
    },
    {
        "input": "视神经萎缩怎么引起的？",
        "cypher": "MATCH (m:Disease {name:'视神经萎缩'}) RETURN m.cause"
    },
    {
        "input": "结肠癌的晚期死亡率高吗",
        "cypher": "MATCH (m:Disease {name:'结肠癌'}) RETURN m.cured_prob"
    },
    {
        "input": "怎样预防肝炎呀?",
        "cypher": "MATCH (n:Disease {name: '肝炎'}) RETURN n.prevent"
    },
    {
        "input": "盆腔炎治好两个多月后会复发吗",
        "cypher": "MATCH (n:Disease {name: '盆腔炎'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "停经怎么回事",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'停经'}) RETURN m.name, r1.name"
    },
    {
        "input": "皮肤神经瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'皮肤神经瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "鳞状细胞癌怎么有效缓解？",
        "cypher": "MATCH (d:Disease {name: '鳞状细胞癌'}) RETURN d.cure_way"
    },
    {
        "input": "心肌炎自愈一周后又发烧了怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '心肌炎'}) RETURN d.cure_way"
    },
    {
        "input": "抽完胸腔积液后会影响工作吗",
        "cypher": "MATCH (d:Disease {name: '胸腔积液'}) RETURN d.cure_way"
    },
    {
        "input": "请问；心肌炎吃什么药好啊，我每天都会发作好几",
        "cypher": "MATCH (v1:Disease {name: '心肌炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "治疗子宫内膜异位的好方法有什么",
        "cypher": "MATCH (d:Disease {name: '子宫内膜异位'}) RETURN d.cure_way"
    },
    {
        "input": "淋巴癌检查项目需要仔细检查吗",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "变天就腰痛",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '腰痛' RETURN d.name"
    },
    {
        "input": "什么情况是得了口腔癌？",
        "cypher": "MATCH (m:Disease {name: '口腔癌'}) RETURN m"
    },
    {
        "input": "子宫肌瘤应该吃什么补品较为合适呢",
        "cypher": "MATCH (v1:Disease {name: '子宫肌瘤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "宫颈癌细胞病变严重吗",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "流行性感冒是什么引起的，会传染吗",
        "cypher": "MATCH (n:Disease {name: '流行性感冒'}) RETURN n.cause, n.get_way"
    },
    {
        "input": "外阴癌晚期应吃啥药？",
        "cypher": "MATCH (n:Disease {name: '外阴癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "为什么糖尿病患者的血糖会居高不下",
        "cypher": "MATCH (m:Disease {name: '糖尿病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "静脉曲张有什么临床症状",
        "cypher": "MATCH (m:Disease {name: '静脉曲张'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "结肠癌诊断时有什么特点?",
        "cypher": "MATCH (m:Disease {name: '结肠癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "肺气肿的治疗方法有哪些",
        "cypher": "MATCH (d:Disease {name: '肺气肿'}) RETURN d.cure_way"
    },
    {
        "input": "甲状腺癌转移的机率有多大",
        "cypher": "MATCH (m:Disease {name:'甲状腺癌'})-[:acompany_with]-(n:Disease) RETURN n.get_prob"
    },
    {
        "input": "吃什么食物能更加好地改善缺铁性贫血？",
        "cypher": "MATCH (v1:Disease {name: '缺铁性贫血'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "精液不液化会不育吗",
        "cypher": "MATCH (d:Disease {name: '精液不液化'}) RETURN d.easy_get"
    },
    {
        "input": "下丘脑错构瘤病因是什么？",
        "cypher": "MATCH (n:Disease {name: '下丘脑错构瘤'}) RETURN n.cause"
    },
    {
        "input": "北京哪个医院治附件炎好",
        "cypher": "MATCH (v1:Disease {name: '附件炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "乙肝有多大概率被传染？",
        "cypher": "MATCH (n:Disease {name: '乙肝'}) RETURN n.get_prob"
    },
    {
        "input": "预防乳腺增生吃什么好",
        "cypher": "MATCH (v1:Disease {name: '乳腺增生'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "体检发现自己患有乳腺癌想知道这个病严重吗？",
        "cypher": "MATCH (m:Disease {name: '乳腺癌'}) RETURN m.cure_lasttime, m.cured_prob"
    },
    {
        "input": "要怎么治疗胆管炎",
        "cypher": "MATCH (d:Disease {name: '胆管炎'}) RETURN d.cure_way"
    },
    {
        "input": "脑血栓形成挂号要挂哪个科室？",
        "cypher": "MATCH (v1:Disease {name: '脑血栓形成'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "常见的肝硬化死亡并发症有哪些",
        "cypher": "MATCH (m:Disease {name: '肝硬化'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "癫痫有没有遗传别人的？",
        "cypher": "MATCH (m:Disease {name:'癫痫'}) RETURN m.get_way"
    },
    {
        "input": "担心癌症这是怎么了啊",
        "cypher": "MATCH (m:Disease {name: '癌症'}) RETURN m"
    },
    {
        "input": "北京哪家医院治帕金森？",
        "cypher": "MATCH (v1:Disease {name: '帕金森病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "宫颈炎的饮食要注意哪些",
        "cypher": "MATCH (v1:Disease {name: '宫颈炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "娃娃的情况是性早熟吗？",
        "cypher": "MATCH (m:Disease {name: '性早熟'}) RETURN m"
    },
    {
        "input": "乳腺纤维腺瘤会复发的",
        "cypher": "MATCH (m1:Disease {name: '乳腺纤维腺瘤'})-[:acompany_with]-(m2:Disease) RETURN m2"
    },
    {
        "input": "单纯疱疹应该如何用药",
        "cypher": "MATCH (m:Disease {name:'单纯疱疹'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "我晚上经常遗精是怎么一回事呢",
        "cypher": "MATCH (m:Disease {name: '遗精'}) RETURN m"
    },
    {
        "input": "较严重的缺铁性贫血怎么办？",
        "cypher": "MATCH (d:Disease {name: '缺铁性贫血'}) RETURN d.cure_way"
    },
    {
        "input": "今天去检查又是疱疹性咽峡炎怎么办",
        "cypher": "MATCH (m:Disease {name: '疱疹性咽峡炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "一个月来三次月经是怎么回事啊",
        "cypher": "MATCH (m:Disease {name: '月经不调'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "强直性脊柱炎患者的求救",
        "cypher": "MATCH (d:Disease {name: '强直性脊柱炎'}) RETURN d.easy_get"
    },
    {
        "input": "肛瘘用什么药好？",
        "cypher": "MATCH (v1:Disease {name: '肛瘘'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "免疫性不孕的预防措施要怎么做",
        "cypher": "MATCH (n:Disease {name: '免疫性不孕'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肿瘤可以吃啥食物调节?",
        "cypher": "MATCH (v1:Disease {name: '肿瘤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "骨巨细胞瘤截肢后什么时候安假肢合适？",
        "cypher": "MATCH (d:Disease {name: '骨巨细胞瘤'}) RETURN d.cure_way"
    },
    {
        "input": "肠梗阻什么意思?",
        "cypher": "MATCH (m:Disease {name:'肠梗阻'}) RETURN m.name,m.desc"
    },
    {
        "input": "北京哪家的医院盆腔炎比较好？",
        "cypher": "MATCH (v1:Disease {name: '盆腔炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肺癌是传染病吗",
        "cypher": "MATCH (n:Disease {name: '肺癌'}) RETURN n.get_way"
    },
    {
        "input": "小儿肺炎是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'小儿肺炎'}) RETURN m"
    },
    {
        "input": "肛肠疾病应该怎样进行预防",
        "cypher": "MATCH (n:Disease {name: '肛肠疾病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "直肠癌去哪家缓解这情况都如何解决",
        "cypher": "MATCH (m:Disease {name: '直肠癌'})-[:belongs_to]->(n:Department) RETURN n.name AS 科室名称"
    },
    {
        "input": "什么是蛛网膜囊肿？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '蛛网膜囊肿' RETURN m.desc"
    },
    {
        "input": "邵阳性病检查医院",
        "cypher": "MATCH (m:Disease {name:'性病'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "治子宫脱垂有哪些治疗的方法？",
        "cypher": "MATCH (d:Disease {name: '子宫脱垂'}) RETURN d.cure_way"
    },
    {
        "input": "老年人适不适合动青光眼手术",
        "cypher": "MATCH (d:Disease {name: '青光眼'}) RETURN d.easy_get"
    },
    {
        "input": "胰腺炎吃的要注意什么",
        "cypher": "MATCH (m:Disease {name: '胰腺炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "乳腺增生该注意些什么？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "矮小症打激素多少钱",
        "cypher": "MATCH (m:Disease {name:'矮小症'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name, m.cost_money"
    },
    {
        "input": "肺癌手术费一般要准备多少？",
        "cypher": "MATCH (m:Disease {name:'肺癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "卵巢囊肿需要怎么去治疗效果会比较好点那？",
        "cypher": "MATCH (d:Disease {name: '卵巢囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "我爸爸去年脑瘤手术，病理星型细胞瘤3级，",
        "cypher": "MATCH (d:Disease { name: '脑瘤' })-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "什么叫植物神经功能紊乱？用哪些药治疗该病效果",
        "cypher": "MATCH (n:Disease {name: '植物神经功能紊乱'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "小儿脑瘫该如何来预防",
        "cypher": "MATCH (d:Disease {name: '小儿脑瘫'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "阴道出血不知道是流产还是来月经？",
        "cypher": "MATCH (m:Disease {name:'流产'})-[:has_symptom]->(n:Symptom {name:'阴道出血'}) RETURN m,n"
    },
    {
        "input": "骨癌转移到肺和脑上?",
        "cypher": "MATCH (m:Disease {name: '骨癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "避孕套会导致宫颈糜烂吗？",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})  RETURN m.cause"
    },
    {
        "input": "末梢神经炎是什么样的症状",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '末梢神经炎' RETURN n.name"
    },
    {
        "input": "47岁男性头疼，看哪个科",
        "cypher": "MATCH (v1:Disease)-[e1:belongs_to]->(v2:Department) WHERE v1.name CONTAINS '头疼' RETURN v2.name"
    },
    {
        "input": "内痔饮食要注意什么?",
        "cypher": "MATCH (v1:Disease {name: '内痔'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "本人三到四天都没有大便有时大便时都是很少",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '便秘' RETURN d.name"
    },
    {
        "input": "直肠癌中药处方有哪些",
        "cypher": "MATCH (v1:Disease {name: '直肠癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肾上腺肿瘤产生的因素或病因是什么",
        "cypher": "MATCH (n:Disease {name: '肾上腺肿瘤'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "怎么治卵巢炎",
        "cypher": "MATCH (d:Disease {name: '卵巢炎'}) RETURN d.cure_way"
    },
    {
        "input": "怀孕五个多月得了疥疮应该用什么好？",
        "cypher": "MATCH (d:Disease {name: '疥疮'}) RETURN d.cure_way"
    },
    {
        "input": "有哪些治肺心病的专科医院",
        "cypher": "MATCH (v1:Disease {name: '肺心病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "求助:帮我看看我得的是乙肝吗?",
        "cypher": "MATCH (m:Disease {name: '乙肝'}) RETURN m"
    },
    {
        "input": "垂体瘤晚期症状有哪些",
        "cypher": "MATCH (m:Disease {name: '垂体瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "乳头内陷对身体有影响吗",
        "cypher": "MATCH (v1:Disease {name: '乳头内陷'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "精囊炎疾病患者应当注意什么",
        "cypher": "MATCH (d:Disease {name: '精囊炎'}) RETURN d.easy_get"
    },
    {
        "input": "经常夜晚睡梦中性交遗精什么原因？",
        "cypher": "MATCH (m:Disease {name:'遗精'}) RETURN m.cause"
    },
    {
        "input": "什么是前列腺癌?",
        "cypher": "MATCH (m:Disease {name:'前列腺癌'}) RETURN m.name, m.desc"
    },
    {
        "input": "盆腔炎饮食应注意什么",
        "cypher": "MATCH (v1:Disease {name: '盆腔炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "如果得了乳腺增生能癌变吗？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "龟头炎该病是如何进行引来的呢",
        "cypher": "MATCH (m:Disease {name:'龟头炎'}) RETURN m.cause"
    },
    {
        "input": "癫痫患者如何预防症状恶化",
        "cypher": "MATCH (d:Disease {name: '癫痫'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "肝硬化的病理是什么呢？",
        "cypher": "MATCH (n:Disease) WHERE n.name = '肝硬化' RETURN n.desc"
    },
    {
        "input": "新生儿单纯疱疹病毒感染是怎么引起的？",
        "cypher": "MATCH (m:Disease {name:'新生儿单纯疱疹病毒感染'}) RETURN m.cause"
    },
    {
        "input": "脑积水的初期症状很害怕这个要怎么治疗啊？",
        "cypher": "MATCH (d:Disease {name: '脑积水'}) RETURN d.cure_way"
    },
    {
        "input": "结节病有办法治疗好吗？",
        "cypher": "MATCH (d:Disease {name: '结节病'}) RETURN d.cure_way"
    },
    {
        "input": "肾阴虚和肾阳虚什么区别",
        "cypher": "MATCH (m:Disease {name:'肾阴虚'})-[]->(n) RETURN m,n"
    },
    {
        "input": "怎样预防直肠癌呢",
        "cypher": "MATCH (m:Disease {name:'直肠癌'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "治疗下肢静脉曲张有哪些好办法",
        "cypher": "MATCH (d:Disease {name: '下肢静脉曲张'}) RETURN d.cure_way"
    },
    {
        "input": "如何杜绝肠套叠复发呢？",
        "cypher": "MATCH (m:Disease {name:'肠套叠'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "脑血栓治愈几率多大？？？",
        "cypher": "MATCH (m:Disease {name:'脑血栓'}) RETURN m.cured_prob"
    },
    {
        "input": "多发性硬化一定会复发吗？",
        "cypher": "MATCH (n:Disease {name: '多发性硬化'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "包皮经常发炎怎么回事",
        "cypher": "MATCH (m:Disease {name:'包皮炎'})<-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "肺大疱的治疗方法都有什么？",
        "cypher": "MATCH (d:Disease {name: '肺大疱'}) RETURN d.cure_way"
    },
    {
        "input": "神经胶质瘤胶质增生可以手术吗",
        "cypher": "MATCH (d:Disease {name: '神经胶质瘤'}) RETURN d.cure_way"
    },
    {
        "input": "肺结节吃哪些药",
        "cypher": "MATCH (v1:Disease {name: '肺结节'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "前庭大腺囊肿能不能药物治疗",
        "cypher": "MATCH (n:Disease {name: '前庭大腺囊肿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "直肠癌的定义是什么",
        "cypher": "MATCH (m:Disease {name:'直肠癌'}) RETURN m.desc"
    },
    {
        "input": "是什么诱因导致肺纤维化？",
        "cypher": "MATCH (n:Disease {name: '肺纤维化'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "喝酒酒精中毒后怎么紧急处理？",
        "cypher": "MATCH (d:Disease {name: '酒精中毒'}) RETURN d.cure_way"
    },
    {
        "input": "阳痿可以吃什么对恢复有所帮助",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "附件炎是什么疾病",
        "cypher": "MATCH (n:Disease {name:'附件炎'}) RETURN n"
    },
    {
        "input": "肾癌切除后的预防?",
        "cypher": "MATCH (n:Disease {name: '肾癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肺结核第三次复发是否容易治愈",
        "cypher": "MATCH (n:Disease {name: '肺结核'})-[:acompany_with*3]-(m:Disease) RETURN m.cured_prob"
    },
    {
        "input": "肺纤维化如何能确诊",
        "cypher": "MATCH (d:Disease {name: '肺纤维化'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "混合痔发病因素是哪些呢?",
        "cypher": "MATCH (m:Disease {name:'混合痔'}) RETURN m.cause"
    },
    {
        "input": "免疫性不孕征兆基本都会是什么",
        "cypher": "MATCH (m:Disease {name:'免疫性不孕'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "桂林医学院妇科",
        "cypher": "MATCH (v1:Disease)-[e1:belongs_to]->(v2:Department) WHERE v2.name = '妇科' RETURN v1"
    },
    {
        "input": "咨询脑囊虫病的治疗方案",
        "cypher": "MATCH (d:Disease {name: '脑囊虫病'}) RETURN d.cure_way"
    },
    {
        "input": "做心电图可以检查出心肌炎吗",
        "cypher": "MATCH (v1:Disease {name: '心肌炎'})-[:need_check]->(v2:Check {name: '心电图'}) RETURN v1, v2"
    },
    {
        "input": "早产儿宝宝不会抬头盖怎么治了？",
        "cypher": "MATCH (d:Disease {name: '早产儿'}) RETURN d.cure_way"
    },
    {
        "input": "突然口吃怎么办？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '口吃' RETURN m.name"
    },
    {
        "input": "睾丸扭转到底是什么",
        "cypher": "MATCH (m:Disease {name: '睾丸扭转'}) RETURN m"
    },
    {
        "input": "神经衰弱的主要临床表现是什么？",
        "cypher": "MATCH (n:Disease {name: '神经衰弱'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "请我急性白血病怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '急性白血病'}) RETURN d.cure_way"
    },
    {
        "input": "内痔费用多少在多少合适",
        "cypher": "MATCH (m:Disease {name:'内痔'})-[:belongs_to]->(n:Department) RETURN m.cost_money AS 费用,n.name AS 科室"
    }
]