[
    {
        "input": "包皮炎发病前的征兆有哪些",
        "cypher": "MATCH (m:Disease {name:'包皮炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "POEMS综合征急需救治",
        "cypher": "MATCH (d:Disease)-[r:belongs_to]->(dp:Department) WHERE d.name = 'POEMS综合征' RETURN dp.name"
    },
    {
        "input": "到底什么病才是真正的甲状腺肿瘤呀？",
        "cypher": "MATCH (m:Disease {name:'甲状腺肿瘤'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "我女人性冷淡有好几年了但我性欲强怎么办",
        "cypher": "MATCH (d:Disease {name: '性冷淡'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "舌癌术后康复吃什么",
        "cypher": "MATCH (v1:Disease {name: '舌癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "乙肝两对半正常要打疫苗吗？",
        "cypher": "MATCH (n:Disease {name: '乙肝'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "胰腺癌一次化疗多少钱？",
        "cypher": "MATCH (n:Disease {name: '胰腺癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "性功能障碍症状是什么呢?",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '性功能障碍' RETURN n.name"
    },
    {
        "input": "尿毒症晚期有治疗的方法吗",
        "cypher": "MATCH (d:Disease {name: '尿毒症'}) RETURN d.cure_way"
    },
    {
        "input": "得了胰腺癌不能吃哪些食物呢",
        "cypher": "MATCH (v1:Disease {name: '胰腺癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "甲状腺肿瘤吃什么药治疗",
        "cypher": "MATCH (m:Disease {name:'甲状腺肿瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "子宫内膜异位症是通过什么引起的？",
        "cypher": "MATCH (m:Disease {name:'子宫内膜异位症'})RETURN m.cause"
    },
    {
        "input": "腹泻的情况吃什么药比较好呢？",
        "cypher": "MATCH (v1:Disease {name: '腹泻'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "霉菌性阴道炎吃什么药能好呢",
        "cypher": "MATCH (m:Disease {name:'霉菌性阴道炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "小孩扁桃体炎不舒服有哪些饮食禁忌",
        "cypher": "MATCH (n:Disease {name: '扁桃体炎'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "睡觉时头痛怎么治疗呢",
        "cypher": "MATCH (d:Disease {name: '头痛'}) RETURN d.cure_way"
    },
    {
        "input": "年龄轻轻会不会闭经啊？",
        "cypher": "MATCH (d:Disease {name: '闭经'}) RETURN d.easy_get"
    },
    {
        "input": "疝气挂什么科室？",
        "cypher": "MATCH (v1:Disease {name: '疝气'})-[]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "前列腺癌改善的几率是多少",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'}) RETURN m.cured_prob"
    },
    {
        "input": "心脏瓣膜病内科治疗方法有什么？",
        "cypher": "MATCH (d:Disease {name: '心脏瓣膜病'}) RETURN d.cure_way"
    },
    {
        "input": "是不是冠心病方面的问题",
        "cypher": "MATCH (m:Disease {name:'冠心病'})-[:acompany_with]->(n:Disease) RETURN m,n"
    },
    {
        "input": "早产儿的喂养应注意什么",
        "cypher": "MATCH (n:Disease {name: '早产儿'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "月经不定期,不按时来,左小腹隐隐疼痛怎么办？",
        "cypher": "MATCH (m:Disease {name:'月经不调'})-[:belongs_to]->(b:Department {name:'妇科'}) RETURN m,b"
    },
    {
        "input": "原发性肝癌?",
        "cypher": "MATCH (m:Disease {name:'原发性肝癌'}) RETURN m"
    },
    {
        "input": "小脑萎缩现在不会下地走路站不起来要怎么办?",
        "cypher": "MATCH (d:Disease {name: '小脑萎缩'}) RETURN d.cure_way"
    },
    {
        "input": "先天性巨结肠怎么治疗比较好",
        "cypher": "MATCH (d:Disease {name: '先天性巨结肠'}) RETURN d.cure_way"
    },
    {
        "input": "平滑肌肉瘤怎么治疗",
        "cypher": "MATCH (d:Disease {name: '平滑肌肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "做爱没快感是不是因为神经系统出了问题啊？？",
        "cypher": "MATCH (m:Disease {name:'性欲减退'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "什么叫纤维肌痛综合症",
        "cypher": "MATCH (m:Disease {name: '纤维肌痛综合症'}) RETURN m"
    },
    {
        "input": "肝血管瘤主要有哪些发病因素？",
        "cypher": "MATCH (n:Disease {name: '肝血管瘤'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "子宫性不孕怎样治疗",
        "cypher": "MATCH (d:Disease {name: '子宫性不孕'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍治疗费用是多少",
        "cypher": "MATCH (n:Disease {name:'性功能障碍'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "请问属于乳腺癌中期还是晚期？该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '乳腺癌'}) RETURN d.cure_way"
    },
    {
        "input": "无精症可以改善吗？",
        "cypher": "MATCH (d:Disease {name: '无精症'}) RETURN d.cure_way"
    },
    {
        "input": "晚上总是遗精连续两天了怎么办？",
        "cypher": "MATCH (m:Disease {name:'遗精'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "那些药可以治疗支气管炎",
        "cypher": "MATCH (v1:Disease {name: '支气管炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "前列腺炎主要要注意什么",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'}) RETURN m.prevent"
    },
    {
        "input": "肛瘘的症状是什么",
        "cypher": "MATCH (m:Disease {name: '肛瘘'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "滴虫性阴道炎应该用什么药啊？",
        "cypher": "MATCH (m:Disease {name:'滴虫性阴道炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "如何辨别到底得的是不是小儿脑瘫呢？",
        "cypher": "MATCH (m:Disease {name:'小儿脑瘫'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "西药怎么治弱精",
        "cypher": "MATCH (v1:Disease {name: '弱精'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "男人出现早泄的问题严重吗",
        "cypher": "MATCH (m:Disease {name:'早泄'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "脂肪肝应该注意什么啊",
        "cypher": "MATCH (m:Disease {name: '脂肪肝'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "直肠癌咋预防好啊",
        "cypher": "MATCH (m:Disease {name: '直肠癌'}) RETURN m.prevent"
    },
    {
        "input": "单纯性肥胖要咋缓解减肥",
        "cypher": "MATCH (d:Disease {name: '单纯性肥胖'}) RETURN d.cure_way"
    },
    {
        "input": "包皮炎用康王几天就好吗",
        "cypher": "MATCH (d:Disease {name: '包皮炎'}) RETURN d.cure_way"
    },
    {
        "input": "治疗卵巢癌费用多少合适",
        "cypher": "MATCH (m:Disease {name:'卵巢癌'})-[:belongs_to]->(n:Department) RETURN m.cost_money"
    },
    {
        "input": "我母亲是嗜铬细胞瘤复发怎么办？",
        "cypher": "MATCH (m:Disease {name: '嗜铬细胞瘤'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "宫外孕是怎么发展的",
        "cypher": "MATCH (v1:Disease {name: '宫外孕'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "关于骨样骨瘤的治疗问题",
        "cypher": "MATCH (d:Disease {name: '骨样骨瘤'}) RETURN d.cure_way"
    },
    {
        "input": "甲亢病人不能吃什么食物",
        "cypher": "MATCH (v1:Disease {name:'甲亢'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "骨肿瘤有哪些分类？",
        "cypher": "MATCH (m:Disease {name: '骨肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "27岁男性的胃炎用药",
        "cypher": "MATCH (m:Disease {name: '胃炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "小儿癫痫去哪里治疗好？",
        "cypher": "MATCH (v1:Disease {name: '小儿癫痫'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "患有肝血管瘤需要注意什么？",
        "cypher": "MATCH (m:Disease {name: '肝血管瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "痛风病人的饮食起居有哪些注意的？",
        "cypher": "MATCH (m:Disease {name: '痛风'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "前列腺囊肿是啥病？",
        "cypher": "MATCH (n:Disease {name:'前列腺囊肿'}) RETURN n.name,n.desc"
    },
    {
        "input": "胎膜早破有哪有症状",
        "cypher": "MATCH (m:Disease {name:'胎膜早破'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脂肪瘤在饮食上有什么要注意的",
        "cypher": "MATCH (m:Disease {name: '脂肪瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "男   39      坐骨神经痛",
        "cypher": "MATCH (d:Disease {name: '坐骨神经痛'}) RETURN d.easy_get"
    },
    {
        "input": "小细胞肺癌放疗后食欲下降，吃什么药好",
        "cypher": "MATCH (v1:Disease {name: '小细胞肺癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "卵巢癌复查需要注意什么？",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "纵膈肿瘤出现在人体的什么部位",
        "cypher": "MATCH (m:Disease {name:'纵膈肿瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "请问大肠癌现状有哪些？",
        "cypher": "MATCH (m:Disease {name: '大肠癌'}) RETURN m.get_prob"
    },
    {
        "input": "3岁佝偻病的早期症状有什么？",
        "cypher": "MATCH (m:Disease {name:'佝偻病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "子宫内膜癌具体不能吃哪些食物",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "阳痿吃六味地黄丸有用吗",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:common_drug|:recommand_drug]->(v2:Drug {name: '六味地黄丸'}) RETURN v2"
    },
    {
        "input": "便秘情况很严重每次都哭的",
        "cypher": "MATCH (m:Disease {name: '便秘'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "到哪治疗睾丸炎比较妥当呢？",
        "cypher": "MATCH (n1:Disease {name: '睾丸炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "重度脂肪肝该如何更好的治疗",
        "cypher": "MATCH (d:Disease {name: '重度脂肪肝'}) RETURN d.cure_way"
    },
    {
        "input": "克罗恩病缓解到哪好会较不错些",
        "cypher": "MATCH (v1:Disease {name: '克罗恩病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "来月经使痔疮疼要吃什么药",
        "cypher": "MATCH (v1:Disease {name: '痔疮'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肺癌脑转移死前症状会不会很痛苦？",
        "cypher": "MATCH (m:Disease {name:'肺癌脑转移'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "慢性宫颈炎吃什么药比较好?",
        "cypher": "MATCH (v1:Disease {name: '慢性宫颈炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "结节性硬化症能要孩子吗",
        "cypher": "MATCH (d:Disease {name: '结节性硬化症'}) RETURN d.easy_get"
    },
    {
        "input": "孩子被确诊强直性脊柱炎如何治疗？",
        "cypher": "MATCH (d:Disease {name: '强直性脊柱炎'}) RETURN d.cure_way"
    },
    {
        "input": "胃溃疡怎么调理",
        "cypher": "MATCH (v1:Disease {name: '胃溃疡'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "小儿腹股沟斜疝怎么治疗?",
        "cypher": "MATCH (d:Disease {name: '小儿腹股沟斜疝'}) RETURN d.cure_way"
    },
    {
        "input": "血尿该如何治疗",
        "cypher": "MATCH (d:Disease {name: '血尿'}) RETURN d.cure_way"
    },
    {
        "input": "血栓性静脉炎用什么药好？",
        "cypher": "MATCH (m:Disease {name:'血栓性静脉炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "治白带异常去什么类型的医院",
        "cypher": "MATCH (v1:Disease {name: '白带异常'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "偶尔眩晕是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'眩晕'}) RETURN m"
    },
    {
        "input": "为何女性容易出现尿路感染",
        "cypher": "MATCH (d:Disease {name: '尿路感染'}) RETURN d.easy_get"
    },
    {
        "input": "绝经后子宫内膜癌应该注意些什么",
        "cypher": "MATCH (m:Disease {name:'绝经后子宫内膜癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "脂肪肝要怎么食疗",
        "cypher": "MATCH (v1:Disease {name: '脂肪肝'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "脑梗塞吃什么好呢？",
        "cypher": "MATCH (v1:Disease {name: '脑梗塞'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "淋巴瘤误诊的几率有多大",
        "cypher": "MATCH (n:Disease {name: '淋巴瘤'}) RETURN n.cured_prob"
    },
    {
        "input": "怎么判断是否得了宫颈癌病？",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "人最近瘦啦很多.對肝有什么影响.",
        "cypher": "MATCH (d:Disease)-[r:belongs_to]->(dp:Department) WHERE d.name CONTAINS '肝' AND dp.name CONTAINS '内科' RETURN d,r,dp"
    },
    {
        "input": "我想了解霉菌性阴道炎用什么药比较好？",
        "cypher": "MATCH (v1:Disease {name: '霉菌性阴道炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "现在手淫10多秒就射是不是早泄？",
        "cypher": "MATCH (m:Disease {name: '早泄'})-[:has_symptom]->(n:Symptom) RETURN m, n"
    },
    {
        "input": "尿崩症需要注意哪些饮食还有吃什么药可以治",
        "cypher": "MATCH (m:Disease {name:'尿崩症'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "癫痫不能吃些什么?",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "植物神经功能紊乱中药调理",
        "cypher": "MATCH (v1:Disease {name: '植物神经功能紊乱'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "颅咽管瘤是一个很严重得病吗？",
        "cypher": "MATCH (m:Disease {name:'颅咽管瘤'}) RETURN m.cause"
    },
    {
        "input": "绝经又来了是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'绝经'})<-[:acompany_with]->(n:Disease) RETURN m,n"
    },
    {
        "input": "宝宝出现贫血了怎么办?",
        "cypher": "MATCH (d:Disease {name: '贫血'}) RETURN d.cure_way"
    },
    {
        "input": "对于贫血怎么补",
        "cypher": "MATCH (d:Disease {name: '贫血'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "肠癌吃什么东西会好一些呢",
        "cypher": "MATCH (m:Disease {name: '肠癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "公历9月24（农历8月27）来的月经，如",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '月经不调' RETURN n.name"
    },
    {
        "input": "请问手淫过度会不会引发慢性肾炎？",
        "cypher": "MATCH (m:Disease {name:'慢性肾炎'}) RETURN m.cause"
    },
    {
        "input": "下面情况是不是患上了手足口病？",
        "cypher": "MATCH (m:Disease {name: '手足口病'})-[:has_symptom]->(n:Symptom) RETURN m, n"
    },
    {
        "input": "请问肝病吃什么食物好",
        "cypher": "MATCH (v1:Disease {name: '肝病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肝癌的发生机制是怎样的",
        "cypher": "MATCH (n:Disease {name: '肝癌'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "治疗胰腺癌的专科医院都在哪里",
        "cypher": "MATCH (v1:Disease {name: '胰腺癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "痔疮到底是什么样子的？",
        "cypher": "MATCH (m:Disease {name:'痔疮'}) RETURN m.name,m.desc"
    },
    {
        "input": "合肥哪家医院肛肠效果好？哪家医院更有名？",
        "cypher": "MATCH (v1:Disease {name: '肛肠疾病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "输尿管肿瘤该怎么治疗",
        "cypher": "MATCH (d:Disease {name: '输尿管肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "小儿发烧的针灸方法管用吗？",
        "cypher": "MATCH (d:Disease {name: '小儿发烧'}) RETURN d.cure_way"
    },
    {
        "input": "睾丸炎都有哪些症状呢",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '睾丸炎' RETURN n.name"
    },
    {
        "input": "缩窄性心包炎怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '缩窄性心包炎'}) RETURN d.cure_way"
    },
    {
        "input": "月经不调月经量很少是什么原因?",
        "cypher": "MATCH (m:Disease {name:'月经不调'})RETURN m.cause"
    },
    {
        "input": "请问哪家医院治疗肾结石较好",
        "cypher": "MATCH (v1:Disease {name: '肾结石'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "前列腺炎会造成早泄吗",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'})-[:acompany_with]-(n:Disease {name: '早泄'}) RETURN m, n"
    },
    {
        "input": "前列腺囊肿需要做哪些检查",
        "cypher": "MATCH (v1:Disease {name: '前列腺囊肿'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "勃起功能障碍能用食疗救治吗？",
        "cypher": "MATCH (v1:Disease {name: '勃起功能障碍'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "大动脉炎吃什么药物效果比较好",
        "cypher": "MATCH (v1:Disease {name: '大动脉炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "我想请教月经不调有关问题？",
        "cypher": "MATCH (m:Disease {name:'月经不调'})-[:belongs_to]->(b:Department) RETURN b.name AS name"
    },
    {
        "input": "治疗唇癌的费用高吗",
        "cypher": "MATCH (n:Disease {name: '唇癌'}) RETURN n.cost_money"
    },
    {
        "input": "子宫内膜炎原因有什么？",
        "cypher": "MATCH (m:Disease {name:'子宫内膜炎'})RETURN m.cause"
    },
    {
        "input": "面瘫多长时间恢复呢？",
        "cypher": "MATCH (m:Disease {name:'面瘫'}) RETURN m.cure_lasttime"
    },
    {
        "input": "胆囊炎治疗期间吃什么好",
        "cypher": "MATCH (v1:Disease {name: '胆囊炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾癌请问会遗传吗？",
        "cypher": "MATCH (m:Disease {name: '肾癌'}) RETURN m.cause"
    },
    {
        "input": "特发性震颤吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '特发性震颤'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "我是不是得了不孕不育",
        "cypher": "MATCH (d:Disease {name: '不孕不育'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "前列腺癌患者如何饮食",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "流行性出血热能治好吗",
        "cypher": "MATCH (d:Disease {name: '流行性出血热'}) RETURN d.cure_way"
    },
    {
        "input": "牙龈癌有什么症状？",
        "cypher": "MATCH (m:Disease {name:'牙龈癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肝硬化腹水如何治?",
        "cypher": "MATCH (d:Disease {name: '肝硬化腹水'}) RETURN d.cure_way"
    },
    {
        "input": "这个肿瘤的病能不能预防呢？",
        "cypher": "MATCH (n:Disease {name: '肿瘤'}) RETURN n.prevent"
    },
    {
        "input": "包皮过长有哪些不良影响？",
        "cypher": "MATCH (m:Disease {name:'包皮过长'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "性功能障碍主要是与什么有关系呢？",
        "cypher": "MATCH (m:Disease)-[r:belongs_to]->(n:Department) WHERE m.name = '性功能障碍' RETURN n.name"
    },
    {
        "input": "一个多月宝宝偶尔地会咳嗽怎么办",
        "cypher": "MATCH (m:Disease {name: '咳嗽'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "高血压的“六大危害”是什么",
        "cypher": "MATCH (m:Disease {name:'高血压'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "乳腺癌是否会出现转移呢",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "黑色素瘤手术前饮食方面怎么注意",
        "cypher": "MATCH (v1:Disease {name: '黑色素瘤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "习惯性流产的治疗喝什么药最管用呢，急。",
        "cypher": "MATCH (n:Disease {name: '习惯性流产'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "慢性盆腔炎生活和饮食上应该注意什么",
        "cypher": "MATCH (v1:Disease {name: '慢性盆腔炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "卵巢肿瘤手术后能怀孕吗",
        "cypher": "MATCH (d:Disease {name: '卵巢肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "多动症常见病因？",
        "cypher": "MATCH (m:Disease {name:'多动症'}) RETURN m.cause"
    },
    {
        "input": "甲亢会导致其他疾病吗",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "过敏性紫癜是怎么回事儿？血小板减少性紫癜",
        "cypher": "MATCH (m:Disease {name:'过敏性紫癜'}) RETURN m"
    },
    {
        "input": "小孩出生就有白血病是什么问题",
        "cypher": "MATCH (d:Disease {name: '白血病'}) RETURN d.easy_get"
    },
    {
        "input": "感冒去医院要挂号吗",
        "cypher": "MATCH (v1:Disease {name: '感冒'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "骨肉瘤有哪些最好的治疗办法",
        "cypher": "MATCH (d:Disease {name: '骨肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "外阴硬化性苔藓能用中医治疗吗",
        "cypher": "MATCH (d:Disease {name: '外阴硬化性苔藓'}) RETURN d.cure_way"
    },
    {
        "input": "治痔疮医院哪个好",
        "cypher": "MATCH (v1:Disease {name: '痔疮'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "急性淋巴细胞白血病治疗前注意事项有哪些？",
        "cypher": "MATCH (d:Disease {name: '急性淋巴细胞白血病'}) RETURN d.cure_way"
    },
    {
        "input": "请问有妇科病严重吗？",
        "cypher": "MATCH (n:Disease)-[r:belongs_to]->(m:Department) WHERE m.name = '妇科' RETURN n.desc"
    },
    {
        "input": "患不安腿综合征二十余年一到晚上双腿难受实在是",
        "cypher": "MATCH (d:Disease {name: '不安腿综合征'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "内痔医院到哪些去根治会好些呢",
        "cypher": "MATCH (v1:Disease {name: '内痔'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "腹痛腰痛有点发热怎么治疗好",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '腹痛' OR n.name = '腰痛' OR n.name = '发热' RETURN m.name, m.prevent"
    },
    {
        "input": "鳞状细胞癌相关抗原高会有啥影响？",
        "cypher": "MATCH (m:Disease {name: '鳞状细胞癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "十四男孩贫血吃哪些东西好",
        "cypher": "MATCH (v1:Disease {name: '贫血'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾癌怎么样会容易复发",
        "cypher": "MATCH (m:Disease {name: '肾癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "高血压肾病对身体的影响大吗",
        "cypher": "MATCH (m:Disease {name:'高血压肾病'}) RETURN m.desc"
    },
    {
        "input": "做了11个月的植物人苏醒的机率大吗？",
        "cypher": "MATCH (d:Disease {name: '植物人'}) RETURN d.cure_way"
    },
    {
        "input": "青光眼有什么症状？怎么治疗？",
        "cypher": "MATCH (m:Disease {name: '青光眼'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "直肠癌的发病情况有哪些",
        "cypher": "MATCH (m:Disease {name:'直肠癌'})-[:acompany_with]-(n:Disease) RETURN m.get_prob,n.name"
    },
    {
        "input": "胰腺癌晚期可以吃什么?",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "脚趾发麻是怎么回事呢",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'脚趾发麻'}) RETURN m.name"
    },
    {
        "input": "蛋白尿这个病是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'蛋白尿'}) RETURN m"
    },
    {
        "input": "我27岁，得了早泄。想问一下怎么治疗早泄?",
        "cypher": "MATCH (d:Disease {name: '早泄'}) RETURN d.cure_way"
    },
    {
        "input": "癫痫治疗好了，四年后又发作，咋治疗最好？",
        "cypher": "MATCH (d:Disease {name: '癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "肝性脑病能吃些什么食物？",
        "cypher": "MATCH (v1:Disease {name: '肝性脑病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "是痔疮引起的吗",
        "cypher": "MATCH (m:Disease {name: '痔疮'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "多发性骨髓瘤化疗后肺部感染",
        "cypher": "MATCH (d:Disease {name: '多发性骨髓瘤'}) RETURN d.cure_way"
    },
    {
        "input": "胃病厉害吗",
        "cypher": "MATCH (n:Disease {name:'胃病'}) RETURN n.cure_lasttime,n.cured_prob"
    },
    {
        "input": "甲状腺癌是什么因素形成的？",
        "cypher": "MATCH (n:Disease {name: '甲状腺癌'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "死精症是什么",
        "cypher": "MATCH (m:Disease) WHERE m.name = '死精症' RETURN m"
    },
    {
        "input": "肢端肥大症需要关注什么 ",
        "cypher": "MATCH (m:Disease {name:'肢端肥大症'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "看肌肉萎缩哪里好？",
        "cypher": "MATCH (m:Disease {name:'肌肉萎缩'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "宝宝呼吸道感染反复发烧有什么治疗方法",
        "cypher": "MATCH (d:Disease {name: '呼吸道感染'}) RETURN d.cure_way"
    },
    {
        "input": "癫痫会影响夫妻性生活吗",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:belongs_to]->(n:Department) RETURN m.cause,n.name"
    },
    {
        "input": "自然流产后同房怎么办",
        "cypher": "MATCH (d:Disease {name: '自然流产'}) RETURN d.cure_way"
    },
    {
        "input": "大夫，妇科炎症会有什么后果呢？",
        "cypher": "MATCH (m:Disease {name:'妇科炎症'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "手足口病会复发吗？",
        "cypher": "MATCH (m:Disease {name:'手足口病'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "一直有早泄、为什么医院检查不出来呢",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE n.name CONTAINS '早泄' RETURN m.name"
    },
    {
        "input": "去年宫颈癌筛查都没事，怎么今年筛查就不好了？",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:need_check]->(n:Check) RETURN m.get_prob"
    },
    {
        "input": "新生儿黄疸会不会对以后有什么影响？",
        "cypher": "MATCH (m:Disease {name: '新生儿黄疸'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "性欲亢进是怎么引起的！",
        "cypher": "MATCH (m:Disease {name:'性欲亢进'}) RETURN m.cause"
    },
    {
        "input": "阳痿怎么办吃什么好？",
        "cypher": "MATCH (m:Disease {name:'阳痿'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "慢性宫颈炎请问以下情况严重吗",
        "cypher": "MATCH (m:Disease {name:'慢性宫颈炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "包皮过长到底应该怎么治疗？",
        "cypher": "MATCH (m:Disease {name:'包皮过长'}) RETURN m.cure_way"
    },
    {
        "input": "请问做爱之前要吃什么要才可以做久些呢？",
        "cypher": "MATCH (v1:Disease)-[v2:do_eat]->(v3:Food) WHERE v1.name = '早泄' RETURN v3.name"
    },
    {
        "input": "关于膀胱癌的治疗方法和费用大概是多少呢？",
        "cypher": "MATCH (d:Disease {name: '膀胱癌'}) RETURN d.cure_way"
    },
    {
        "input": "颅脑损伤，蛛网膜下腔出血，经过治疗出院后能彻",
        "cypher": "MATCH (d:Disease {name: '颅脑损伤'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺一副中药多少钱？",
        "cypher": "MATCH (n:Disease {name:'前列腺炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name, m.price"
    },
    {
        "input": "风湿病包括哪些病种",
        "cypher": "MATCH (v1:Disease {name: '风湿病'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "孩子鸡眼怎么治疗比较快",
        "cypher": "MATCH (d:Disease {name: '鸡眼'}) RETURN d.cure_way"
    },
    {
        "input": "抑郁症遗传吗",
        "cypher": "MATCH (n:Disease {name:'抑郁症'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "胆囊癌早期术后化疗有哪些副作用",
        "cypher": "MATCH (d:Disease {name: '胆囊癌'}) RETURN d.cure_way"
    },
    {
        "input": "小儿支气管炎怎样治疗好？",
        "cypher": "MATCH (d:Disease {name: '小儿支气管炎'}) RETURN d.cure_way"
    },
    {
        "input": "胆囊炎晚期有什么症状",
        "cypher": "MATCH (m:Disease {name:'胆囊炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肠粘连哪里会疼？",
        "cypher": "MATCH (m:Disease {name:'肠粘连'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "精索静脉曲张的症状最明显的是什么？",
        "cypher": "MATCH (n:Disease {name: '精索静脉曲张'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "孩子去医院看说是支气管炎",
        "cypher": "MATCH (d:Disease {name: '支气管炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "1岁孩子咳嗽发烧是肺炎吗",
        "cypher": "MATCH (m:Disease {name:'肺炎'})-[:has_symptom]->(n:Symptom) WHERE n.name = '咳嗽' OR n.name = '发烧' RETURN m"
    },
    {
        "input": "支原体肺炎，并发心肌炎则么办？",
        "cypher": "MATCH (m:Disease {name:'支原体肺炎'})-[:acompany_with]->(n:Disease {name:'心肌炎'}) RETURN m.cureWay"
    },
    {
        "input": "宫颈炎诊断报告怎么样",
        "cypher": "MATCH (m:Disease {name:'宫颈炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "疝气会导致发烧吗？",
        "cypher": "MATCH (m:Disease {name:'疝气'})-[:has_symptom]->(n:Symptom) WHERE n.name = '发烧' RETURN m.name"
    },
    {
        "input": "尿路感染用什么药才能治愈",
        "cypher": "MATCH (m:Disease {name:'尿路感染'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "神经炎患者不能吃什么",
        "cypher": "MATCH (v1:Disease {name: '神经炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "最好的治疗肺癌的中医院都有哪家呢？",
        "cypher": "MATCH (n1:Disease {name: '肺癌'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "巧克力囊肿良性或恶性怎么判断",
        "cypher": "MATCH (m:Disease {name: '巧克力囊肿'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "月经不调吃调经促孕丸有用吗？",
        "cypher": "MATCH (n:Disease {name:'月经不调'})-[:common_drug|:recommand_drug]->(m:Drug {name:'调经促孕丸'}) RETURN m"
    },
    {
        "input": "糖尿病遗传的概率有多大",
        "cypher": "MATCH (n:Disease {name: '糖尿病'}) RETURN n.get_prob"
    },
    {
        "input": "甲壮腺结节；；有1。0‘’‘0。6大 也没觉",
        "cypher": "MATCH (d:Disease {name: '甲状腺结节'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "我家宝宝下嘴唇有血管瘤,之前打针治疗过,",
        "cypher": "MATCH (n:Disease {name: '血管瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "哮喘这样的疾病是怎样形成的那？",
        "cypher": "MATCH (n:Disease {name: '哮喘'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "性功能障碍会有哪些严重后果？",
        "cypher": "MATCH (m:Disease {name:'性功能障碍'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "败血症好不好治疗",
        "cypher": "MATCH (d:Disease {name: '败血症'}) RETURN d.cure_way"
    },
    {
        "input": "什么病会引起高血压这种病",
        "cypher": "MATCH (m:Disease {name: '高血压'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "治疗矮小症医院有哪些",
        "cypher": "MATCH (v1:Disease {name: '矮小症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "乳房纤维腺瘤术后复发多吗",
        "cypher": "MATCH (d:Disease {name: '乳房纤维腺瘤'}) RETURN d.cure_way"
    },
    {
        "input": "小儿肺炎怎么用药？",
        "cypher": "MATCH (m:Disease {name:'小儿肺炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "前列腺癌了吃什么好",
        "cypher": "MATCH (v1:Disease {name: '前列腺癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "前列腺炎严重吗？吃啥药管用？",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m.cure_lasttime,n.name"
    },
    {
        "input": "食管平滑肌瘤怎么吃药好",
        "cypher": "MATCH (m:Disease {name:'食管平滑肌瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "面瘫肌肉要注射哪些药针",
        "cypher": "MATCH (v1:Disease {name: '面瘫'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "小儿支气管哮喘的治疗有什么？办法",
        "cypher": "MATCH (d:Disease {name: '小儿支气管哮喘'}) RETURN d.cure_way"
    },
    {
        "input": "患卵巢癌会复发吗",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "我母亲的三高症的治疗方法都有什么",
        "cypher": "MATCH (d:Disease {name: '三高症'}) RETURN d.cure_way"
    },
    {
        "input": "白癜风病症可以咨询什么",
        "cypher": "MATCH (m:Disease {name: '白癜风'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "出现感冒流鼻涕适合吃什么好",
        "cypher": "MATCH (v1:Disease {name: '感冒'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "发现睾丸损伤咋治疗",
        "cypher": "MATCH (d:Disease {name: '睾丸损伤'}) RETURN d.cure_way"
    },
    {
        "input": "宫外孕农合可以报销吗？",
        "cypher": "MATCH (d:Disease {name: '宫外孕'}) RETURN d.easy_get"
    },
    {
        "input": "治小儿脑瘫的费用是多少？",
        "cypher": "MATCH (m:Disease {name:'小儿脑瘫'}) RETURN m.cost_money"
    },
    {
        "input": "请问医生如何防止乳腺癌？",
        "cypher": "MATCH (n1:Disease {name: '乳腺癌'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    }
]