[
    {
        "input": "什么贲门癌医院最好",
        "cypher": "MATCH (m:Disease {name:'贲门癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "前列腺癌的饮食禁忌有什么",
        "cypher": "MATCH (v1:Disease {name: '前列腺癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "前列腺脓肿症状有哪些",
        "cypher": "MATCH (m:Disease {name:'前列腺脓肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "重症肌无力到底是怎样的一种疾病那？",
        "cypher": "MATCH (m:Disease {name:'重症肌无力'}) RETURN m"
    },
    {
        "input": "精子畸形去哪里恢复",
        "cypher": "MATCH (v1:Disease {name: '精子畸形'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肺心病的症状特点都有什么？",
        "cypher": "MATCH (n:Disease {name: '肺心病'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "乳腺增生用什么药物治疗好的快？",
        "cypher": "MATCH (v1:Disease {name: '乳腺增生'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "治疗睾丸癌费用大概需多少",
        "cypher": "MATCH (m:Disease {name:'睾丸癌'})-[:belongs_to]->(n:Department) RETURN m.cost_money"
    },
    {
        "input": "治疗肝胆湿热用什么药物",
        "cypher": "MATCH (v1:Disease {name: '肝胆湿热'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "小孩怎样预防紫癜性肾炎呢？",
        "cypher": "MATCH (n:Disease {name: '紫癜性肾炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肝硬化的早期有什么全身表现",
        "cypher": "MATCH (n:Disease {name: '肝硬化'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "长了直肠息肉是不是很严重？",
        "cypher": "MATCH (m:Disease {name: '直肠息肉'}) RETURN m.cure_lasttime, m.cured_prob"
    },
    {
        "input": "病毒性肝炎应该如何治疗",
        "cypher": "MATCH (d:Disease {name: '病毒性肝炎'}) RETURN d.cure_way"
    },
    {
        "input": "医治肠系膜上动脉综合征费用一般是多少 ",
        "cypher": "MATCH (n:Disease {name: '肠系膜上动脉综合征'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "乳腺增生哪些疾病有关",
        "cypher": "MATCH (v1:Disease {name: '乳腺增生'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "宫外孕一直流血会不会引起血崩?",
        "cypher": "MATCH (m:Disease {name:'宫外孕'}) RETURN m.desc"
    },
    {
        "input": "食管囊肿怎么进行治疗",
        "cypher": "MATCH (d:Disease {name: '食管囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "看胃癌大概费用是多少",
        "cypher": "MATCH (m:Disease {name:'胃癌'}) RETURN m.cost_money"
    },
    {
        "input": "宫颈炎的危害都有哪些啊",
        "cypher": "MATCH (m:Disease {name:'宫颈炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "淋巴水肿症状有什么？",
        "cypher": "MATCH (m:Disease {name:'淋巴水肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "常备的肥厚型心肌病的药物有哪些",
        "cypher": "MATCH (v1:Disease {name: '肥厚型心肌病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "急性髓细胞白血病有治愈的可能吗",
        "cypher": "MATCH (d:Disease {name: '急性髓细胞白血病'}) RETURN d.cure_way"
    },
    {
        "input": "大量前列腺素引起痛经怎么办？",
        "cypher": "MATCH (m:Disease {name:'痛经'}) RETURN m.cure_way"
    },
    {
        "input": "婴儿患结肠炎严重吗，应该怎么做",
        "cypher": "MATCH (d:Disease {name: '结肠炎'}) RETURN d.easy_get"
    },
    {
        "input": "多动症多吃什么？",
        "cypher": "MATCH (m:Disease {name:'多动症'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "月经量少黑怎么回事？",
        "cypher": "MATCH (m:Disease {name:'月经量少'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "怀孕一个月怎么流产药？",
        "cypher": "MATCH (n:Disease {name: '流产'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "治疗结节性甲状腺肿最好的医院在哪里",
        "cypher": "MATCH (n:Disease {name: '结节性甲状腺肿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "青少年缺什么会有佝偻病",
        "cypher": "MATCH (d:Disease {name: '佝偻病'}) RETURN d.easy_get"
    },
    {
        "input": "脊髓损伤的并发症都有啥？",
        "cypher": "MATCH (v1:Disease {name: '脊髓损伤'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "请问鼻咽癌术后有并发症吗？",
        "cypher": "MATCH (n:Disease {name: '鼻咽癌'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "甲状腺结节食物禁忌有哪些？",
        "cypher": "MATCH (v1:Disease {name: '甲状腺结节'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "乳腺癌用什么中药好？",
        "cypher": "MATCH (m:Disease {name: '乳腺癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "肾功能衰竭治疗方法",
        "cypher": "MATCH (d:Disease {name: '肾功能衰竭'}) RETURN d.cure_way"
    },
    {
        "input": "胆囊结石吃什么药排石？",
        "cypher": "MATCH (m:Disease {name:'胆囊结石'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "去哪里治疗淋巴癌最好？",
        "cypher": "MATCH (n:Disease {name: '淋巴癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "膀胱癌会有哪些影响",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "脊髓空洞症小脑扁桃体下疝该怎么治疗会好呢？",
        "cypher": "MATCH (d:Disease {name: '脊髓空洞症'}) RETURN d.cure_way"
    },
    {
        "input": "耳鼻喉科门诊医院",
        "cypher": "MATCH (v:Disease)-[e:belongs_to]->(v2:Department) WHERE v2.name = '耳鼻喉科' RETURN v2"
    },
    {
        "input": "肾癌中晚期的饮食注意",
        "cypher": "MATCH (d:Disease {name: '肾癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "骨肿瘤的症状怎么治",
        "cypher": "MATCH (m:Disease {name:'骨肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "紫癜性肾炎的症状都有什么？",
        "cypher": "MATCH (m:Disease {name:'紫癜性肾炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "带状疱疹会引起严重并发症吗",
        "cypher": "MATCH (m:Disease {name:'带状疱疹'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "外阴脂肪瘤应该注意些什么？",
        "cypher": "MATCH (m:Disease {name:'外阴脂肪瘤'}) RETURN m.prevent"
    },
    {
        "input": "对于小儿心律失常头晕怎么治疗",
        "cypher": "MATCH (d:Disease {name: '小儿心律失常'}) RETURN d.cure_way"
    },
    {
        "input": "月经停了就到了老年了吗，该怎样保养",
        "cypher": "MATCH (n:Disease {name:'月经不调'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "我家宝宝属哪种婴幼儿腹泻",
        "cypher": "MATCH (d:Disease {name: '婴幼儿腹泻'}) RETURN d.easy_get"
    },
    {
        "input": "肠梗阻危害大不大",
        "cypher": "MATCH (m:Disease {name: '肠梗阻'}) RETURN m.cause"
    },
    {
        "input": "胆结石19mm算不算严重",
        "cypher": "MATCH (m:Disease {name: '胆结石'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "龟头炎为何会反复发作",
        "cypher": "MATCH (m:Disease {name:'龟头炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "多发性骨髓瘤晚期有什么症状呢",
        "cypher": "MATCH (m:Disease {name: '多发性骨髓瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肠癌术后查血?",
        "cypher": "MATCH (n:Disease {name: '肠癌'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "乳腺增生如何日常调理",
        "cypher": "MATCH (d:Disease {name: '乳腺增生'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "大腿上长了脂肪肉瘤",
        "cypher": "MATCH (m:Disease {name: '脂肪肉瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "酒精性肝炎会传染吗？",
        "cypher": "MATCH (v1:Disease {name: '酒精性肝炎'})-[]->(v2) RETURN v2.get_way"
    },
    {
        "input": "怎样才能确定是肾炎肾常规尿常规怎么了是肾炎",
        "cypher": "MATCH (m:Disease {name:'肾炎'})-[:need_check]->(n:Check {name:'尿常规'}) RETURN m.cause"
    },
    {
        "input": "白癜风有哪些危害？会对小孩产生严重影响吗",
        "cypher": "MATCH (m:Disease {name:'白癜风'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "前列腺癌吗还是前列腺炎怎么回事",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "平常生存中应当留意些什么",
        "cypher": "MATCH (v:Disease)-[e:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "请问直肠癌和直肠息肉有什么区别呢",
        "cypher": "MATCH (m:Disease {name:'直肠癌'})-[:acompany_with]-(n:Disease {name:'直肠息肉'}) RETURN m,n"
    },
    {
        "input": "脓疱疮的症状有哪些？",
        "cypher": "MATCH (v1:Disease {name: '脓疱疮'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "乳腺炎手术后吃什么补品好",
        "cypher": "MATCH (v1:Disease {name: '乳腺炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "什么是精索静脉曲啊张",
        "cypher": "MATCH (m:Disease {name: '精索静脉曲张'}) RETURN m"
    },
    {
        "input": "慢性子宫内膜炎该用啥药治？",
        "cypher": "MATCH (v1:Disease {name: '慢性子宫内膜炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "男人阳痿腰酸背痛该怎么办？",
        "cypher": "MATCH (m:Disease {name:'阳痿'})-[:belongs_to]->(n:Department) RETURN m.cure_way"
    },
    {
        "input": "药物可以治疗精液不液化吗",
        "cypher": "MATCH (v1:Disease {name: '精液不液化'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "粘液表皮样癌手术价格一般是多少 ",
        "cypher": "MATCH (m:Disease {name:'粘液表皮样癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "有一点脚气能打白破二联和A十C流脑疫苗吗",
        "cypher": "MATCH (d:Disease {name: '脚气'}) RETURN d.easy_get"
    },
    {
        "input": "请问治疗肥厚型心肌病的费用大概是多少？",
        "cypher": "MATCH (n:Disease {name: '肥厚型心肌病'}) RETURN n.cost_money"
    },
    {
        "input": "睾丸囊肿是什么疾病？",
        "cypher": "MATCH (n:Disease {name:'睾丸囊肿'}) RETURN n.name,n.desc"
    },
    {
        "input": "阴囊炎性癌的危害有哪些？",
        "cypher": "MATCH (n:Disease {name:'阴囊炎性癌'})-[]->(m) RETURN m.name"
    },
    {
        "input": "肾囊肿治疗医药费需要花费多少钱？",
        "cypher": "MATCH (n:Disease {name: '肾囊肿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "卵巢早衰都会有什么表现呢",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '卵巢早衰' RETURN m,n"
    },
    {
        "input": "骨癌治疗大概的费用是多少",
        "cypher": "MATCH (m:Disease {name:'骨癌'})-[:belongs_to]->(n:Department) RETURN m.cost_money"
    },
    {
        "input": "医生，我得了宫颈糜烂和盆腔积液如何用药？",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "怎样预防前列腺囊肿比较有效？",
        "cypher": "MATCH (n1:Disease {name: '前列腺囊肿'})-[:belongs_to]->(n2:Department) RETURN n1.prevent"
    },
    {
        "input": "非病毒性肝炎转氨酶202是什么原因？",
        "cypher": "MATCH (m:Disease {name:'肝炎'}) RETURN m.desc,m.cause"
    },
    {
        "input": "小儿缺铁性贫血怎么办",
        "cypher": "MATCH (d:Disease {name: '小儿缺铁性贫血'}) RETURN d.cure_way"
    },
    {
        "input": "小孩早产十天对其生长发育有没有影响",
        "cypher": "MATCH (v1:Disease {name: '早产'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肿瘤切除后如何复查",
        "cypher": "MATCH (v1:Disease {name: '肿瘤'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "智力低下怎么确认",
        "cypher": "MATCH (m:Disease {name: '智力低下'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "请问我是尿路感染还是前列腺炎？",
        "cypher": "MATCH (m:Disease {name: '尿路感染'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "痔疮的主要症状是坠胀吗",
        "cypher": "MATCH (n:Disease {name: '痔疮'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "不知道中医里是怎么定义癫痫的？",
        "cypher": "MATCH (n:Disease) WHERE n.name='癫痫' RETURN n.desc"
    },
    {
        "input": "这上面是什么药我今天去做检查医生说我轻微前列",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE m.name CONTAINS '前列腺' RETURN n.name, r, m.name"
    },
    {
        "input": "肾功能不全如何用药和治疗？",
        "cypher": "MATCH (m:Disease {name:'肾功能不全'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "脑瘤术后会癫痫吗？",
        "cypher": "MATCH (m:Disease {name:'脑瘤'})-[:acompany_with]-(n:Disease {name:'癫痫'}) RETURN m,n"
    },
    {
        "input": "小儿脑瘫是遗传才会得吗？",
        "cypher": "MATCH (n:Disease {name: '小儿脑瘫'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "胆囊炎通常该吃什么好？",
        "cypher": "MATCH (m:Disease {name:'胆囊炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "治疗子宫内膜炎怎么用药",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "宫颈糜烂是不是不孕？",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'}) RETURN m.desc"
    },
    {
        "input": "宝宝尿布疹用药油会管用吗？",
        "cypher": "MATCH (v1:Disease {name: '尿布疹'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "关于宫颈肥大是怎么引起的",
        "cypher": "MATCH (m:Disease {name:'宫颈肥大'}) RETURN m.cause"
    },
    {
        "input": "请问妇科炎症包括哪些病？",
        "cypher": "MATCH (n:Disease)-[r:belongs_to]->(m:Department {name:'妇科'}) RETURN n.name"
    },
    {
        "input": "膀胱肿瘤严重吗",
        "cypher": "MATCH (m:Disease {name:'膀胱肿瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "肺鼠疫的症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '肺鼠疫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "甲型肝炎病因是哪些 ",
        "cypher": "MATCH (n:Disease {name: '甲型肝炎'}) RETURN n.cause"
    },
    {
        "input": "心脏瓣膜病严重不严重啊？",
        "cypher": "MATCH (m:Disease {name:'心脏瓣膜病'}) RETURN m.cure_lasttime"
    },
    {
        "input": "精囊炎会导致精囊坏死吗",
        "cypher": "MATCH (m:Disease {name:'精囊炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "咳嗽白血球高到底是什么病？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '咳嗽' RETURN m.name"
    },
    {
        "input": "男士尿毒症同房有影响吗",
        "cypher": "MATCH (d:Disease {name: '尿毒症'}) RETURN d.easy_get"
    },
    {
        "input": "女 18岁，甲状腺疾病",
        "cypher": "MATCH (d:Disease {name: '甲状腺疾病'}) RETURN d.easy_get"
    },
    {
        "input": "小儿脑血管畸形吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '小儿脑血管畸形'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "好大夫您好",
        "cypher": "MATCH (d:Disease {name:'感冒'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "新生儿破伤风该怎样治疗？",
        "cypher": "MATCH (d:Disease {name: '新生儿破伤风'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍治疗费用多少",
        "cypher": "MATCH (v1:Disease {name: '性功能障碍'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "精索静脉曲张不能吃的东西",
        "cypher": "MATCH (v1:Disease {name: '精索静脉曲张'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "11岁手淫怎么就早熟了，不是说不会性早熟的吗",
        "cypher": "MATCH (m:Disease {name: '性早熟'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "慢性宫颈炎预防呢?",
        "cypher": "MATCH (n:Disease {name: '慢性宫颈炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "早泄是什么样的呢？",
        "cypher": "MATCH (m:Disease) WHERE m.name='早泄' RETURN m.desc"
    },
    {
        "input": "POEMS综合征急救措施",
        "cypher": "MATCH (v1:Disease {name: 'POEMS综合征'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "子宫肌瘤1.7厘米如今3厘米控制不长",
        "cypher": "MATCH (d:Disease {name: '子宫肌瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "神经性头痛有治吗",
        "cypher": "MATCH (d:Disease {name: '神经性头痛'}) RETURN d.cure_way"
    },
    {
        "input": "肾盂肾炎早期症状有什么",
        "cypher": "MATCH (v1:Disease {name: '肾盂肾炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "登革热病人需要怎么治疗呢？",
        "cypher": "MATCH (d:Disease {name: '登革热'}) RETURN d.cure_way"
    },
    {
        "input": "肝结石吃什么要号",
        "cypher": "MATCH (v1:Disease {name: '肝结石'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "妈妈常年有有精神病如何处理",
        "cypher": "MATCH (d:Disease {name: '精神病'}) RETURN d.cure_way"
    },
    {
        "input": "想咨询性功能障碍检查费用是多少？",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'})-[:need_check]->(m:Check) RETURN m.cost_money"
    },
    {
        "input": "我家的宝宝十九个月了晚上睡觉到一点来钟",
        "cypher": "MATCH (v1:Disease)-[v2:has_symptom]->(v3:Symptom) WHERE v3.name = '睡眠障碍' RETURN v1.name,v1.desc"
    },
    {
        "input": "舌癌的致病因素有哪些？",
        "cypher": "MATCH (n:Disease {name: '舌癌'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "脑瘤复发后遗症是什么?",
        "cypher": "MATCH (m:Disease {name:'脑瘤'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "多发性骨髓瘤医院和治疗方案有推荐吗？",
        "cypher": "MATCH (v1:Disease {name: '多发性骨髓瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name AS name"
    },
    {
        "input": "肺气肿在北京哪里治疗好",
        "cypher": "MATCH (v1:Disease {name: '肺气肿'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "败血症与菌血症的特征",
        "cypher": "MATCH (d:Disease {name:'败血症'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "老年人胸腔积液导致双腿浮肿",
        "cypher": "MATCH (d:Disease {name: '胸腔积液'}) RETURN d.easy_get"
    },
    {
        "input": "急性播散性脑脊髓炎导致炎症能治好吗?",
        "cypher": "MATCH (d:Disease {name: '急性播散性脑脊髓炎'}) RETURN d.cure_way"
    },
    {
        "input": "睾丸炎用什么药？..",
        "cypher": "MATCH (m:Disease {name:'睾丸炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "上颌窦癌晚期咋样治疗能减少痛苦",
        "cypher": "MATCH (d:Disease {name: '上颌窦癌'}) RETURN d.cure_way"
    },
    {
        "input": "盆腔脓肿患者应该注意什么事情？",
        "cypher": "MATCH (m:Disease {name:'盆腔脓肿'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "患者六十五岁 患有三年多肺部疾病 经常咳嗽有",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '咳嗽' RETURN d.name"
    },
    {
        "input": "呕吐怎么回事",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'呕吐'}) RETURN m.name AS diseaseName, n.name AS symptomName"
    },
    {
        "input": "脓胸的传播途径是什么",
        "cypher": "MATCH (v1:Disease {name: '脓胸'})-[]->(v2) RETURN v2.get_way"
    },
    {
        "input": "小儿腹股沟斜疝是长在哪里？",
        "cypher": "MATCH (m:Disease {name:'小儿腹股沟斜疝'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "小儿肥胖爱吃肉如何诊治",
        "cypher": "MATCH (m:Disease {name:'小儿肥胖'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "子宫纵隔如何治疗",
        "cypher": "MATCH (d:Disease {name: '子宫纵隔'}) RETURN d.cure_way"
    },
    {
        "input": "成都中科甲状腺什么医院看得好",
        "cypher": "MATCH (v1:Disease {name: '甲状腺疾病'})-[:belongs_to]->(v2:Department {name: '内分泌科'}) RETURN v2.name"
    },
    {
        "input": "便常规正常会不会有肠癌",
        "cypher": "MATCH (d:Disease {name: '肠癌'}) RETURN d.easy_get"
    },
    {
        "input": "前列腺增生要注意哪些食物",
        "cypher": "MATCH (v1:Disease {name: '前列腺增生'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "宫颈癌术放后3年复出B超需要查那些部位，",
        "cypher": "MATCH (v1:Disease {name: '宫颈癌'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "甲状腺癌术后两个月，吃左甲状腺素钠片两片",
        "cypher": "MATCH (n:Disease {name: '甲状腺癌'})-[:common_drug|:recommand_drug]->(m:Drug {name: '左甲状腺素钠片'}) RETURN m"
    },
    {
        "input": "你好，是阴茎癌患者，已转移腹股沟淋巴结，",
        "cypher": "MATCH (m:Disease {name: '阴茎癌'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "二尖瓣关闭不全是怎么了",
        "cypher": "MATCH (m:Disease {name: '二尖瓣关闭不全'}) RETURN m"
    },
    {
        "input": "被告知宫颈糜烂严重吗",
        "cypher": "MATCH (n:Disease {name: '宫颈糜烂'}) RETURN n.cure_lasttime"
    },
    {
        "input": "打过预防针的人还会得肝炎吗?",
        "cypher": "MATCH (n:Disease {name: '肝炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "脑外伤后遗症是什么呀？",
        "cypher": "MATCH (m:Disease {name:'脑外伤'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "外阴乳头状瘤是什么病症",
        "cypher": "MATCH (m:Disease {name: '外阴乳头状瘤'}) RETURN m"
    },
    {
        "input": "人为何会长肿瘤？",
        "cypher": "MATCH (m:Disease {name: '肿瘤'}) RETURN m.cause"
    },
    {
        "input": "小孩睾丸下面一碰就疼怎么办？",
        "cypher": "MATCH (m:Disease {name:'睾丸炎'})-[:belongs_to]->(n:Department) RETURN m.cure_way"
    },
    {
        "input": "治疗痛经吃什么东西好？",
        "cypher": "MATCH (v1:Disease {name: '痛经'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "帕金森病人应怎样正确联合用药",
        "cypher": "MATCH (v1:Disease {name: '帕金森病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "怎么做可以预防癫痫呀?",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "直肠炎的危害主要有哪些",
        "cypher": "MATCH (m:Disease {name:'直肠炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "这是普通的龟头炎还是疱疹呢？",
        "cypher": "MATCH (m:Disease {name: '龟头炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "前列腺增生大概需要的费用",
        "cypher": "MATCH (v1:Disease {name: '前列腺增生'}) RETURN v1.cost_money"
    },
    {
        "input": "什么是精索静脉曲张呢？",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '精索静脉曲张' RETURN m,r1,n"
    },
    {
        "input": "人参皂苷Rh2能有效治疗和控制胰腺癌吗？",
        "cypher": "MATCH (d:Disease {name: '胰腺癌'}) RETURN d.cure_way"
    },
    {
        "input": "预防脑梗塞的方法有哪些？",
        "cypher": "MATCH (m:Disease {name:'脑梗塞'}) RETURN m.prevent"
    },
    {
        "input": "阴道炎反复发做有半年多瘙痒怎么回事？",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})-[:has_symptom]->(n:Symptom {name:'瘙痒'}) RETURN m.cause"
    },
    {
        "input": "怎样确诊小儿肺炎会好处理些呢",
        "cypher": "MATCH (m:Disease {name:'小儿肺炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "疝气都有哪些症状啊？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '疝气' RETURN n.name"
    },
    {
        "input": "转移性肝癌吃饭会不会传染",
        "cypher": "MATCH (m:Disease {name: '转移性肝癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "主动脉夹层是一种怎样的疾病？",
        "cypher": "MATCH (n:Disease {name: '主动脉夹层'}) RETURN n"
    },
    {
        "input": "附睾炎一般要多久能才治愈？",
        "cypher": "MATCH (n:Disease {name: '附睾炎'}) RETURN n.cure_lasttime"
    },
    {
        "input": "特发性肺纤维化有什么危害",
        "cypher": "MATCH (m:Disease {name:'特发性肺纤维化'})RETURN m.desc"
    },
    {
        "input": "没有过性生活的女生会患上霉菌性阴道炎吗？",
        "cypher": "MATCH (d:Disease {name: '霉菌性阴道炎'}) RETURN d.easy_get"
    },
    {
        "input": "早泄与前列腺炎有关系吗？",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:acompany_with]-(v2:Disease {name: '前列腺炎'}) RETURN v1,v2"
    },
    {
        "input": "多发性大动脉炎的诊断",
        "cypher": "MATCH (m:Disease {name:'多发性大动脉炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "宫颈糜烂还分良性与恶性吗",
        "cypher": "MATCH (n:Disease {name: '宫颈糜烂'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "肾虚不治会怎么样",
        "cypher": "MATCH (m:Disease {name:'肾虚'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "宫颈息肉患者有哪些y应该用什么食疗方法",
        "cypher": "MATCH (v1:Disease {name: '宫颈息肉'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "盆腔肿瘤很大疼痛大小便困难怎么治",
        "cypher": "MATCH (d:Disease {name: '盆腔肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "怀孕3个月胚胎停育和RH阴性O型血有关吗",
        "cypher": "MATCH (d:Disease {name: '胚胎停育'}) RETURN d.easy_get"
    },
    {
        "input": "心脏病包括什么",
        "cypher": "MATCH (v1:Disease {name: '心脏病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "我的宝宝才15天，这几天有出现吐奶，打喷嚏，",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '吐奶' OR s.name = '打喷嚏' RETURN d"
    },
    {
        "input": "遇上原发性醛固酮增多症该怎么样处理？",
        "cypher": "MATCH (d:Disease {name: '原发性醛固酮增多症'}) RETURN d.cure_way"
    },
    {
        "input": "脑出血的诊断和治疗",
        "cypher": "MATCH (m:Disease {name:'脑出血'})-[:need_check]->(n:Check) RETURN m.name, n.name"
    },
    {
        "input": "乙状窦血栓性静脉炎如何预防？",
        "cypher": "MATCH (n:Disease {name: '乙状窦血栓性静脉炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肠易激综合征应该咋治？",
        "cypher": "MATCH (d:Disease {name: '肠易激综合征'}) RETURN d.cure_way"
    },
    {
        "input": "八个月的宝宝感冒流鼻涕怎么办？",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom {name:'流鼻涕'}) RETURN m.cureWay"
    },
    {
        "input": "我是老胃病，5.23号胃镜是胆汁返流性胃 十",
        "cypher": "MATCH (d:Disease {name: '胆汁返流性胃炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "不知道是不是盆腔炎",
        "cypher": "MATCH (m:Disease {name:'盆腔炎'}) RETURN m"
    },
    {
        "input": "人工流产后怎样进行补充营养？",
        "cypher": "MATCH (n:Disease {name: '人工流产'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "胆结石有没有生命危险",
        "cypher": "MATCH (m:Disease {name: '胆结石'}) RETURN m.get_prob"
    },
    {
        "input": "盆腔脓肿病人吃点什么东西可以缓解",
        "cypher": "MATCH (v1:Disease {name: '盆腔脓肿'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾囊肿中成药有效吗",
        "cypher": "MATCH (n:Disease {name: '肾囊肿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "胆结石和肾结石的区别是什么",
        "cypher": "MATCH (m:Disease {name:'胆结石'})-[:belongs_to]->(n:Department) RETURN m.name, n.name"
    },
    {
        "input": "新生儿肺炎住院回来了，不吃母乳怎么办？",
        "cypher": "MATCH (d:Disease {name: '新生儿肺炎'}) RETURN d.easy_get"
    },
    {
        "input": "血管周细胞瘤有什么办法治疗效果好",
        "cypher": "MATCH (d:Disease {name: '血管周细胞瘤'}) RETURN d.cure_way"
    },
    {
        "input": "小儿肠套叠嗜睡怎么办",
        "cypher": "MATCH (m:Disease {name:'小儿肠套叠'})-[:has_symptom]->(n:Symptom {name:'嗜睡'}) RETURN m.cureWay"
    },
    {
        "input": "面肌痉挛五年了要吃啥药物",
        "cypher": "MATCH (v1:Disease {name: '面肌痉挛'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "感冒时好时坏看了很多医生无效是为何",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "婴幼儿腹泻的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'婴幼儿腹泻'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "椎管内神经鞘瘤的症状有什么",
        "cypher": "MATCH (m:Disease {name:'椎管内神经鞘瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我的颈部长了个硬纤维瘤,术后一年左右复发请问",
        "cypher": "MATCH (d:Disease {name: '硬纤维瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "外阴瘙痒什么属于功能性症状呢",
        "cypher": "MATCH (n:Disease {name: '外阴瘙痒'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "怎么诊断黑色素瘤会好一点呢",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "草莓状血管瘤会遗传吗",
        "cypher": "MATCH (m:Disease {name:'草莓状血管瘤'})-[:acompany_with]-(n:Disease) RETURN n.get_prob"
    },
    {
        "input": "这种情况是脑炎吗?",
        "cypher": "MATCH (m:Disease {name:'脑炎'}) RETURN m"
    },
    {
        "input": "脂肪肉瘤的发病病因有哪些？",
        "cypher": "MATCH (n:Disease {name: '脂肪肉瘤'}) RETURN n.cause"
    },
    {
        "input": "做过垂体瘤手术孩子2周岁没来例假怎么回事",
        "cypher": "MATCH (m:Disease {name: '垂体瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "幼儿患有脑炎和癫痫吃什么药好",
        "cypher": "MATCH (m:Disease {name:'脑炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "这算抑郁症吗？",
        "cypher": "MATCH (m:Disease {name:'抑郁症'}) RETURN m"
    },
    {
        "input": "肾结石的石头掉到膀胱和尿道口",
        "cypher": "MATCH (d:Disease {name: '肾结石'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "食管癌怎么检测啊？？",
        "cypher": "MATCH (m:Disease {name:'食管癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "结核性脑膜炎的有哪些症状？",
        "cypher": "MATCH (m:Disease {name:'结核性脑膜炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "慢性子宫内膜炎生活中需要注意什么？",
        "cypher": "MATCH (n:Disease {name: '慢性子宫内膜炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "得了子宫内膜癌到哪儿治的好一些呢",
        "cypher": "MATCH (m:Disease {name:'子宫内膜癌'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "肾阳虚吃哪种药",
        "cypher": "MATCH (v1:Disease {name: '肾阳虚'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "如何保养心脏健康",
        "cypher": "MATCH (d:Disease)-[r:belongs_to]->(p:Department) WHERE d.name = '心脏病' RETURN p.name"
    },
    {
        "input": "别人咳嗽会传染给宝宝吗",
        "cypher": "MATCH (m:Disease {name: '咳嗽'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "有膀胱癌转移了还能活多长时间",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'})-[:acompany_with]->(n:Disease) RETURN n.cure_lasttime"
    },
    {
        "input": "多动症的治疗费要多少？",
        "cypher": "MATCH (n:Disease {name: '多动症'})-[:belongs_to]->(m:Department) RETURN m.cost_money"
    },
    {
        "input": "我以前在沈阳肛肠科检查的在..",
        "cypher": "MATCH (v1:Disease)-[v2:belongs_to]->(v3:Department) WHERE v3.name = '肛肠科' RETURN v1"
    },
    {
        "input": "性功能障碍的病能影响生育吗？",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "尿毒症死前征兆有哪些？",
        "cypher": "MATCH (m:Disease {name:'尿毒症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "有阴道炎要注意哪些？",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "生长痛还是关节炎，如何检查",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name = '生长痛' OR m.name = '关节炎' RETURN m.name, n.name"
    },
    {
        "input": "妊娠期糖尿病如何控制饮食",
        "cypher": "MATCH (d:Disease {name: '妊娠期糖尿病'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "鼻咽癌会有哪些影响",
        "cypher": "MATCH (m:Disease {name: '鼻咽癌'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "子宫肌瘤有七公分大最近小腹不适需要手术吗？",
        "cypher": "MATCH (d:Disease {name: '子宫肌瘤'}) RETURN d.cure_way"
    },
    {
        "input": "7个月婴儿，支气管炎，求中药方",
        "cypher": "MATCH (d:Disease {name: '支气管炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肺纤维化的发病原因有哪些",
        "cypher": "MATCH (n:Disease {name: '肺纤维化'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "肝肿瘤怎么确诊",
        "cypher": "MATCH (m:Disease {name: '肝肿瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "小脑扁桃体下疝",
        "cypher": "MATCH (n:Disease {name: '小脑扁桃体下疝'})-[]->(m) RETURN m"
    },
    {
        "input": "是否紫癜性肾炎呢？",
        "cypher": "MATCH (m:Disease {name:'紫癜性肾炎'}) RETURN m"
    },
    {
        "input": "慢性细菌性前列腺炎，尿频怎么办？",
        "cypher": "MATCH (n1:Disease {name: '慢性细菌性前列腺炎'})-[:has_symptom]->(n2:Symptom {name: '尿频'}) RETURN n1.cureWay"
    }
]