[
    {
        "input": "腺样体肥大的饮食该注意什么",
        "cypher": "MATCH (v1:Disease {name: '腺样体肥大'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "女人绝经后还可以手淫吗?",
        "cypher": "MATCH (d:Disease {name: '绝经'}) RETURN d.cure_way"
    },
    {
        "input": "16mm肾结石能治疗吗",
        "cypher": "MATCH (m:Disease {name:'肾结石'}) RETURN m.cure_way"
    },
    {
        "input": "男生早泄会有哪些方面引发的",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "附件炎和输卵管炎的症状是怎样的",
        "cypher": "MATCH (n:Disease {name: '附件炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "蛛网膜囊肿怎么治是最佳办法",
        "cypher": "MATCH (d:Disease {name: '蛛网膜囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "治疗宫颈癌要去市级医院做手术吗",
        "cypher": "MATCH (n:Disease {name: '宫颈癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "髓母细胞瘤经过手术.化疗.放疗后.还是转移了",
        "cypher": "MATCH (d:Disease {name: '髓母细胞瘤'}) RETURN d.cure_way"
    },
    {
        "input": "支引气管扩张发烧引起肺炎怎么办",
        "cypher": "MATCH (m:Disease {name:'支气管扩张'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "做检查出血了.",
        "cypher": "MATCH (v1:Disease)-[v2:need_check]->(v3:Check) WHERE v3.name CONTAINS '出血' RETURN v1.name,v3.name"
    },
    {
        "input": "老年性哮喘有什么症状?",
        "cypher": "MATCH (m:Disease {name:'老年性哮喘'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "黑色素瘤会长在哪些地方",
        "cypher": "MATCH (m:Disease {name: '黑色素瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "膀胱癌的症状有哪些",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "口腔血管瘤的治疗方法",
        "cypher": "MATCH (d:Disease {name: '口腔血管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "腹膜炎治疗的最好方法？",
        "cypher": "MATCH (d:Disease {name: '腹膜炎'}) RETURN d.cure_way"
    },
    {
        "input": "请问确诊一下是不是肺癌？",
        "cypher": "MATCH (m:Disease {name: '肺癌'}) RETURN m"
    },
    {
        "input": "矮小症打生长激素后要不要复查？",
        "cypher": "MATCH (m:Disease {name: '矮小症'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "得了甲亢从药后就频繁抽筋怎么回事",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "肝硬化腹水要住院吗",
        "cypher": "MATCH (d:Disease {name: '肝硬化腹水'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "外伤性乳糜胸吃什么比较有效?",
        "cypher": "MATCH (v1:Disease {name: '外伤性乳糜胸'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "宫外孕阴道出血时早孕试纸能否验出怀孕呢？",
        "cypher": "MATCH (d:Disease {name: '宫外孕'}) RETURN d.cure_way"
    },
    {
        "input": "从报告单怎么看是肺炎还是肺癌",
        "cypher": "MATCH (m:Check)-[r:need_check]-(d:Disease) WHERE m.name = '报告单' AND d.name = '肺炎' OR d.name = '肺癌' RETURN d.name"
    },
    {
        "input": "该怎样缓解结节性红斑？",
        "cypher": "MATCH (d:Disease {name: '结节性红斑'}) RETURN d.cure_way"
    },
    {
        "input": "重症肌无力症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'重症肌无力'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "精索静脉曲张是不是做动作才检查的出来？",
        "cypher": "MATCH (n:Disease {name:'精索静脉曲张'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "早产儿面临最严重的问题是什么？",
        "cypher": "MATCH (m:Disease {name: '早产儿'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "外阴瘙痒究竟是阴道炎吗",
        "cypher": "MATCH (m:Disease {name:'外阴瘙痒'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "白带都有哪些种类",
        "cypher": "MATCH (v:Disease)-[e:has_symptom]->(v1:Symptom) WHERE v1.name CONTAINS '白带' RETURN DISTINCT v1.name"
    },
    {
        "input": "治疗痔疮什么药较好",
        "cypher": "MATCH (n:Disease {name: '痔疮'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "请问早泄的表现出和原因是什么呢",
        "cypher": "MATCH (m:Disease {name:'早泄'})-[:has_symptom]->(n:Symptom) RETURN m.desc, n"
    },
    {
        "input": "乳腺癌发生的原因是啥啊",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'}) RETURN m.cause"
    },
    {
        "input": "淋巴结有什么分别",
        "cypher": "MATCH (v:Disease)-[e:has_symptom]->(v2:Symptom) WHERE v2.name = '淋巴结肿大' RETURN v.name"
    },
    {
        "input": "如何才能更好的预防流行性感冒",
        "cypher": "MATCH (n:Disease {name: '流行性感冒'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "外阴瘙痒治疗要做哪些检查",
        "cypher": "MATCH (v1:Disease {name: '外阴瘙痒'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "脑性瘫痪能遗传吗？",
        "cypher": "MATCH (m:Disease {name:'脑性瘫痪'}) RETURN m.cause"
    },
    {
        "input": "如何鉴别泪道阻塞？",
        "cypher": "MATCH (m:Disease {name:'泪道阻塞'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "我老公是无精症怎么回事呢",
        "cypher": "MATCH (m:Disease {name:'无精症'}) RETURN m"
    },
    {
        "input": "想知道精索静脉曲张有哪些症状",
        "cypher": "MATCH (v1:Disease {name: '精索静脉曲张'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "月经期间吃什么活血比较好",
        "cypher": "MATCH (v1:Disease {name: '月经不调'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "包皮炎用什么药如何机智处理合适",
        "cypher": "MATCH (m:Disease {name:'包皮炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "急性乳腺炎多发于哪类人群",
        "cypher": "MATCH (d:Disease {name: '急性乳腺炎'}) RETURN d.easy_get"
    },
    {
        "input": "肾脓肿怎么治，吃什么药",
        "cypher": "MATCH (v1:Disease {name: '肾脓肿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "非霍奇金淋巴瘤患者不能吃什么",
        "cypher": "MATCH (v1:Disease {name: '非霍奇金淋巴瘤'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "脑炎后遗症是什么症状？",
        "cypher": "MATCH (m:Disease {name: '脑炎'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "肺癌临床实验靠谱吗",
        "cypher": "MATCH (n:Disease {name: '肺癌'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "如何预防患上肛周脓肿",
        "cypher": "MATCH (d:Disease {name: '肛周脓肿'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "得了静脉炎会出现什么样的症状啊？",
        "cypher": "MATCH (m:Disease {name:'静脉炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "白带异常饮食需要注意哪些？",
        "cypher": "MATCH (v1:Disease {name: '白带异常'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "医治骨髓炎有特效药吗",
        "cypher": "MATCH (m:Disease {name:'骨髓炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "宝宝7个多月大了前段时间患有手足口病到住院治",
        "cypher": "MATCH (d:Disease {name: '手足口病'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "恶性淋巴瘤在肝脏上该会如何诊断呢",
        "cypher": "MATCH (m:Disease {name:'恶性淋巴瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "前列腺癌较易发生什么部位的转移?",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "胆囊炎恶心如何办",
        "cypher": "MATCH (m:Disease {name:'胆囊炎'})-[:has_symptom]->(n:Symptom {name:'恶心'}) RETURN m.cureWay"
    },
    {
        "input": "胃出血有哪些典型症状",
        "cypher": "MATCH (m:Disease {name:'胃出血'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "流产的预防方法是什么呢？",
        "cypher": "MATCH (n:Disease {name: '流产'}) RETURN n.prevent"
    },
    {
        "input": "小儿过敏性紫癜有什么疗法？",
        "cypher": "MATCH (d:Disease {name: '小儿过敏性紫癜'}) RETURN d.cure_way"
    },
    {
        "input": "腮腺恶性肿瘤如何医治",
        "cypher": "MATCH (d:Disease {name: '腮腺恶性肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "新生儿有扁桃体吗 ",
        "cypher": "MATCH (m:Disease{name:'扁桃体炎'})-[:belongs_to]->(n:Department) RETURN m.crowd"
    },
    {
        "input": "检查贫血方法",
        "cypher": "MATCH (v1:Disease {name: '贫血'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "前列腺增生检查",
        "cypher": "MATCH (v1:Disease {name: '前列腺增生'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "怎样判断甲亢还是产后甲状腺炎？",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "什么时候治疗痤疮比较好",
        "cypher": "MATCH (d:Disease {name: '痤疮'}) RETURN d.cure_way"
    },
    {
        "input": "包茎手术哪个医院做的好？",
        "cypher": "MATCH (n:Disease {name:'包茎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "包皮龟头炎的检查及治疗？",
        "cypher": "MATCH (m:Disease {name:'包皮龟头炎'})-[:need_check]->(n:Check) RETURN m.name,n.name"
    },
    {
        "input": "肠套叠手术后会复发吗？",
        "cypher": "MATCH (n:Disease {name: '肠套叠'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "怎么能知道自己有没有妇科炎症？",
        "cypher": "MATCH (m:Disease {name:'妇科炎症'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "胆管结石该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '胆管结石'}) RETURN d.cure_way"
    },
    {
        "input": "肺癌晚期是保守治疗痛苦少还是手术好一些？",
        "cypher": "MATCH (d:Disease {name: '肺癌'}) RETURN d.cure_way"
    },
    {
        "input": "脑瘤通常会有哪些影响呢",
        "cypher": "MATCH (m:Disease {name:'脑瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "子宫肥大要紧么",
        "cypher": "MATCH (m:Disease {name:'子宫肥大'}) RETURN m.get_prob"
    },
    {
        "input": "针对小儿感冒咳嗽流鼻涕怎么处理好？",
        "cypher": "MATCH (d:Disease {name: '小儿感冒'}) RETURN d.cure_way"
    },
    {
        "input": "小孩子疱疹性咽峡炎要如何治疗",
        "cypher": "MATCH (d:Disease {name: '疱疹性咽峡炎'}) RETURN d.cure_way"
    },
    {
        "input": "反流性食管炎能痊愈吗？",
        "cypher": "MATCH (n:Disease {name: '反流性食管炎'}) RETURN n.cured_prob"
    },
    {
        "input": "月经量少是正常现象吗",
        "cypher": "MATCH (m:Disease)-[:has_symptom]->(s:Symptom {name:'月经量少'}) RETURN m.name AS diseaseName, m.desc AS diseaseDesc"
    },
    {
        "input": "漏斗胸矫正怎么做呢？",
        "cypher": "MATCH (d:Disease {name: '漏斗胸'}) RETURN d.cure_way"
    },
    {
        "input": "宝宝两个多月了现在有点鼻塞小咳要如何解决",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '鼻塞' OR s.name = '小咳' RETURN d.name, d.desc, d.prevent, d.cause"
    },
    {
        "input": "龟头炎费用究竟是多少",
        "cypher": "MATCH (m:Disease {name:'龟头炎'}) RETURN m.cost_money"
    },
    {
        "input": "智力低下要注意什么",
        "cypher": "MATCH (m:Disease {name:'智力低下'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "女人为何会得乳腺疾病？",
        "cypher": "MATCH (d:Disease {name: '乳腺疾病'}) RETURN d.easy_get"
    },
    {
        "input": "哪里能治附件炎这种疾病呢",
        "cypher": "MATCH (n1:Disease {name: '附件炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "请问治疗包皮过长哪家医院好？",
        "cypher": "MATCH (n:Disease {name: '包皮过长'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "绒毛膜癌是不是转移了？",
        "cypher": "MATCH (m:Disease {name:'绒毛膜癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "纵隔肿瘤手术后病人饮食需要注意什么吗?",
        "cypher": "MATCH (n:Disease {name: '纵隔肿瘤'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "小孩子多大会走路？",
        "cypher": "MATCH (d:Disease {name: '小儿多动症'}) RETURN d.easy_get"
    },
    {
        "input": "骨髓纤维化，皮下有出血哪家医院治疗好",
        "cypher": "MATCH (d:Disease {name: '骨髓纤维化'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "心脑血管疾病发病时如何治疗",
        "cypher": "MATCH (d:Disease {name: '心脑血管疾病'}) RETURN d.cure_way"
    },
    {
        "input": "川崎病还复发吗",
        "cypher": "MATCH (v1:Disease {name: '川崎病'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "自发性气胸是什么",
        "cypher": "MATCH (m:Disease {name: '自发性气胸'}) RETURN m"
    },
    {
        "input": "血吸虫病治疗要注意什么",
        "cypher": "MATCH (d:Disease {name: '血吸虫病'}) RETURN d.cure_way"
    },
    {
        "input": "如何知道心脏好不好",
        "cypher": "MATCH (v1:Disease {name: '心脏病'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "半乳糖血症是什么病症",
        "cypher": "MATCH (m:Disease {name:'半乳糖血症'}) RETURN m.name, m.desc"
    },
    {
        "input": "肺癌如何自己自测",
        "cypher": "MATCH (d:Disease {name: '肺癌'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "小儿肥厚型心肌病是怎么回事",
        "cypher": "MATCH (m:Disease {name: '小儿肥厚型心肌病'}) RETURN m"
    },
    {
        "input": "八个月宝宝肺炎不喝奶粉如何解决",
        "cypher": "MATCH (d:Disease {name: '肺炎'}) RETURN d.easy_get"
    },
    {
        "input": "宫颈腺癌去什么医院治疗好",
        "cypher": "MATCH (v1:Disease {name: '宫颈腺癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "3岁小儿便秘，吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '便秘'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "通常情况下是怎么样诊断的混合痔",
        "cypher": "MATCH (m:Disease {name:'混合痔'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "请问医生青少年癫痫有什么常见的症状呢？",
        "cypher": "MATCH (n1:Disease {name: '青少年癫痫'})-[:has_symptom]->(n2:Symptom) RETURN n2.name"
    },
    {
        "input": "家族中有弱智会隔代遗传吗",
        "cypher": "MATCH (n:Disease {name: '弱智'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "小儿肺炎吃什么消炎药效果好",
        "cypher": "MATCH (v1:Disease {name: '小儿肺炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "老烂腿的预防方法有哪些呢",
        "cypher": "MATCH (n:Disease {name: '老烂腿'}) RETURN n.prevent"
    },
    {
        "input": "胆结石该如何用药",
        "cypher": "MATCH (d:Disease {name: '胆结石'})-[:common_drug|:recommand_drug]->(drug:Drug) RETURN drug.name"
    },
    {
        "input": "喉癌易造成什么影响",
        "cypher": "MATCH (m:Disease {name: '喉癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "治霉菌性外阴炎较有效的治疗办法?",
        "cypher": "MATCH (d:Disease {name: '霉菌性外阴炎'}) RETURN d.cure_way"
    },
    {
        "input": "6岁小孩大便有虫子很小细该如何治疗？",
        "cypher": "MATCH (d:Disease {name: '蛔虫病'}) RETURN d.cure_way"
    },
    {
        "input": "请问什么叫脑梗塞?",
        "cypher": "MATCH (m:Disease {name: '脑梗塞'}) RETURN m.desc"
    },
    {
        "input": "感冒对身体有益吗",
        "cypher": "MATCH (m:Disease {name:'感冒'}) RETURN m.desc"
    },
    {
        "input": "肾移植后有什么不能吃的",
        "cypher": "MATCH (v1:Disease {name: '肾移植'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "多动症不能忽视的危害",
        "cypher": "MATCH (m:Disease {name:'多动症'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "如何判断癌症指数的数值",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:acompany_with]-(n:Disease) RETURN n.get_prob"
    },
    {
        "input": "做了疝气手术的患者在生活当中注意什么那？",
        "cypher": "MATCH (d:Disease {name: '疝气'}) RETURN d.easy_get"
    },
    {
        "input": "脑梗塞吃这些药可以吗?",
        "cypher": "MATCH (v1:Disease {name: '脑梗塞'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "胰腺癌吃什么药效果更好一些？",
        "cypher": "MATCH (n:Disease {name: '胰腺癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "宫颈炎疾病的病因有几种？",
        "cypher": "MATCH (n:Disease {name: '宫颈炎'}) RETURN n.cause"
    },
    {
        "input": "偶尔有些便血如何避免长痔疮？",
        "cypher": "MATCH (m:Disease {name:'痔疮'}) RETURN m.prevent"
    },
    {
        "input": "有乳腺肿瘤怎么弄好？",
        "cypher": "MATCH (d:Disease {name: '乳腺肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "浸润性乳腺癌严重到什么程度",
        "cypher": "MATCH (m:Disease {name:'浸润性乳腺癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "中度脂肪肝有什么具体症状",
        "cypher": "MATCH (m:Disease {name: '中度脂肪肝'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "卵巢癌的价格大概多少钱",
        "cypher": "MATCH (m:Disease {name:'卵巢癌'}) RETURN m.cost_money"
    },
    {
        "input": "我爸70岁脑梗死，在医院住21天出院，现在左",
        "cypher": "MATCH (d:Disease {name: '脑梗死'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "糖尿病治疗与偶那些好的方法呢因该怎么治疗好？",
        "cypher": "MATCH (d:Disease {name: '糖尿病'}) RETURN d.cure_way"
    },
    {
        "input": "肠梗阻病严重不？",
        "cypher": "MATCH (m:Disease {name:'肠梗阻'}) RETURN m.cure_lasttime"
    },
    {
        "input": "皮肤癌的症状是?",
        "cypher": "MATCH (m:Disease {name:'皮肤癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "周围神经炎为什么越吃药越严重",
        "cypher": "MATCH (n1:Disease {name: '周围神经炎'})-[:common_drug|:recommand_drug]->(n2:Drug) RETURN n2.name"
    },
    {
        "input": "龟头炎都有什么症状",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '龟头炎' RETURN n.name"
    },
    {
        "input": "高压140算高血压吗",
        "cypher": "MATCH (n:Disease {name: '高血压'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "请问肋间神经痛是怎么引起的",
        "cypher": "MATCH (m:Disease {name:'肋间神经痛'}) RETURN m.cause"
    },
    {
        "input": "心肌缺血怎么样算正常？",
        "cypher": "MATCH (d:Disease {name: '心肌缺血'}) RETURN d.cure_way"
    },
    {
        "input": "糜烂性胃炎吃哪些药比较管用",
        "cypher": "MATCH (v1:Disease {name: '糜烂性胃炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脑胶质瘤放疗多少钱？",
        "cypher": "MATCH (n:Disease {name: '脑胶质瘤'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "怀孕9周多，今天彩超检查胚胎停育，请帮忙",
        "cypher": "MATCH (d:Disease {name: '胚胎停育'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "子宫内膜炎患者应该忌什么",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "治疗肠胃炎的医院效果好吗",
        "cypher": "MATCH (n:Disease {name:'肠胃炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "胆汁性肝硬化的症状?",
        "cypher": "MATCH (v1:Disease {name: '胆汁性肝硬化'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "输卵管上举该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '输卵管上举'}) RETURN d.cure_way"
    },
    {
        "input": "27岁，男，痔疮最近出血较多，怎样治疗？",
        "cypher": "MATCH (d:Disease {name: '痔疮'}) RETURN d.cure_way"
    },
    {
        "input": "疝气属于先天性疾病吗？",
        "cypher": "MATCH (n:Disease {name:'疝气'}) RETURN n.cause"
    },
    {
        "input": "黄疸都有什么症状",
        "cypher": "MATCH (m:Disease {name: '黄疸'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "腹股沟疝鉴别诊断",
        "cypher": "MATCH (d:Disease {name: '腹股沟疝'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "细菌性阴道炎症状和危害是什么？",
        "cypher": "MATCH (m:Disease {name:'细菌性阴道炎'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "怎样检查直肠炎",
        "cypher": "MATCH (v1:Disease {name: '直肠炎'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "紫癜性肾炎很严重吗？",
        "cypher": "MATCH (m:Disease {name:'紫癜性肾炎'}) RETURN m.cure_lasttime"
    },
    {
        "input": "帕金森病人晚期怎样护理",
        "cypher": "MATCH (d:Disease {name: '帕金森病'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "子宫内膜炎检查费多少",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜炎'})-[:need_check]->(v2:Check) RETURN v2.name AS name, v2.cost_money AS cost_money"
    },
    {
        "input": "93岁老人牙龈癌如何治疗",
        "cypher": "MATCH (d:Disease {name: '牙龈癌'}) RETURN d.cure_way"
    },
    {
        "input": "慢性淋巴细胞性甲状腺炎怎么治",
        "cypher": "MATCH (d:Disease {name: '慢性淋巴细胞性甲状腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "外痔有长在肛门里的吗",
        "cypher": "MATCH (m:Disease {name:'外痔'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "肛周脓肿需要注意什么呢",
        "cypher": "MATCH (m:Disease {name:'肛周脓肿'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "前列腺结石发病时会有哪些症状表现？",
        "cypher": "MATCH (m:Disease {name:'前列腺结石'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "垂体腺瘤手术治疗疗效如何",
        "cypher": "MATCH (d:Disease {name: '垂体腺瘤'}) RETURN d.cure_way"
    },
    {
        "input": "吸烟容易得喉癌是吗？",
        "cypher": "MATCH (d:Disease {name: '喉癌'}) RETURN d.easy_get"
    },
    {
        "input": "小孩肾虚吃什么食物好？",
        "cypher": "MATCH (v1:Disease {name: '肾虚'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "淋巴水肿并发症是什么",
        "cypher": "MATCH (m:Disease {name: '淋巴水肿'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "脑炎容易复发吗？",
        "cypher": "MATCH (n:Disease {name: '脑炎'}) RETURN n.get_prob"
    },
    {
        "input": "四个月宝宝腹泻可以吃药吗？",
        "cypher": "MATCH (n:Disease {name: '腹泻'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "我患了肝炎这个病这么麻烦吗，该怎么去治疗？",
        "cypher": "MATCH (d:Disease {name: '肝炎'}) RETURN d.cure_way"
    },
    {
        "input": "慢性肾功能裳竭",
        "cypher": "MATCH (d:Disease {name: '慢性肾功能衰竭'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "肛周脓肿术后用哪些药",
        "cypher": "MATCH (v1:Disease {name: '肛周脓肿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脑癌检查大概需要多少钱才可以",
        "cypher": "MATCH (m:Disease {name:'脑癌'})-[:need_check]->(n:Check) RETURN n.name, m.cost_money"
    },
    {
        "input": "做包皮长点手术多少钱？",
        "cypher": "MATCH (m:Disease {name:'包皮过长'}) RETURN m.cost_money"
    },
    {
        "input": "请问这是癫痫吗，癫痫病不发做的时候能查出来是",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:need_check]->(n:Check) RETURN m.name,n.name"
    },
    {
        "input": "想咨询精索静脉曲张是什么？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name='精索静脉曲张' RETURN m,n"
    },
    {
        "input": "精囊炎可以缓解吗？",
        "cypher": "MATCH (m:Disease {name:'精囊炎'}) RETURN m.cure_way"
    },
    {
        "input": "七个月女宝宝腹泻发烧怎么办？",
        "cypher": "MATCH (d:Disease {name: '腹泻'}) RETURN d.easy_get"
    },
    {
        "input": "排卵障碍通常会是哪些原因引发的病呢",
        "cypher": "MATCH (m:Disease {name: '排卵障碍'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "子宫脱垂到阴道口了电疗治疗中怎样治合适？",
        "cypher": "MATCH (d:Disease {name: '子宫脱垂'}) RETURN d.cure_way"
    },
    {
        "input": "盆腔炎要注意什么呢？",
        "cypher": "MATCH (m:Disease {name:'盆腔炎'}) RETURN m.prevent"
    },
    {
        "input": "呃逆是什么原因",
        "cypher": "MATCH (m:Disease {name:'呃逆'}) RETURN m.cause"
    },
    {
        "input": "黑色素瘤治疗的专家一般在哪家医院？",
        "cypher": "MATCH (n:Disease {name: '黑色素瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "先天性脑积水手术治疗后寿命一般多长？",
        "cypher": "MATCH (d:Disease {name: '先天性脑积水'}) RETURN d.cure_way"
    },
    {
        "input": "三叉神经痛的原因",
        "cypher": "MATCH (d:Disease {name: '三叉神经痛'})-[:acompany_with]->(r:Disease) RETURN r.cause"
    },
    {
        "input": "甲状腺炎会不会遗传",
        "cypher": "MATCH (n:Disease {name: '甲状腺炎'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "请问胆囊息肉吃什么药好些",
        "cypher": "MATCH (v1:Disease {name: '胆囊息肉'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "宝宝淋巴管瘤术后会复发？",
        "cypher": "MATCH (m:Disease {name:'淋巴管瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "CT检查显示肝癌并肝内转移怎么回事",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:need_check]->(n:Check {name: 'CT检查'}) RETURN m, n"
    },
    {
        "input": "请问是否确诊为卵巢癌？",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'}) RETURN m"
    },
    {
        "input": "我是月经不调较多是半年没来月经但都是",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '月经不调' RETURN d.name, d.desc"
    },
    {
        "input": "医生请问我男朋友的妈妈和妹妹有癫痫会遗传吗？",
        "cypher": "MATCH (n:Disease {name: '癫痫'})-[:acompany_with]->(m:Disease) RETURN m.get_prob"
    },
    {
        "input": "脉管炎有什么特效药吗？",
        "cypher": "MATCH (m:Disease {name:'脉管炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "泌尿道肿瘤要怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '泌尿道肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "脂肪肝怎么样保养才能不转变为肝硬化呢",
        "cypher": "MATCH (d:Disease {name: '脂肪肝'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "喉癌怎样调理对身体恢复好",
        "cypher": "MATCH (m:Disease {name: '喉癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "先天性白血病的症状是什么",
        "cypher": "MATCH (m:Disease {name:'先天性白血病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "遗精都是超过7～8次的是不是有问题？",
        "cypher": "MATCH (m:Disease {name:'遗精'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "伽马刀手术切除了垂体腺瘤复发咋办",
        "cypher": "MATCH (d:Disease {name: '垂体腺瘤'})-[:acompany_with]->(r:Disease) RETURN r"
    },
    {
        "input": "慢性细菌性前列腺炎要咋办啊",
        "cypher": "MATCH (m:Disease {name:'慢性细菌性前列腺炎'}) RETURN m.cure_way"
    },
    {
        "input": "胃里长了息肉如何解决",
        "cypher": "MATCH (d:Disease {name: '胃息肉'}) RETURN d.cure_way"
    },
    {
        "input": "乳腺增生如何预防再次出现？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "女人肾虚该如何用药",
        "cypher": "MATCH (v1:Disease {name: '肾虚'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "可以诊断是肝硬化吗",
        "cypher": "MATCH (m:Disease {name: '肝硬化'}) RETURN m"
    },
    {
        "input": "更年期女性白癜风怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '白癜风'}) RETURN d.cure_way"
    },
    {
        "input": "他这种情况算不算小儿多动症",
        "cypher": "MATCH (m:Disease {name:'小儿多动症'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "淋巴瘤的是什么样子的",
        "cypher": "MATCH (m:Disease {name:'淋巴瘤'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "前庭大腺囊肿有什么症状?",
        "cypher": "MATCH (m:Disease {name:'前庭大腺囊肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "子宫肌瘤的治疗医院有哪些？",
        "cypher": "MATCH (v1:Disease {name: '子宫肌瘤'})-[:belongs_to]-(v2:Department) RETURN v2.name"
    },
    {
        "input": "男47岁，肝癌晚期，吃东西呕吐，胀，会很痛，",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:has_symptom]->(s:Symptom)<-[:has_symptom]-(n:Disease) RETURN n.name"
    },
    {
        "input": "什么叫主动脉夹层？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '主动脉夹层' RETURN m.desc"
    },
    {
        "input": "有没有做一项检查就能查出阳痿的病因",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "尿毒症是通过什么方法检查出来的?",
        "cypher": "MATCH (m:Disease {name:'尿毒症'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "阳痿是否有可能导致早泄？",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:acompany_with]-(v2:Disease {name: '早泄'}) RETURN v1, v2"
    },
    {
        "input": "现在有治疗甲亢的药物没",
        "cypher": "MATCH (v1:Disease {name: '甲亢'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "患了阑尾炎吃什么好？",
        "cypher": "MATCH (v1:Disease {name: '阑尾炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "怎样导致流产呢啊",
        "cypher": "MATCH (m:Disease {name:'流产'}) RETURN m.cause"
    },
    {
        "input": "肾移植患者会有什么后遗症？",
        "cypher": "MATCH (m:Disease {name: '肾移植'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "急性乳腺炎应该怎么治疗",
        "cypher": "MATCH (d:Disease {name: '急性乳腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "癫痫部分性发作是指的什么？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '癫痫' RETURN m.desc"
    },
    {
        "input": "自然流产后会出现哪些症状",
        "cypher": "MATCH (v1:Disease {name: '自然流产'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "医治乳腺癌病人吃什么比较好呢？",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "得了肺癌会遗传吗",
        "cypher": "MATCH (m:Disease {name: '肺癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "我奶奶被诊为脉管炎左下肢脚趾已经坏死怎么办？",
        "cypher": "MATCH (d:Disease {name: '脉管炎'}) RETURN d.cure_way"
    },
    {
        "input": "看阳痿哪里好",
        "cypher": "MATCH (m:Disease {name:'阳痿'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "脂肪瘤会病变吗",
        "cypher": "MATCH (m:Disease {name: '脂肪瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "如果有精液不液化咋办",
        "cypher": "MATCH (m:Disease {name: '精液不液化'}) RETURN m.cure_way"
    },
    {
        "input": "急淋打过VP化疗，需多久才能检查出问题",
        "cypher": "MATCH (n:Disease {name: '急性淋巴细胞白血病'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "我怀疑自己有扁桃体结石该怎么办？",
        "cypher": "MATCH (d:Disease {name: '扁桃体结石'}) RETURN d.cure_way"
    },
    {
        "input": "男孩口腔里有血管瘤应该怎么样治疗比较好？",
        "cypher": "MATCH (d:Disease {name: '口腔血管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "窦性心律失常特征有什么？",
        "cypher": "MATCH (n:Disease)-[r1:has_symptom]->(m:Symptom) WHERE n.name = '窦性心律失常' RETURN m.name"
    },
    {
        "input": "什么药泡酒理疗治骨关节炎？",
        "cypher": "MATCH (d:Disease {name: '骨关节炎'}) RETURN d.cure_way"
    },
    {
        "input": "紫癜患儿怎么饮食",
        "cypher": "MATCH (v1:Disease {name: '紫癜'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "便血形成的病因是什么",
        "cypher": "MATCH (m:Disease {name:'便血'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "因盆腔炎切除输卵管会有后遗症吗？",
        "cypher": "MATCH (n:Disease {name: '盆腔炎'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "直肠癌可引发哪些疾病?",
        "cypher": "MATCH (m1:Disease {name: '直肠癌'})-[:acompany_with]->(m2:Disease) RETURN m2"
    },
    {
        "input": "得了附件炎吃药要注意什么",
        "cypher": "MATCH (v1:Disease {name: '附件炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "如何预防“肠梗阻”的发生",
        "cypher": "MATCH (n:Disease {name: '肠梗阻'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "胸腺癌能存活多久呢",
        "cypher": "MATCH (m:Disease {name: '胸腺癌'}) RETURN m.cure_lasttime"
    },
    {
        "input": "阴虱病怎么可以彻底缓解？",
        "cypher": "MATCH (m:Disease {name:'阴虱病'}) RETURN m.cure_way"
    },
    {
        "input": "胎毒是什么时候会有的",
        "cypher": "MATCH (m:Disease {name:'胎毒'})-[:acompany_with]-(n:Disease) RETURN n.cause"
    },
    {
        "input": "还请你能给我介绍下我是怎么患上的子宫肉瘤那？",
        "cypher": "MATCH (m:Disease {name:'子宫肉瘤'}) RETURN m.cause"
    },
    {
        "input": "乳腺增生需注意什么？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})RETURN m.prevent"
    },
    {
        "input": "甲亢患者要多久到医院进行一次检查",
        "cypher": "MATCH (v1:Disease {name: '甲亢'})-[:need_check]->(v2:Check) RETURN v2.name"
    }
]