[
    {
        "input": "检查多动症大约需要多少钱？",
        "cypher": "MATCH (m:Disease {name:'多动症'})-[:need_check]->(n:Check) RETURN n.name AS name, m.cost_money AS money"
    },
    {
        "input": "今天感觉睾丸有点疼有什么问题吗？",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '睾丸疼痛' RETURN m.name"
    },
    {
        "input": "三叉神经痛吃什么药",
        "cypher": "MATCH (v1:Disease {name: '三叉神经痛'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "昨天有点脱水医生建议",
        "cypher": "MATCH (d:Disease {name: '脱水'}) RETURN d.cure_way"
    },
    {
        "input": "纵隔神经鞘源性肿瘤该如何治疗",
        "cypher": "MATCH (d:Disease {name: '纵隔神经鞘源性肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "畸胎瘤从小就会有吗",
        "cypher": "MATCH (m:Disease {name: '畸胎瘤'}) RETURN m.get_way"
    },
    {
        "input": "早产了才三斤五在保温箱里有什么问题吗？",
        "cypher": "MATCH (m:Disease {name: '早产'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "如何确血管瘤",
        "cypher": "MATCH (m:Disease {name:'血管瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "小儿感冒吃哪种药好",
        "cypher": "MATCH (v1:Disease {name: '小儿感冒'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脑炎一定有后遗症吗？",
        "cypher": "MATCH (n:Disease {name: '脑炎'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "先天性耳前瘘管怎么治疗",
        "cypher": "MATCH (d:Disease {name: '先天性耳前瘘管'}) RETURN d.cure_way"
    },
    {
        "input": "肿瘤应该注意什么？",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "肾囊肿疼吗？",
        "cypher": "MATCH (m:Disease {name:'肾囊肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "得了肾囊肿怎么治疗才合适呢？",
        "cypher": "MATCH (d:Disease {name: '肾囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "重症肌无力这样的疾病会不会遗传那？",
        "cypher": "MATCH (n:Disease {name: '重症肌无力'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "请问在沈阳有什么地方的精神病心理健康治疗比较",
        "cypher": "MATCH (v1:Disease {name: '精神病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "细菌性阴道炎跟哪些病有联系",
        "cypher": "MATCH (v1:Disease {name: '细菌性阴道炎'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "讨教关于新生儿黄疸的问题",
        "cypher": "MATCH (m:Disease {name: '新生儿黄疸'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "得了睾丸炎应该吃什么药",
        "cypher": "MATCH (v1:Disease {name: '睾丸炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "做什么检查可以排除鼻咽癌",
        "cypher": "MATCH (v1:Disease {name: '鼻咽癌'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "试管婴儿促排卵打免疫针和药影响移植吗",
        "cypher": "MATCH (d:Disease {name: '试管婴儿'}) RETURN d.cure_way"
    },
    {
        "input": "流产过2次，能否再流产？",
        "cypher": "MATCH (n:Disease {name: '流产'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "每天反复低烧是怎么了",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '低烧' RETURN m.name"
    },
    {
        "input": "孩子感冒咳嗽还流鼻涕要如何解决",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom) WHERE n.name = '咳嗽' OR n.name = '流鼻涕' RETURN m.cureWay"
    },
    {
        "input": "小孩子得了孤独症了该怎么办？",
        "cypher": "MATCH (d:Disease {name: '孤独症'}) RETURN d.cure_way"
    },
    {
        "input": "心脏神经官能症的病因有哪些？",
        "cypher": "MATCH (n:Disease {name:'心脏神经官能症'}) RETURN n.cause"
    },
    {
        "input": "直肠炎怎样正确选者用药才能解决病的",
        "cypher": "MATCH (m:Disease {name:'直肠炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "什么是宫颈糜烂疾病",
        "cypher": "MATCH (n:Disease {name:'宫颈糜烂'}) RETURN n"
    },
    {
        "input": "亲戚患有恶性淋巴瘤能如何诊治呢",
        "cypher": "MATCH (d:Disease {name: '恶性淋巴瘤'}) RETURN d.cure_way"
    },
    {
        "input": "治睾丸癌大概花多少钱",
        "cypher": "MATCH (n:Disease {name: '睾丸癌'}) RETURN n.cost_money"
    },
    {
        "input": "肾积水的症状都有什么？",
        "cypher": "MATCH (v1:Disease {name: '肾积水'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "我和老公都没有乙肝，宝宝乙肝表面抗原为阳性怎",
        "cypher": "MATCH (n:Disease {name: '乙肝'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "胆总管结石并发感染了该怎么办",
        "cypher": "MATCH (m:Disease {name:'胆总管结石'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "内痔该如何诊断才会好些呢",
        "cypher": "MATCH (m:Disease {name: '内痔'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "阴囊湿疹怎么办，去哪里能看",
        "cypher": "MATCH (m:Disease {name:'阴囊湿疹'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "女性痛经该会怎么调理",
        "cypher": "MATCH (d:Disease {name: '痛经'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "冠心病患者有那些药物和治疗方法？",
        "cypher": "MATCH (m:Disease {name:'冠心病'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "恶性黑色素瘤应该吃哪些中药",
        "cypher": "MATCH (v1:Disease {name: '恶性黑色素瘤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "如何治疗上颌窦炎？",
        "cypher": "MATCH (d:Disease {name: '上颌窦炎'}) RETURN d.cure_way"
    },
    {
        "input": "会得脑膜炎可能性多高",
        "cypher": "MATCH (m:Disease {name:'脑膜炎'}) RETURN m.get_prob"
    },
    {
        "input": "查乳腺增生看什么科室？",
        "cypher": "MATCH (v1:Disease {name: '乳腺增生'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "做爱到5分钟以后速度一快就感觉要射，像",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name CONTAINS '射' RETURN d.name, s.name"
    },
    {
        "input": "中耳癌术后化疗好不好？",
        "cypher": "MATCH (d:Disease {name: '中耳癌'}) RETURN d.cure_way"
    },
    {
        "input": "上海看肾肿瘤的医院排名?",
        "cypher": "MATCH (v1:Disease {name: '肾肿瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "乳腺癌病人能康复吗？",
        "cypher": "MATCH (n:Disease {name: '乳腺癌'}) RETURN n.cured_prob"
    },
    {
        "input": "脑血栓病人能否办理残疾证",
        "cypher": "MATCH (d:Disease {name: '脑血栓'}) RETURN d.easy_get"
    },
    {
        "input": "前列腺增生哪里治疗好些?",
        "cypher": "MATCH (v1:Disease {name: '前列腺增生'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "阴道炎贫腔炎月经不调如何调理",
        "cypher": "MATCH (d:Disease {name: '阴道炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "直肠癌会不会导致死亡",
        "cypher": "MATCH (m:Disease {name: '直肠癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "如何确诊强迫症还是阿尔茨海默病？",
        "cypher": "MATCH (m:Disease {name:'强迫症'})-[:need_check]->(n:Check) RETURN m.name, n.name"
    },
    {
        "input": "脑血栓形成的治疗方法有哪些？",
        "cypher": "MATCH (d:Disease {name: '脑血栓形成'}) RETURN d.cure_way"
    },
    {
        "input": "肌肉萎缩会遗传给孩子吗",
        "cypher": "MATCH (n:Disease {name: '肌肉萎缩'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "宝宝十天前检查是川崎病要怎么治疗",
        "cypher": "MATCH (d:Disease {name: '川崎病'}) RETURN d.cure_way"
    },
    {
        "input": "阴道炎分为哪几种类型？",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "肠粘连，求中药可以治疗么",
        "cypher": "MATCH (v1:Disease {name: '肠粘连'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "包皮龟头炎会影响精子的质量吗？",
        "cypher": "MATCH (m:Disease {name:'包皮龟头炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "原位癌哪里医治比较好",
        "cypher": "MATCH (n:Disease {name: '原位癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "智力低下有哪些特征",
        "cypher": "MATCH (m:Disease {name:'智力低下'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "闭合性气胸如何治疗 ",
        "cypher": "MATCH (d:Disease {name: '闭合性气胸'}) RETURN d.cure_way"
    },
    {
        "input": "精液不液化治疗大约要花费多少钱",
        "cypher": "MATCH (n:Disease {name:'精液不液化'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "青少年气胸注意什么",
        "cypher": "MATCH (d:Disease {name: '气胸'}) RETURN d.easy_get"
    },
    {
        "input": "星形细胞瘤会遗传吗",
        "cypher": "MATCH (m:Disease {name:'星形细胞瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "结肠癌患者手术后饮食应该注意些什么",
        "cypher": "MATCH (m:Disease {name: '结肠癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "看前列腺炎要花多少钱",
        "cypher": "MATCH (v1:Disease {name: '前列腺炎'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "请问睾丸扭转是怎么判断的？",
        "cypher": "MATCH (m:Disease {name:'睾丸扭转'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "龟头炎该病会是如何诊断好的呢",
        "cypher": "MATCH (m:Disease {name:'龟头炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "是阳痿难受一周后怕感染艾滋怎么办？",
        "cypher": "MATCH (m:Disease {name:'阳痿'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "腰痛腿痛",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '腰痛' OR n.name = '腿痛' RETURN m.name"
    },
    {
        "input": "怎样采用有效方法预防睾丸炎",
        "cypher": "MATCH (n:Disease {name: '睾丸炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "卵巢囊肿的影响是什么",
        "cypher": "MATCH (m:Disease {name: '卵巢囊肿'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "我得过脑梗塞天气渐冷用输液吗用什么药好呢",
        "cypher": "MATCH (d:Disease {name: '脑梗塞'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "老婆自然流产了怎么诊断是不是宫外孕？",
        "cypher": "MATCH (m:Disease {name:'自然流产'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "CT检查一年最多做几次",
        "cypher": "MATCH (v:Disease)-[e:need_check]->(v1:Check) WHERE v1.name = 'CT检查' RETURN v1.name, v.cure_lasttime"
    },
    {
        "input": "慢性盆腔炎有哪些症状呢",
        "cypher": "MATCH (m:Disease {name:'慢性盆腔炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "婴幼儿腹泻间该怎么食补？",
        "cypher": "MATCH (v1:Disease {name: '婴幼儿腹泻'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "哮喘会进行传染吗？",
        "cypher": "MATCH (n:Disease {name: '哮喘'}) RETURN n.get_way"
    },
    {
        "input": "耳鸣吵得快想死拉，求救急急急！！",
        "cypher": "MATCH (d:Disease {name: '耳鸣'}) RETURN d.cure_way"
    },
    {
        "input": "膀胱癌潜伏期是多长时间",
        "cypher": "MATCH (n:Disease {name: '膀胱癌'}) RETURN n.cure_lasttime"
    },
    {
        "input": "月经不调要吃什么药呢",
        "cypher": "MATCH (m:Disease {name:'月经不调'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "早泄肾虚怎么办？",
        "cypher": "MATCH (m:Disease {name:'早泄'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "不孕不育患者生活中应注意什么",
        "cypher": "MATCH (d:Disease {name: '不孕不育'}) RETURN d.easy_get"
    },
    {
        "input": "75%的酒精能杀死血清中分离出的乙肝病",
        "cypher": "MATCH (v1:Disease {name: '乙肝'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "69岁男性肺癌晚期，能服用清肺散结丸吗",
        "cypher": "MATCH (d:Disease {name: '肺癌'})-[:common_drug|:recommand_drug]->(dg:Drug {name: '清肺散结丸'}) RETURN dg"
    },
    {
        "input": "肾炎哪些指标不正常？",
        "cypher": "MATCH (m:Disease {name:'肾炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "好的肝病医院在哪里呢?",
        "cypher": "MATCH (v1:Disease {name: '肝病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "心包积液好不好治疗",
        "cypher": "MATCH (d:Disease {name: '心包积液'}) RETURN d.cure_way"
    },
    {
        "input": "肝损伤比较严重都需要检查什么项目？",
        "cypher": "MATCH (m:Disease {name:'肝损伤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "月经前后出现会偏头痛怎么办",
        "cypher": "MATCH (m:Disease {name:'偏头痛'})-[:belongs_to]->(b:Department) RETURN b.name AS name"
    },
    {
        "input": "霉菌性阴道炎来了一次月经就没了怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '霉菌性阴道炎'}) RETURN d.cure_way"
    },
    {
        "input": "怎么样防治新生儿黄疸？",
        "cypher": "MATCH (m:Disease {name:'新生儿黄疸'}) RETURN m.prevent"
    },
    {
        "input": "新生儿黄疸一般出生几天出现呢？",
        "cypher": "MATCH (m1:Disease {name: '新生儿黄疸'})-[:acompany_with]->(m2:Disease) RETURN m2.get_way"
    },
    {
        "input": "什么东西吃了会流产快？",
        "cypher": "MATCH (v1:Disease {name: '流产'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "癫痫会引发什么疾病呢",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[:acompany_with]-(v2:Disease) RETURN v2"
    },
    {
        "input": "阳痿服用啥药呀?",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "什么人群最易患肝硬化",
        "cypher": "MATCH (d:Disease {name: '肝硬化'}) RETURN d.easy_get"
    },
    {
        "input": "纵隔肿瘤都是良性的吗?",
        "cypher": "MATCH (m:Disease {name:'纵隔肿瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "怎样才能被算是包皮过长呢？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '包皮过长' RETURN n.name"
    },
    {
        "input": "疝气哪里做手术最好？",
        "cypher": "MATCH (v1:Disease {name: '疝气'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "前列腺增生概念是什么？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name='前列腺增生' RETURN n.content"
    },
    {
        "input": "子宫内膜炎的危害通常会有哪些",
        "cypher": "MATCH (m:Disease {name:'子宫内膜炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "乳腺癌未育患者内分泌治疗后如何个性化治疗？",
        "cypher": "MATCH (d:Disease {name: '乳腺癌'}) RETURN d.cure_way"
    },
    {
        "input": "脑癌多吃哪些东西好",
        "cypher": "MATCH (v1:Disease {name: '脑癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "老是经常发烧37度多怎么回事呢?",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '发烧' RETURN m.name"
    },
    {
        "input": "直径4cm大小的肾肿瘤属于早期吗?",
        "cypher": "MATCH (m:Disease {name: '肾肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "盆腔炎症状",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '盆腔炎' RETURN n.name"
    },
    {
        "input": "包皮过长手术多少费用?",
        "cypher": "MATCH (v1:Disease {name: '包皮过长'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "脉络膜黑色素瘤，咋办？",
        "cypher": "MATCH (d:Disease {name: '脉络膜黑色素瘤'}) RETURN d.cure_way"
    },
    {
        "input": "胆囊炎，胆结石是否需要服药?",
        "cypher": "MATCH (m:Disease {name:'胆囊炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "便秘，怎么办?",
        "cypher": "MATCH (m:Disease {name:'便秘'}) RETURN m.cure_way"
    },
    {
        "input": "治阳痿需要注意什么",
        "cypher": "MATCH (m:Disease {name:'阳痿'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "直肠癌与直肠息肉的区别",
        "cypher": "MATCH (v1:Disease {name: '直肠癌'})-[:acompany_with]-(v2:Disease {name: '直肠息肉'}) RETURN v1,v2"
    },
    {
        "input": "包皮水肿是否正常",
        "cypher": "MATCH (n:Disease {name:'包皮水肿'}) RETURN n.get_prob"
    },
    {
        "input": "尿隐血为2其他正常是怎么回事",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '尿隐血' RETURN m.name"
    },
    {
        "input": "得了积乳囊肿要怎么治疗呢？",
        "cypher": "MATCH (d:Disease {name: '积乳囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "结肠息肉和息肉病是什么疾病？",
        "cypher": "MATCH (m:Disease {name:'结肠息肉'}) RETURN m"
    },
    {
        "input": "小儿支气管肺炎治疗的方法有哪些？",
        "cypher": "MATCH (d:Disease {name: '小儿支气管肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "纵隔非霍奇金淋巴瘤要注意些什么",
        "cypher": "MATCH (m:Disease {name:'纵隔非霍奇金淋巴瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "我丈母娘宫颈癌中晚期?",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:belongs_to]->(b:Department) RETURN b.name AS result"
    },
    {
        "input": "甲状腺癌术后如何知道药物剂量服用正确？",
        "cypher": "MATCH (n:Disease {name: '甲状腺癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肠痉挛该怎么办才牢靠点",
        "cypher": "MATCH (d:Disease {name: '肠痉挛'}) RETURN d.cure_way"
    },
    {
        "input": "肾炎患者应该注意哪些",
        "cypher": "MATCH (v1:Disease {name: '肾炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "精索静脉曲张那个医院治疗？",
        "cypher": "MATCH (n1:Disease {name: '精索静脉曲张'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "畸胎瘤是什么",
        "cypher": "MATCH (m:Disease {name: '畸胎瘤'}) RETURN m"
    },
    {
        "input": "直肠炎还是肠胃炎?",
        "cypher": "MATCH (m:Disease {name:'直肠炎'})-[:belongs_to]->(n:Department) RETURN m.name, n.name"
    },
    {
        "input": "我该怎样选择？",
        "cypher": "MATCH (n:Disease {name:'心脏病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "遗精是怎么回事呢？",
        "cypher": "MATCH (m:Disease) WHERE m.name='遗精' RETURN m.desc"
    },
    {
        "input": "宫颈糜烂会变严重吗？",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "早上起来喝了蜂蜜水，还是感觉胃难受，老是反胃",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name CONTAINS '胃难受' OR m.name CONTAINS '反胃' RETURN n.name"
    },
    {
        "input": "请问肝硬化能吃蜂蜜吗",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:do_eat]->(v2:Food {name: '蜂蜜'}) RETURN v2"
    },
    {
        "input": "月经量少用什么泡脚好？",
        "cypher": "MATCH (v1:Disease {name: '月经量少'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "包皮水肿怎么回事？怎么治疗?",
        "cypher": "MATCH (m:Disease {name:'包皮水肿'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "肾虚都有什么样症状",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '肾虚' RETURN n.name"
    },
    {
        "input": "治疗银屑病的费用是多少？",
        "cypher": "MATCH (n:Disease {name: '银屑病'}) RETURN n.cost_money"
    },
    {
        "input": "排卵障碍怎么治疗啊？",
        "cypher": "MATCH (d:Disease {name: '排卵障碍'}) RETURN d.cure_way"
    },
    {
        "input": "脑萎缩是怎样构成的",
        "cypher": "MATCH (m:Disease {name: '脑萎缩'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "甲亢性心脏病的症状有哪些",
        "cypher": "MATCH (v1:Disease {name: '甲亢性心脏病'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "哪些药可以治崩漏呢",
        "cypher": "MATCH (v1:Disease {name: '崩漏'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "我做试管婴儿的概率有多大？",
        "cypher": "MATCH (n:Disease {name:'试管婴儿'}) RETURN n.cured_prob"
    },
    {
        "input": "急性膀胱炎吃什么药好？",
        "cypher": "MATCH (m:Disease {name:'急性膀胱炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "硬化性骨髓炎能根治吗？",
        "cypher": "MATCH (d:Disease {name: '硬化性骨髓炎'}) RETURN d.cure_way"
    },
    {
        "input": "小孩子癫痫的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'小儿癫痫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "慢性附睾炎什么症状？",
        "cypher": "MATCH (m:Disease {name:'慢性附睾炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "患肝癌病人可以吃什么？",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "肺纤维化咳嗽厉害要用什么药物",
        "cypher": "MATCH (v1:Disease {name: '肺纤维化'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "患有肾结石吃药有效果吗",
        "cypher": "MATCH (m:Disease {name:'肾结石'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "白天喝很多少，但是到了晚上容易口渴，平时",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '口渴' RETURN d.name"
    },
    {
        "input": "小儿转移性骨肿瘤概述?",
        "cypher": "MATCH (m:Disease {name:'小儿转移性骨肿瘤'}) RETURN m.name, m.desc"
    },
    {
        "input": "外阴黑色素瘤到哪里治疗?",
        "cypher": "MATCH (m:Disease {name:'外阴黑色素瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "糜烂性胃炎，很难受怎么办",
        "cypher": "MATCH (d:Disease {name: '糜烂性胃炎'}) RETURN d.cure_way"
    },
    {
        "input": "查出急性细菌性前列腺炎要怎么治疗",
        "cypher": "MATCH (d:Disease {name: '急性细菌性前列腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "请问哪家人流医院比较好呢",
        "cypher": "MATCH (n:Disease)-[r:belongs_to]->(m:Department) WHERE n.name CONTAINS '人流' RETURN m.name"
    },
    {
        "input": "输卵管积水去哪里治疗比较好？",
        "cypher": "MATCH (v1:Disease {name: '输卵管积水'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "得了睾丸炎会影响精子的质量么？",
        "cypher": "MATCH (m:Disease {name: '睾丸炎'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "刚坐完月子想用激光治疗蜘蛛痣有事吗",
        "cypher": "MATCH (d:Disease {name: '蜘蛛痣'}) RETURN d.cure_way"
    },
    {
        "input": "胆管结石的病因",
        "cypher": "MATCH (n:Disease {name: '胆管结石'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "早泄现象饮食方面需要注意些甚么？吃哪些食物有",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "哪所医院治疗淋巴癌",
        "cypher": "MATCH (v1:Disease {name: '淋巴癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "乳糜胸术后会不会复发",
        "cypher": "MATCH (m:Disease {name:'乳糜胸'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "卵巢癌服用啥药能好呢?",
        "cypher": "MATCH (n:Disease {name: '卵巢癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "POEMS综合征的症状都包括哪些？",
        "cypher": "MATCH (m:Disease {name:'POEMS综合征'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "宫颈肥大需要怎么检查？",
        "cypher": "MATCH (m:Disease {name:'宫颈肥大'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "胃癌晚期患者如何补血比较好？",
        "cypher": "MATCH (n:Disease {name: '胃癌'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "阳痿需要多少费用才是合理的要价",
        "cypher": "MATCH (n:Disease {name: '阳痿'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "前列腺炎是这样的吗?",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'}) RETURN m"
    },
    {
        "input": "精囊炎的症状表现有哪些",
        "cypher": "MATCH (m:Disease {name:'精囊炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "包皮过长影响当兵吗",
        "cypher": "MATCH (d:Disease {name: '包皮过长'}) RETURN d.easy_get"
    },
    {
        "input": "腹外疝最常见的疝内容物是什么",
        "cypher": "MATCH (m:Disease {name: '腹外疝'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "患有多年的血吸虫病需要定期的去做检查吗？",
        "cypher": "MATCH (n:Disease {name: '血吸虫病'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "急性喉炎有什么好的治疗方法？",
        "cypher": "MATCH (d:Disease {name: '急性喉炎'}) RETURN d.cure_way"
    },
    {
        "input": "我女儿20岁了。身上也没啥感觉。就是化验抗“",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE m.name CONTAINS '抗' RETURN n.name"
    },
    {
        "input": "毛细血管瘤这个病严重吗",
        "cypher": "MATCH (m:Disease {name:'毛细血管瘤'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "小儿支气管炎输液用什么药最好",
        "cypher": "MATCH (v1:Disease {name: '小儿支气管炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "结肠癌期间感冒了该吃什么药",
        "cypher": "MATCH (v1:Disease {name: '结肠癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "急性肠炎的治疗方法有什么？",
        "cypher": "MATCH (d:Disease {name: '急性肠炎'}) RETURN d.cure_way"
    },
    {
        "input": "子宫内膜癌大概费用多少",
        "cypher": "MATCH (m:Disease {name:'子宫内膜癌'}) RETURN m.cost_money"
    },
    {
        "input": "小儿癫痫的治疗费用高吗",
        "cypher": "MATCH (n:Disease {name: '小儿癫痫'}) RETURN n.cost_money"
    },
    {
        "input": "我是石家庄患者得了淋巴瘤怎么办啊？",
        "cypher": "MATCH (m:Disease {name: '淋巴瘤'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "卵巢浆液性肿瘤是什么原因引起的",
        "cypher": "MATCH (m:Disease {name:'卵巢浆液性肿瘤'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "阴茎异常勃起怎么回事",
        "cypher": "MATCH (m:Disease {name: '阴茎异常勃起'}) RETURN m"
    },
    {
        "input": "在做爱过程中阴茎软了怎么办有什么药品治疗吗？",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "宝宝持续呕吐，输液都抑制不了，怎么办？",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '呕吐' RETURN m.name"
    },
    {
        "input": "手淫会导致腰疼不孕不育吗",
        "cypher": "MATCH (m:Disease {name: '不孕不育'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "食管息肉手术后",
        "cypher": "MATCH (d:Disease {name: '食管息肉'}) RETURN d.cure_way"
    },
    {
        "input": "西安哪家淋巴瘤医院比较好，淋巴瘤会传染吗",
        "cypher": "MATCH (v1:Disease {name: '淋巴瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "附睾炎通常该会出现哪些影响呢",
        "cypher": "MATCH (m:Disease {name:'附睾炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "肾病综合征饮食注意什么？",
        "cypher": "MATCH (m:Disease {name:'肾病综合征'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "宫颈癌患者吃什么最合适?",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "是否宫外孕？",
        "cypher": "MATCH (m:Disease {name: '宫外孕'}) RETURN m"
    },
    {
        "input": "是不是混合痔？",
        "cypher": "MATCH (m:Disease {name:'混合痔'}) RETURN m"
    },
    {
        "input": "阳痿了到底是怎么回事",
        "cypher": "MATCH (m:Disease {name: '阳痿'}) RETURN m"
    },
    {
        "input": "常见妇科病有哪些",
        "cypher": "MATCH (v1:Disease)-[v2:belongs_to]->(v3:Department) WHERE v3.name = '妇科' RETURN v1.name"
    },
    {
        "input": "烟雾病该怎么治疗比较有效呢？",
        "cypher": "MATCH (d:Disease {name: '烟雾病'}) RETURN d.cure_way"
    },
    {
        "input": "孕妇滴虫性阴道炎可以用药吗？",
        "cypher": "MATCH (n:Disease {name: '滴虫性阴道炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "精索静脉曲张睾丸下垂",
        "cypher": "MATCH (d:Disease {name: '精索静脉曲张'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "医生您好，请问16岁的女孩会得继发性痛经吗？",
        "cypher": "MATCH (d:Disease {name: '继发性痛经'}) RETURN d.easy_get"
    },
    {
        "input": "去年在体检时尿常规正常，可今年上周在体检",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE m.name = '尿常规' RETURN n.name"
    },
    {
        "input": "这种情况可能是淋巴癌吗？",
        "cypher": "MATCH (m:Disease {name: '淋巴癌'})-[:has_symptom]->(n:Symptom) RETURN m, n"
    },
    {
        "input": "得了乳腺炎的症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '乳腺炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "精子畸形较多如何治疗",
        "cypher": "MATCH (d:Disease {name: '精子畸形'}) RETURN d.cure_way"
    },
    {
        "input": "软纤维瘤手术后头晕怎么办 ？",
        "cypher": "MATCH (d:Disease {name: '软纤维瘤'}) RETURN d.cure_way"
    },
    {
        "input": "难治性癫痫的早期症状有哪些",
        "cypher": "MATCH (n:Disease {name: '难治性癫痫'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "记忆障碍治疗有什么方法那种最有效而且没有副作",
        "cypher": "MATCH (d:Disease {name: '记忆障碍'}) RETURN d.cure_way"
    },
    {
        "input": "乳腺结节，疑似乳腺纤维瘤",
        "cypher": "MATCH (d:Disease {name: '乳腺结节'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "我爸爸得的是脑血栓，现在在医院治疗，我想问下",
        "cypher": "MATCH (d:Disease {name: '脑血栓'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "治阳痿费用是多少",
        "cypher": "MATCH (n:Disease {name:'阳痿'}) RETURN n.cost_money"
    },
    {
        "input": "什么情况属于早泄",
        "cypher": "MATCH (m:Disease)-[r1:acompany_with]->(n:Disease) WHERE m.name = '早泄' RETURN n.name"
    },
    {
        "input": "草莓状血管瘤江苏哪家医院？",
        "cypher": "MATCH (v1:Disease {name: '草莓状血管瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "不孕不育怎么样可以彻底根治?",
        "cypher": "MATCH (m:Disease {name:'不孕不育'}) RETURN m.cure_way"
    },
    {
        "input": "腹痛是不是肿瘤可能？",
        "cypher": "MATCH (m:Disease {name:'肿瘤'})-[:has_symptom]->(n:Symptom {name:'腹痛'}) RETURN m"
    },
    {
        "input": "先天性心脏病该注意些什么呢",
        "cypher": "MATCH (m:Disease {name:'先天性心脏病'}) RETURN m.prevent"
    },
    {
        "input": "脑梗死患者血糖多少正常？",
        "cypher": "MATCH (d:Disease {name: '脑梗死'}) RETURN d.easy_get"
    },
    {
        "input": "霉菌性阴道炎需要用什么药呢？",
        "cypher": "MATCH (n:Disease {name: '霉菌性阴道炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "得了慢性附睾炎吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '慢性附睾炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "乳腺囊肿的饮食要注意些什么问题？",
        "cypher": "MATCH (n:Disease {name: '乳腺囊肿'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "我主要是性时间短，射精快。阴茎小怎么办",
        "cypher": "MATCH (d:Disease {name: '早泄'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "包皮有点过长会影响性生活吗",
        "cypher": "MATCH (m:Disease {name: '包皮过长'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "请问软骨发育不全怎样治疗效果比较好",
        "cypher": "MATCH (d:Disease {name: '软骨发育不全'}) RETURN d.cure_way"
    },
    {
        "input": "痔疮检查会痛吗",
        "cypher": "MATCH (m:Disease {name: '痔疮'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "如何治疗膀胱结石好？",
        "cypher": "MATCH (d:Disease {name: '膀胱结石'}) RETURN d.cure_way"
    },
    {
        "input": "窦性心律失常如何治疗？",
        "cypher": "MATCH (d:Disease {name: '窦性心律失常'}) RETURN d.cure_way"
    },
    {
        "input": "直肠息肉做什么检查",
        "cypher": "MATCH (m:Disease {name: '直肠息肉'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "星形细胞瘤需要怎样治疗呢？",
        "cypher": "MATCH (d:Disease {name: '星形细胞瘤'}) RETURN d.cure_way"
    },
    {
        "input": "单发性骨软骨瘤丈在左漆盖內侧怎么办",
        "cypher": "MATCH (d:Disease {name: '单发性骨软骨瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "脑梗塞老人要卧床吗?",
        "cypher": "MATCH (m:Disease {name:'脑梗塞'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "甲状腺肿瘤会复发吗？",
        "cypher": "MATCH (m:Disease {name:'甲状腺肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "最近凌晨起来上一次厕所算尿频吗",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '尿频' RETURN d.name"
    }
]