[
    {
        "input": "胆管炎吃什么消炎药",
        "cypher": "MATCH (v1:Disease {name: '胆管炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "乳腺增生容易变成癌症或者不治之症吗？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "多动症费用如何",
        "cypher": "MATCH (m:Disease {name:'多动症'}) RETURN m.cost_money"
    },
    {
        "input": "早产儿是否会有遗留后遗症？",
        "cypher": "MATCH (m1:Disease {name: '早产儿'})-[:acompany_with]->(m2:Disease) RETURN m2"
    },
    {
        "input": "抑郁症晚期症状有哪些",
        "cypher": "MATCH (m:Disease {name:'抑郁症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肝血管瘤是什么样的",
        "cypher": "MATCH (m:Disease {name: '肝血管瘤'}) RETURN m"
    },
    {
        "input": "血吸虫病危害是什么？",
        "cypher": "MATCH (m:Disease {name: '血吸虫病'}) RETURN m.cause"
    },
    {
        "input": "月经不调怎么办？需要吃什么吗？",
        "cypher": "MATCH (m:Disease {name:'月经不调'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "ECT检查对身体有什么危害",
        "cypher": "MATCH (v:Disease)-[e:need_check]->(v1:Check) WHERE v1.name = 'ECT检查' RETURN v1.name, v1.desc"
    },
    {
        "input": "肺癌会通过唾液传染他人吗",
        "cypher": "MATCH (v1:Disease {name: '肺癌'})-[]->(v2) RETURN v2.get_way"
    },
    {
        "input": "治疗脑瘤有哪些化疗药物呢？",
        "cypher": "MATCH (n:Disease {name: '脑瘤'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "得了附件炎哪里会痛",
        "cypher": "MATCH (v1:Disease {name: '附件炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "药物过敏导致阴茎水肿怎么治疗",
        "cypher": "MATCH (d:Disease {name: '药物过敏'}) RETURN d.cure_way"
    },
    {
        "input": "浆细胞瘤一般有什么方法治疗的？",
        "cypher": "MATCH (d:Disease {name: '浆细胞瘤'}) RETURN d.cure_way"
    },
    {
        "input": "食管血管瘤",
        "cypher": "MATCH (m:Disease {name: '食管血管瘤'}) RETURN m"
    },
    {
        "input": "恶性肿瘤都是什么症状",
        "cypher": "MATCH (m:Disease {name: '恶性肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "血小板减少性紫癜会出现哪些典型的症状",
        "cypher": "MATCH (v1:Disease {name: '血小板减少性紫癜'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "怎么预防前列腺囊肿？",
        "cypher": "MATCH (n:Disease {name: '前列腺囊肿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "三个月宝宝口臭是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'口臭'})<-[:acompany_with]-(n:Disease) RETURN m.name,n.name"
    },
    {
        "input": "辽宁哪有治疗三叉神经痛的医院。如何治疗",
        "cypher": "MATCH (v1:Disease {name: '三叉神经痛'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "阴茎结核疹的危害有哪些？",
        "cypher": "MATCH (m:Disease {name:'阴茎结核疹'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "用激光治疗前列腺增生主要有些什么好处呢？",
        "cypher": "MATCH (d:Disease {name: '前列腺增生'}) RETURN d.cure_way"
    },
    {
        "input": "咨询子宫内膜异位",
        "cypher": "MATCH (d:Disease {name: '子宫内膜异位症'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "变应性皮肤血管炎能不能康复？",
        "cypher": "MATCH (d:Disease {name: '变应性皮肤血管炎'}) RETURN d.cure_way"
    },
    {
        "input": "脑瘤平时饮食上要注意什么",
        "cypher": "MATCH (m:Disease {name:'脑瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "黄疸性肝炎传染吗",
        "cypher": "MATCH (m:Disease {name:'黄疸性肝炎'}) RETURN m.get_way"
    },
    {
        "input": "预防精索静脉曲张吃什么好",
        "cypher": "MATCH (v1:Disease {name: '精索静脉曲张'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "对于腹膜炎是什么病",
        "cypher": "MATCH (m:Disease {name:'腹膜炎'}) RETURN m"
    },
    {
        "input": "因支气管炎咳嗽怎么办",
        "cypher": "MATCH (m:Disease {name:'支气管炎'})-[:has_symptom]->(n:Symptom {name:'咳嗽'}) RETURN m.cureWay"
    },
    {
        "input": "广州什么医院治黑色素瘤好",
        "cypher": "MATCH (v1:Disease {name: '黑色素瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "神经源性肿瘤具体如何怎么治疗呢",
        "cypher": "MATCH (d:Disease {name: '神经源性肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "你们医院能治乳腺纤维腺瘤吗？",
        "cypher": "MATCH (m:Disease {name:'乳腺纤维腺瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "怎样判断宝宝是否肠炎",
        "cypher": "MATCH (m:Disease {name:'肠炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "面瘫病因是什么?",
        "cypher": "MATCH (n:Disease {name: '面瘫'}) RETURN n.cause"
    },
    {
        "input": "造成女性面瘫有哪些原因",
        "cypher": "MATCH (d:Disease {name: '面瘫'}) RETURN d.easy_get"
    },
    {
        "input": "中耳癌是怎么分期的？",
        "cypher": "MATCH (m:Disease {name:'中耳癌'}) RETURN m.desc"
    },
    {
        "input": "精索静脉曲张会带来哪些危害",
        "cypher": "MATCH (m:Disease {name: '精索静脉曲张'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "小儿脑性瘫痪会遗传吗？",
        "cypher": "MATCH (m:Disease {name:'小儿脑性瘫痪'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "上海哪家是正规的十二指肠憩室医院",
        "cypher": "MATCH (n:Disease {name:'十二指肠憩室'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肾结石的饮食是如何的",
        "cypher": "MATCH (m:Disease {name: '肾结石'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "两对半正常结果有几种",
        "cypher": "MATCH (v:Disease)-[e:need_check]->(v:Check) WHERE v.name = '两对半' RETURN COUNT(DISTINCT v.check)"
    },
    {
        "input": "甲状腺炎患者要吃什么",
        "cypher": "MATCH (v1:Disease {name: '甲状腺炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "小儿肾母细胞瘤有什么症状",
        "cypher": "MATCH (m:Disease {name:'小儿肾母细胞瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "颅内肿瘤术后怎样才能更好地帮助恢复记忆力?",
        "cypher": "MATCH (d:Disease {name: '颅内肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "宫颈炎严重吗？需要住院治疗吗？",
        "cypher": "MATCH (m:Disease {name:'宫颈炎'}) RETURN m.cure_lasttime"
    },
    {
        "input": "毛细血管瘤应该挂什么科?",
        "cypher": "MATCH (n:Disease {name: '毛细血管瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "阴道炎是什么",
        "cypher": "MATCH (m:Disease) WHERE m.name = '阴道炎' RETURN m.desc"
    },
    {
        "input": "功能性消化不良会瘦吗",
        "cypher": "MATCH (d:Disease {name: '功能性消化不良'}) RETURN d.easy_get"
    },
    {
        "input": "低血压是什么症状？",
        "cypher": "MATCH (m:Disease {name:'低血压'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "垂体瘤复发率有多高？",
        "cypher": "MATCH (m:Disease {name:'垂体瘤'}) RETURN m.get_prob"
    },
    {
        "input": "阴道炎都有什么症状",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '阴道炎' RETURN m.name, n.name"
    },
    {
        "input": "去哪家医院可以完全治好宫颈糜烂",
        "cypher": "MATCH (d:Disease {name: '宫颈糜烂'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "刚满月婴儿黄疸能不能吃药",
        "cypher": "MATCH (v1:Disease {name: '黄疸'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "外伤性癫痫有哪些表现?",
        "cypher": "MATCH (m:Disease {name:'外伤性癫痫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "盆腔积液手术要花费多少，会收额外费用吗",
        "cypher": "MATCH (n:Disease {name: '盆腔积液'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "糖尿病肾病注意事项有哪些",
        "cypher": "MATCH (n:Disease {name: '糖尿病肾病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "膀胱癌微创手术出院后1个月排尿困难咋办？",
        "cypher": "MATCH (d:Disease {name: '膀胱癌'}) RETURN d.cure_way"
    },
    {
        "input": "请问霉菌性阴道炎一般是怎样感染上的?有何危害",
        "cypher": "MATCH (m:Disease {name:'霉菌性阴道炎'}) RETURN m.get_way"
    },
    {
        "input": "甲亢是什么疾病？谁知道？",
        "cypher": "MATCH (m:Disease {name:'甲亢'}) RETURN m"
    },
    {
        "input": "我患有肠炎是怎么回事，为什么这么严重呢？",
        "cypher": "MATCH (m:Disease {name: '肠炎'}) RETURN m.cause"
    },
    {
        "input": "龟头炎治疗费用需要多少？",
        "cypher": "MATCH (n:Disease {name: '龟头炎'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "脑血管病有好的药物治疗吗",
        "cypher": "MATCH (n:Disease {name: '脑血管病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m"
    },
    {
        "input": "孩子药物过敏怎么办",
        "cypher": "MATCH (d:Disease {name: '药物过敏'}) RETURN d.easy_get"
    },
    {
        "input": "治疗弱精有什么办法怎么治疗弱精？",
        "cypher": "MATCH (d:Disease {name: '弱精'}) RETURN d.cure_way"
    },
    {
        "input": "怎样能早点发现脑血管畸形",
        "cypher": "MATCH (m:Disease {name: '脑血管畸形'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "帕金森病的药物价格是多少",
        "cypher": "MATCH (n:Disease {name: '帕金森病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "早泄究竟是什么方面引发的",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE d.name='早泄' RETURN s.name"
    },
    {
        "input": "得肝硬化饮食上注意什么?",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "如何判断自己有输卵管粘连现象",
        "cypher": "MATCH (m:Disease {name: '输卵管粘连'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我想知道高血压要注意什么",
        "cypher": "MATCH (m:Disease {name: '高血压'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "除了试管婴儿外必须有正常的两性生活能怀上吗",
        "cypher": "MATCH (n:Disease {name:'试管婴儿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "怎么属于早泄?",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name CONTAINS '早泄' RETURN m.name,n.name"
    },
    {
        "input": "慢性肾功能衰竭感冒了吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '慢性肾功能衰竭'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "哪里看不孕不育最好呀？",
        "cypher": "MATCH (m:Disease {name:'不孕不育'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "包皮手术拆线的时候包皮周围还有一些肿胀现象正",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name CONTAINS '肿胀' RETURN n.name"
    },
    {
        "input": "肾动脉狭窄的病变有哪些",
        "cypher": "MATCH (m:Disease {name: '肾动脉狭窄'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "肺气肿哪些分型啊？",
        "cypher": "MATCH (n:Disease)-[r1:acompany_with]->(m:Disease) WHERE n.name = '肺气肿' RETURN m.name"
    },
    {
        "input": "看看我的前列腺检查结果正常吗？",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'})-[:need_check]->(m:Check {name: '前列腺检查'}) RETURN m"
    },
    {
        "input": "知道癫痫是一种比较可怕的病，癫痫的概述是什么",
        "cypher": "MATCH (n:Disease {name: '癫痫'}) RETURN n.desc"
    },
    {
        "input": "请求专家细菌性阴道炎对胎儿有怎样的影响？",
        "cypher": "MATCH (d:Disease {name: '细菌性阴道炎'}) RETURN d.easy_get"
    },
    {
        "input": "孕妇患有外痔怎么办？",
        "cypher": "MATCH (d:Disease {name: '外痔'}) RETURN d.easy_get"
    },
    {
        "input": "附睾畸形引起的原因有哪些呢",
        "cypher": "MATCH (m:Disease {name:'附睾畸形'}) RETURN m.cause"
    },
    {
        "input": "滴虫性外阴炎的症状基本有什么",
        "cypher": "MATCH (n:Disease {name: '滴虫性外阴炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "小儿斜视宝宝为什么要二次手术？",
        "cypher": "MATCH (n:Disease {name: '小儿斜视'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "白血病骨髓移植后还有复发的可能性吗",
        "cypher": "MATCH (n:Disease {name: '白血病'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "纤维肉瘤在哪里可以治好",
        "cypher": "MATCH (d:Disease {name: '纤维肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "别人会染上癫痫吗",
        "cypher": "MATCH (m1:Disease {name: '癫痫'})-[:acompany_with]-(m2:Disease) RETURN m2"
    },
    {
        "input": "早泄我该怎么调理",
        "cypher": "MATCH (d:Disease {name: '早泄'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "骨膜炎会引发哪些症状",
        "cypher": "MATCH (m:Disease {name:'骨膜炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "不孕不育需要做什么检查能查出来呢",
        "cypher": "MATCH (m:Disease {name: '不孕不育'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "苯丙酮尿症的特殊饮食治疗",
        "cypher": "MATCH (d:Disease {name: '苯丙酮尿症'}) RETURN d.cure_way"
    },
    {
        "input": "什么是男性不育症呀？",
        "cypher": "MATCH (m:Disease {name:'男性不育症'}) RETURN m.name,m.desc"
    },
    {
        "input": "软骨肉瘤要采取什么样的治疗方法",
        "cypher": "MATCH (d:Disease {name: '软骨肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "脑梗死病因分型有什么",
        "cypher": "MATCH (v1:Disease {name: '脑梗死'})-[:acompany_with]-(v2:Disease) RETURN v2.cause"
    },
    {
        "input": "急淋PH+怎么办",
        "cypher": "MATCH (d:Disease {name: '急性淋病'}) RETURN d.cure_way"
    },
    {
        "input": "糖尿病和尿毒症区别是什么",
        "cypher": "MATCH (m:Disease {name:'糖尿病'})-[:acompany_with]-(n:Disease {name:'尿毒症'}) RETURN m,n"
    },
    {
        "input": "宫颈炎同房时候要注意什么",
        "cypher": "MATCH (d:Disease {name: '宫颈炎'}) RETURN d.easy_get"
    },
    {
        "input": "肛周脓肿和火疖子区别？",
        "cypher": "MATCH (m:Disease {name:'肛周脓肿'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "包皮龟头炎的概念是什么？",
        "cypher": "MATCH (m:Disease) WHERE m.name='包皮龟头炎' RETURN m.desc"
    },
    {
        "input": "乙肝患者感冒可以吃什么",
        "cypher": "MATCH (v1:Disease {name: '乙肝'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "新生儿发热要立马退热吗？",
        "cypher": "MATCH (d:Disease {name: '新生儿发热'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺囊肿的症状难治吗",
        "cypher": "MATCH (n:Disease {name: '前列腺囊肿'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "胃溃疡患者的饮食要注意一些什么",
        "cypher": "MATCH (v1:Disease {name: '胃溃疡'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "阴道痉挛是什么？",
        "cypher": "MATCH (m:Disease) WHERE m.name='阴道痉挛' RETURN m.desc"
    },
    {
        "input": "得了性功能障碍要注意什么怎么治疗？",
        "cypher": "MATCH (m:Disease {name:'性功能障碍'})-[:belongs_to]->(n:Department) RETURN m.prevent,n.name"
    },
    {
        "input": "浙江或者上海看强迫症最好的医院在哪",
        "cypher": "MATCH (v1:Disease {name: '强迫症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肝硬化能治好吗？得花多少钱啊？",
        "cypher": "MATCH (m:Disease {name:'肝硬化'}) RETURN m.cure_lasttime, m.cost_money"
    },
    {
        "input": "月经不调要做哪些检查项目？",
        "cypher": "MATCH (v1:Disease {name: '月经不调'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "痛风性关节炎请问怎么能治好吗",
        "cypher": "MATCH (d:Disease {name: '痛风性关节炎'}) RETURN d.cure_way"
    },
    {
        "input": "一岁女儿腹泻吃什么药？",
        "cypher": "MATCH (m:Disease {name:'腹泻'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "胃癌如何预防",
        "cypher": "MATCH (d:Disease {name: '胃癌'})-[:belongs_to]->(p:Department) RETURN p.name"
    },
    {
        "input": "破伤风打一针就行了吗",
        "cypher": "MATCH (d:Disease {name: '破伤风'}) RETURN d.cure_way"
    },
    {
        "input": "名字许德贵男27岁来自江西赣州，得了癫痫怎么",
        "cypher": "MATCH (n:Disease {name: '癫痫'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称"
    },
    {
        "input": "前列腺炎怎样引起的?",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'}) RETURN m.cause"
    },
    {
        "input": "我的孩子现在一岁了刚发现他听不见怎么办？",
        "cypher": "MATCH (d:Disease {name: '听力障碍'}) RETURN d.cure_way"
    },
    {
        "input": "眩晕症是哪些原因引起的?",
        "cypher": "MATCH (n:Disease {name: '眩晕症'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "原位癌这种疾病吃哪些药啊",
        "cypher": "MATCH (m:Disease {name:'原位癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "心脏瓣膜病有什么症状特点",
        "cypher": "MATCH (m:Disease {name: '心脏瓣膜病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "结肠炎有哪些症状？",
        "cypher": "MATCH (m:Disease {name:'结肠炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "什么叫运动神经元病？",
        "cypher": "MATCH (n:Disease {name:'运动神经元病'}) RETURN n.desc"
    },
    {
        "input": "请问乳腺增生用什么药",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "喉癌手术后的饮食如何调理",
        "cypher": "MATCH (v1:Disease {name: '喉癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "子宫肌瘤症状及治疗是什么？",
        "cypher": "MATCH (m:Disease {name: '子宫肌瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name, collect(n.name)"
    },
    {
        "input": "前列腺癌饮食方面注意什么？",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "皮肤癌如何预防才有效果呢？",
        "cypher": "MATCH (m:Disease {name:'皮肤癌'}) RETURN m.prevent"
    },
    {
        "input": "前列腺有结石如何处理呢？",
        "cypher": "MATCH (m:Disease {name: '前列腺结石'}) RETURN m.cure_way"
    },
    {
        "input": "急性阑尾炎手术要多久？",
        "cypher": "MATCH (d:Disease {name: '急性阑尾炎'}) RETURN d.cure_way"
    },
    {
        "input": "腹膜后肿瘤该吃什么药",
        "cypher": "MATCH (m:Disease {name:'腹膜后肿瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "面肌痉挛怎样用药",
        "cypher": "MATCH (m:Disease {name:'面肌痉挛'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "强直性脊柱炎的患者能活多久就没法治了么？",
        "cypher": "MATCH (d:Disease {name: '强直性脊柱炎'}) RETURN d.cure_way"
    },
    {
        "input": "肺动脉高压应该挂哪个科",
        "cypher": "MATCH (v1:Disease {name: '肺动脉高压'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "做试管婴儿要做检查吗",
        "cypher": "MATCH (v1:Disease {name: '试管婴儿'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "多动症吃什么药较好？",
        "cypher": "MATCH (v1:Disease {name: '多动症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "如何确诊小儿癫痫",
        "cypher": "MATCH (m:Disease {name:'小儿癫痫'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "没过孩子会不会得盆腔炎?",
        "cypher": "MATCH (d:Disease {name: '盆腔炎'}) RETURN d.easy_get"
    },
    {
        "input": "如何治疗产后风会好一点呢",
        "cypher": "MATCH (d:Disease {name: '产后风'}) RETURN d.cure_way"
    },
    {
        "input": "肌肉萎缩能改善吗",
        "cypher": "MATCH (d:Disease {name: '肌肉萎缩'}) RETURN d.cure_way"
    },
    {
        "input": "妊娠期糖尿病情况严重吗",
        "cypher": "MATCH (m:Disease {name: '妊娠期糖尿病'}) RETURN m.cause"
    },
    {
        "input": "烧后头晕不知道怎么办",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '头晕' RETURN m.name"
    },
    {
        "input": "阴道良性肿瘤的症状有哪些",
        "cypher": "MATCH (m:Disease {name:'阴道良性肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "儿童口吃的病因是什么",
        "cypher": "MATCH (n:Disease {name: '儿童口吃'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "我很想知道前列腺炎的发病的原因到底是什么那?",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'}) RETURN n.cause"
    },
    {
        "input": "包皮过长的饮食有什么要注意的吗",
        "cypher": "MATCH (m:Disease {name:'包皮过长'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "12岁女孩，额叶癫痫六年，怎么治？",
        "cypher": "MATCH (d:Disease {name: '额叶癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "1岁3个月的宝宝肺炎好了后还咳嗽怎么办？",
        "cypher": "MATCH (d:Disease {name: '肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "哪个医院治疗小儿脑瘫好呢？",
        "cypher": "MATCH (v1:Disease {name: '小儿脑瘫'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "什么药治疗腹泻好一点",
        "cypher": "MATCH (v1:Disease {name: '腹泻'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "感冒咳嗽流鼻涕肺部有声是怎么回事",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom) WHERE n.name IN ['咳嗽', '流鼻涕', '肺部有声'] RETURN m"
    },
    {
        "input": "食管癌的饮食注意什么",
        "cypher": "MATCH (m:Disease {name: '食管癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "我想了解子宫肌瘤会有哪些影响",
        "cypher": "MATCH (m:Disease {name: '子宫肌瘤'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "糖尿病是否可以康复呢？",
        "cypher": "MATCH (n:Disease {name:'糖尿病'}) RETURN n.cured_prob"
    },
    {
        "input": "卵巢早衰",
        "cypher": "MATCH (m:Disease {name: '卵巢早衰'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "每次睡醒后总是心慌是什么原因",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '心慌' RETURN d.name, d.cause"
    },
    {
        "input": "输尿管结石去哪儿治疗好",
        "cypher": "MATCH (v1:Disease {name: '输尿管结石'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "小儿血管瘤怎么回事？",
        "cypher": "MATCH (m:Disease {name:'小儿血管瘤'}) RETURN m"
    },
    {
        "input": "手足口病要禁吃什么？",
        "cypher": "MATCH (m:Disease {name:'手足口病'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "要怎么预防十二指肠类癌?",
        "cypher": "MATCH (n:Disease {name: '十二指肠类癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "孩子有多动症饮食要注意什么呢？",
        "cypher": "MATCH (m:Disease {name:'多动症'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "输尿管结石有多大",
        "cypher": "MATCH (m:Disease {name: '输尿管结石'}) RETURN m.get_prob"
    },
    {
        "input": "臂丛神经损伤的中药治疗怎么样",
        "cypher": "MATCH (d:Disease {name: '臂丛神经损伤'}) RETURN d.cure_way"
    },
    {
        "input": "怀孕前三个月没吃叶酸对胎儿有影响吗",
        "cypher": "MATCH (d:Disease {name: '叶酸缺乏症'}) RETURN d.easy_get"
    },
    {
        "input": "肠套叠缓解后还会复发吗？",
        "cypher": "MATCH (m:Disease {name:'肠套叠'}) RETURN m.cure_lasttime"
    },
    {
        "input": "滴虫性阴道炎都去哪治",
        "cypher": "MATCH (v1:Disease {name: '滴虫性阴道炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "排卵期出血后同房三天外射会怀孕吗？",
        "cypher": "MATCH (d:Disease {name: '排卵期出血'}) RETURN d.cure_way"
    },
    {
        "input": "体检前列腺囊肿没查出是怎么回事？",
        "cypher": "MATCH (m:Disease {name: '前列腺囊肿'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "小儿发烧是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'小儿发烧'}) RETURN m.get_way"
    },
    {
        "input": "青春期的孩子也会得神经衰弱吗?",
        "cypher": "MATCH (d:Disease {name: '神经衰弱'}) RETURN d.easy_get"
    },
    {
        "input": "引起包皮龟头炎的因素有哪些？",
        "cypher": "MATCH (m:Disease {name:'包皮龟头炎'}) RETURN m.cause"
    },
    {
        "input": "退烧后身上有湿疹该怎么办",
        "cypher": "MATCH (d:Disease {name: '湿疹'}) RETURN d.cure_way"
    },
    {
        "input": "孩子上呼吸道感染治愈后还会反复吗",
        "cypher": "MATCH (d:Disease {name: '上呼吸道感染'}) RETURN d.cure_way"
    },
    {
        "input": "外阴癌扩散怎么办？",
        "cypher": "MATCH (d:Disease {name: '外阴癌'}) RETURN d.cure_way"
    },
    {
        "input": "脑血栓治疗需要配合什么药物输液",
        "cypher": "MATCH (v1:Disease {name: '脑血栓'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "非骨化性纤维瘤能自愈吗？",
        "cypher": "MATCH (m:Disease {name:'非骨化性纤维瘤'}) RETURN m.cured_prob"
    },
    {
        "input": "得了肾结石了都会有哪些症状呢？",
        "cypher": "MATCH (m:Disease {name:'肾结石'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "经常失眠吃哪些中药比较好",
        "cypher": "MATCH (v1:Disease {name: '失眠'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "股外侧皮神经炎能治好吗？",
        "cypher": "MATCH (d:Disease {name: '股外侧皮神经炎'}) RETURN d.cure_way"
    },
    {
        "input": "甲亢全套检查多少费用",
        "cypher": "MATCH (v:Disease {name: '甲亢'})-[:need_check]->(v2:Check) RETURN v2.name AS name, v2.cost_money AS cost_money"
    },
    {
        "input": "为什么孩子一感冒很容易就发烧",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom {name:'发烧'}) RETURN m.cause"
    },
    {
        "input": "大动脉炎怎么尽快缓解？",
        "cypher": "MATCH (d:Disease {name: '大动脉炎'}) RETURN d.cure_way"
    },
    {
        "input": "怀孕有淋病有影响吗",
        "cypher": "MATCH (d:Disease {name: '淋病'}) RETURN d.easy_get"
    },
    {
        "input": "如何预防乳腺增生及乳腺癌",
        "cypher": "MATCH (d:Disease {name: '乳腺增生'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称, d.prevent AS 预防措施"
    },
    {
        "input": "如何减轻或治疗大肠癌？",
        "cypher": "MATCH (d:Disease {name: '大肠癌'}) RETURN d.cure_way"
    },
    {
        "input": "该怎么样检查确定患结肠息肉？",
        "cypher": "MATCH (m:Disease {name:'结肠息肉'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "孩子过敏性鼻炎吃益生菌可以治疗吗？",
        "cypher": "MATCH (d:Disease {name: '过敏性鼻炎'}) RETURN d.cure_way"
    },
    {
        "input": "子宫肌瘤问题要做什么检查",
        "cypher": "MATCH (v1:Disease {name: '子宫肌瘤'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "早泄医院看病需要多少钱",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:belongs_to]->(v2:Department) RETURN v2.name AS name, v1.cost_money AS cost_money"
    },
    {
        "input": "八个月宝宝得了病毒性上呼吸道感染一直退不了怎",
        "cypher": "MATCH (d:Disease {name: '病毒性上呼吸道感染'}) RETURN d.cure_way"
    },
    {
        "input": "儿童腺样体肥大有什么偏方",
        "cypher": "MATCH (d:Disease {name: '儿童腺样体肥大'}) RETURN d.cure_way"
    },
    {
        "input": "流产一个月来月经黑色怎么办？",
        "cypher": "MATCH (m:Disease {name:'流产'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "截瘫后性功能没有以前那么好了怎么办？",
        "cypher": "MATCH (d:Disease {name: '截瘫'}) RETURN d.cure_way"
    },
    {
        "input": "间质性膀胱炎能治得好吗",
        "cypher": "MATCH (d:Disease {name: '间质性膀胱炎'}) RETURN d.cure_way"
    },
    {
        "input": "被兔子咬了个口子，要不要注射狂犬病役苗",
        "cypher": "MATCH (d:Disease {name: '狂犬病'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "十二指肠溃疡复发如何治疗好",
        "cypher": "MATCH (d:Disease {name: '十二指肠溃疡'}) RETURN d.cure_way"
    },
    {
        "input": "我的包皮好像有点过长？",
        "cypher": "MATCH (m:Disease {name: '包皮过长'}) RETURN m"
    },
    {
        "input": "宝宝母乳性黄疸该如何治",
        "cypher": "MATCH (d:Disease {name: '母乳性黄疸'}) RETURN d.cure_way"
    },
    {
        "input": "什么是癫痫疾病?",
        "cypher": "MATCH (n:Disease {name: '癫痫'}) RETURN n"
    },
    {
        "input": "面瘫需要忌口吗?",
        "cypher": "MATCH (m:Disease {name:'面瘫'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "直肠炎食疗菜谱",
        "cypher": "MATCH (v1:Disease {name: '直肠炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "外阴炎一般会是性病吗？",
        "cypher": "MATCH (m:Disease {name:'外阴炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "治癌症早期会有哪些症状呢",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "治疗鼻咽癌要多少钱",
        "cypher": "MATCH (n:Disease {name: '鼻咽癌'}) RETURN n.cost_money"
    },
    {
        "input": "甲亢严重么去北京哪里治疗比较好？",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "新生儿黄疸反复用什么药物可以缓解",
        "cypher": "MATCH (v1:Disease {name: '新生儿黄疸'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "被剪刀扎进手掌虎口血流的较多这样需要打破伤风",
        "cypher": "MATCH (n:Disease {name:'破伤风'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "是否是阴茎癌",
        "cypher": "MATCH (m:Disease {name: '阴茎癌'}) RETURN m"
    },
    {
        "input": "子宫内膜息肉分泌欠佳影响怀孕吗？",
        "cypher": "MATCH (m:Disease {name:'子宫内膜息肉'}) RETURN m.desc"
    },
    {
        "input": "月经不调日期还是比较准，偶尔有提前",
        "cypher": "MATCH (m:Disease {name: '月经不调'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "肋间神经痛是怎么回事？对身体有危害没有？",
        "cypher": "MATCH (m:Disease {name:'肋间神经痛'}) RETURN m.get_prob,m.cause"
    },
    {
        "input": "脑梗死最新分期是什么？",
        "cypher": "MATCH (n:Disease) WHERE n.name = '脑梗死' RETURN n.desc"
    },
    {
        "input": "宝宝白天咳嗽不厉害晚上厉害怎么办",
        "cypher": "MATCH (m:Disease {name:'咳嗽'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "我想咨询什么是宫外孕呢？",
        "cypher": "MATCH (m:Disease {name:'宫外孕'}) RETURN m.name, m.desc"
    },
    {
        "input": "治疗输卵管粘连费用一般要多少",
        "cypher": "MATCH (n:Disease {name:'输卵管粘连'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "您好，我在湖南湘雅初步诊断是肺动脉高压，肺高",
        "cypher": "MATCH (d:Disease {name: '肺动脉高压'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "六个月孩子眼睛红为什么",
        "cypher": "MATCH (d:Disease {name: '红眼病'}) RETURN d.easy_get"
    },
    {
        "input": "贲门癌的症状有哪些",
        "cypher": "MATCH (m:Disease {name:'贲门癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "6岁女孩4岁时查出肺炎现经常咳嗽该用什么药才",
        "cypher": "MATCH (n:Disease {name: '肺炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "宫颈癌疾病的主要病因有哪些？",
        "cypher": "MATCH (n:Disease {name: '宫颈癌'}) RETURN n.cause"
    },
    {
        "input": "死精症会遗传给下一代吗",
        "cypher": "MATCH (n:Disease {name: '死精症'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "包皮水肿导致的危害",
        "cypher": "MATCH (m:Disease {name:'包皮水肿'})-[:acompany_with]->(n:Disease) RETURN n.name AS name"
    },
    {
        "input": "1.58米的标准体重如何计算",
        "cypher": "MATCH (v:Disease)-[e:belongs_to]->(v2:Department) WHERE v2.name = '内分泌科' RETURN v2.name"
    },
    {
        "input": "什么样的人容易得骨癌",
        "cypher": "MATCH (d:Disease {name: '骨癌'}) RETURN d.easy_get"
    },
    {
        "input": "胆结石医院哪家好",
        "cypher": "MATCH (v1:Disease {name: '胆结石'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肠胃炎患者吃什么饭比较好",
        "cypher": "MATCH (v1:Disease {name: '肠胃炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "手凉是肾虚吗",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '手凉' RETURN n.name"
    },
    {
        "input": "系统性红斑狼疮如何控制病情要怎样做",
        "cypher": "MATCH (d:Disease {name: '系统性红斑狼疮'}) RETURN d.cure_way"
    },
    {
        "input": "尿频是得了前列腺囊肿吗？",
        "cypher": "MATCH (m:Disease {name:'前列腺囊肿'})-[:has_symptom]->(n:Symptom {name:'尿频'}) RETURN m,n"
    },
    {
        "input": "外痔的早期症状是什么样的",
        "cypher": "MATCH (m:Disease {name:'外痔'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脑血管畸形手术后遗症有哪些以后还能正常吗",
        "cypher": "MATCH (m:Disease {name:'脑血管畸形'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "气管肿瘤饮食方面应注意什么？",
        "cypher": "MATCH (m:Disease {name: '气管肿瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "甲亢疾病是由什么引起",
        "cypher": "MATCH (n:Disease {name: '甲亢'})-[:acompany_with]-(m:Disease) RETURN m.cause"
    },
    {
        "input": "神经症如何心理治疗",
        "cypher": "MATCH (d:Disease {name: '神经症'}) RETURN d.cure_way"
    }
]