[
    {
        "input": "肝性脑病白醋灌肠浓度？",
        "cypher": "MATCH (d:Disease {name: '肝性脑病'}) RETURN d.cure_way"
    },
    {
        "input": "为什么会经常心慌",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name CONTAINS '心慌' RETURN m.name AS diseaseName, COLLECT(n.name) AS symptomName"
    },
    {
        "input": "前列腺就诊能区分癌和增生吗",
        "cypher": "MATCH (n:Disease {name: '前列腺癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "西安骨髓瘤治疗医院是哪家，多发性骨髓瘤晚期",
        "cypher": "MATCH (v1:Disease {name: '多发性骨髓瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "颞叶癫痫吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '颞叶癫痫'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "前列腺囊肿是什么？开封协和怎样",
        "cypher": "MATCH (n:Disease {name:'前列腺囊肿'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "我爸做了胃穿孔手术一个月了 这几天老是说痛",
        "cypher": "MATCH (n:Disease {name: '胃穿孔'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "腹痛是不是宫外孕啊",
        "cypher": "MATCH (m:Disease {name:'宫外孕'})-[:has_symptom]->(n:Symptom {name:'腹痛'}) RETURN m,n"
    },
    {
        "input": "睾丸癌的原由一般是什么",
        "cypher": "MATCH (m:Disease {name: '睾丸癌'}) RETURN m.cause"
    },
    {
        "input": "月经量少已经有一年多了是怎么回事？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'月经量少'}) RETURN m.name"
    },
    {
        "input": "性功能障碍的患者要注意什么呢？",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "怎样检查早泄比较明显？",
        "cypher": "MATCH (m:Disease {name:'早泄'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "高血压吃哪种药好啊怎么治疗更好呢？",
        "cypher": "MATCH (m:Disease {name:'高血压'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": " 三十五年前检查出肾炎想哪家医院比较好 ",
        "cypher": "MATCH (n:Disease {name: '肾炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "前列腺炎复发后、？",
        "cypher": "MATCH (v1:Disease {name: '前列腺炎'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "宫颈糜烂做过手术会复发吗？",
        "cypher": "MATCH (n:Disease {name: '宫颈糜烂'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "月经不调检查项目多少钱",
        "cypher": "MATCH (v1:Disease {name: '月经不调'})-[:need_check]->(v2:Check) RETURN v2.name, v2.cost_money"
    },
    {
        "input": "乳头内陷?",
        "cypher": "MATCH (m:Disease {name: '乳头内陷'}) RETURN m"
    },
    {
        "input": "如何才能确诊弱智的情况呢",
        "cypher": "MATCH (m:Disease {name:'弱智'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "视神经萎缩有哪些症状",
        "cypher": "MATCH (m:Disease {name: '视神经萎缩'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "前庭神经炎用什么药？",
        "cypher": "MATCH (v1:Disease {name: '前庭神经炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肝脏血管瘤会不会遗传给胎儿？",
        "cypher": "MATCH (d:Disease {name: '肝脏血管瘤'}) RETURN d.easy_get"
    },
    {
        "input": "脑血管畸形术后能用药康复吗？",
        "cypher": "MATCH (v1:Disease {name: '脑血管畸形'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "吃完避孕药之后可以喝豆浆吗？",
        "cypher": "MATCH (v1:Disease)-[e1:no_eat]->(v2:Food) WHERE v2.name = '豆浆' RETURN v1.name"
    },
    {
        "input": "我父亲今年54岁最近还被确认是膀胱癌中晚期咋",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'})-[:belongs_to]->(d:Department) RETURN d.name AS 科室名称"
    },
    {
        "input": "脑血管畸形伽玛刀手术会复发吗？",
        "cypher": "MATCH (d:Disease {name: '脑血管畸形'}) RETURN d.cure_way"
    },
    {
        "input": "这样下去会好吗?是否可以治好乙肝？",
        "cypher": "MATCH (m:Disease {name:'乙肝'}) RETURN m.cured_prob"
    },
    {
        "input": "额叶癫痫如何诊断",
        "cypher": "MATCH (m:Disease {name:'额叶癫痫'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "乙肝两对半五项全是阴性严重吗？",
        "cypher": "MATCH (m:Disease {name:'乙肝'})-[:acompany_with]->(n:Disease) RETURN m.name,n.name"
    },
    {
        "input": "哪些症状预示已经得了直肠癌",
        "cypher": "MATCH (v1:Disease {name: '直肠癌'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "宝宝为什么会突然疝气？",
        "cypher": "MATCH (m:Disease {name:'疝气'})<-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "中医是怎么治疗骨髓炎的",
        "cypher": "MATCH (d:Disease {name: '骨髓炎'}) RETURN d.cure_way"
    },
    {
        "input": "面肌痉挛缓解费用？",
        "cypher": "MATCH (m:Disease {name:'面肌痉挛'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "癫痫的早期症状有哪些？癫痫的症状是什么？",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脑梗死饮食上要注意什么",
        "cypher": "MATCH (v1:Disease {name: '脑梗死'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "脑震荡吃点什么好？",
        "cypher": "MATCH (v1:Disease {name: '脑震荡'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "小儿脑瘫医缓解需要多少钱呢？",
        "cypher": "MATCH (n:Disease {name: '小儿脑瘫'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "动脉导管未闭有哪些治疗方法",
        "cypher": "MATCH (d:Disease {name: '动脉导管未闭'}) RETURN d.cure_way"
    },
    {
        "input": "急性肠炎几天能好呢？",
        "cypher": "MATCH (m:Disease {name:'急性肠炎'}) RETURN m.cure_lasttime"
    },
    {
        "input": "长了痔疮会严重吗",
        "cypher": "MATCH (m:Disease {name: '痔疮'}) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率"
    },
    {
        "input": "晚上老是遗精正常吗？",
        "cypher": "MATCH (m:Disease {name:'遗精'}) RETURN m.get_prob"
    },
    {
        "input": "风湿热是什么意思？",
        "cypher": "MATCH (m:Disease {name:'风湿热'}) RETURN m.name,m.desc"
    },
    {
        "input": "得了子宫肉瘤怎么办咋缓解？",
        "cypher": "MATCH (d:Disease {name: '子宫肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "我儿子7岁了，20天前感冒发烧打了几针后烧退",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '发烧' RETURN n.name"
    },
    {
        "input": "急性播散性脑脊髓炎是如何感染?",
        "cypher": "MATCH (n:Disease {name: '急性播散性脑脊髓炎'})-[:acompany_with]->(m:Disease) RETURN m.get_way"
    },
    {
        "input": "肉芽肿性前列腺炎发病概率大不大",
        "cypher": "MATCH (n:Disease {name: '肉芽肿性前列腺炎'}) RETURN n.get_prob"
    },
    {
        "input": "三叉神经痛是什么情况",
        "cypher": "MATCH (m:Disease {name: '三叉神经痛'}) RETURN m"
    },
    {
        "input": "护理胰腺癌要注意什么",
        "cypher": "MATCH (m:Disease {name: '胰腺癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "想问下癌症会传染吗",
        "cypher": "MATCH (m:Disease {name:'癌症'}) RETURN m.get_way"
    },
    {
        "input": "孩子是九岁得的癫痫停药癫痫发作该怎么办？",
        "cypher": "MATCH (d:Disease {name: '癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "乙肝能正常参加入职体检吗？",
        "cypher": "MATCH (n:Disease {name:'乙肝'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "吃什么对阴道会有好处",
        "cypher": "MATCH (v1:Disease)-[v2:do_eat]->(v3:Food) WHERE v1.name = '阴道炎' RETURN v3.name"
    },
    {
        "input": "脑炎后遗症经常犯病要吃什么药物",
        "cypher": "MATCH (v1:Disease {name: '脑炎后遗症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "怀孕21周查出脑积水和子宫肌瘤怎么办？",
        "cypher": "MATCH (m:Disease {name:'脑积水'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "如何才能彻底治愈特发性血小板减少性紫癜？",
        "cypher": "MATCH (d:Disease {name: '特发性血小板减少性紫癜'}) RETURN d.cure_way"
    },
    {
        "input": "尿道炎会导致发烧吗",
        "cypher": "MATCH (m:Disease {name: '尿道炎'})-[:has_symptom]->(n:Symptom) WHERE n.name = '发烧' RETURN m.name"
    },
    {
        "input": "乳腺癌应该怎样预防呢？",
        "cypher": "MATCH (n:Disease {name: '乳腺癌'}) RETURN n.prevent"
    },
    {
        "input": "阴道痉挛有什么办法",
        "cypher": "MATCH (d:Disease {name: '阴道痉挛'}) RETURN d.cure_way"
    },
    {
        "input": "宝宝4个多月消化不好要提供辅食吗",
        "cypher": "MATCH (d:Disease {name: '消化不良'}) RETURN d.easy_get"
    },
    {
        "input": "风湿性心脏病都有什么表现呢？",
        "cypher": "MATCH (m:Disease {name:'风湿性心脏病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "前列腺炎有异味是性病么？",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "肾积水该吃些什么药？",
        "cypher": "MATCH (v1:Disease {name: '肾积水'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脑外伤引起的癫痫会遗传下一代吗？",
        "cypher": "MATCH (d:Disease {name: '脑外伤'}) RETURN d.easy_get"
    },
    {
        "input": "直肠癌检查怎么挂号",
        "cypher": "MATCH (v1:Disease {name: '直肠癌'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "雷诺氏病该如何医治？",
        "cypher": "MATCH (d:Disease {name: '雷诺氏病'}) RETURN d.cure_way"
    },
    {
        "input": "风湿热吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '风湿热'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "急性胰腺炎病情厉害吗",
        "cypher": "MATCH (m:Disease {name:'急性胰腺炎'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "肝病的传染性强不强",
        "cypher": "MATCH (v1:Disease {name: '肝病'}) RETURN v1.get_way"
    },
    {
        "input": "宫颈癌不能吃什么东西",
        "cypher": "MATCH (v1:Disease {name: '宫颈癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "死精症是由什么引起的呢",
        "cypher": "MATCH (m:Disease {name:'死精症'}) RETURN m.cause"
    },
    {
        "input": "甲亢引起的病症有什么",
        "cypher": "MATCH (v1:Disease {name: '甲亢'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "尿毒症能活多少时间",
        "cypher": "MATCH (n:Disease {name: '尿毒症'}) RETURN n.cure_lasttime"
    },
    {
        "input": "苯丙酮尿症多少为阳性？",
        "cypher": "MATCH (m:Disease {name:'苯丙酮尿症'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "直肠癌治愈几率大不大",
        "cypher": "MATCH (n:Disease {name: '直肠癌'}) RETURN n.cured_prob"
    },
    {
        "input": "肝硬化腹水初期症状",
        "cypher": "MATCH (d:Disease {name: '肝硬化腹水'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "直肠癌伴有肝转移不能手术的病人要怎么做？",
        "cypher": "MATCH (d:Disease {name: '直肠癌'}) RETURN d.cure_way"
    },
    {
        "input": "甲状腺肿瘤患者参与qq群：87488547",
        "cypher": "MATCH (d:Disease {name: '甲状腺肿瘤'}) RETURN d.easy_get"
    },
    {
        "input": "气管肿瘤可以切除吗",
        "cypher": "MATCH (d:Disease {name: '气管肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "在医院治疗前列腺增生花多少钱",
        "cypher": "MATCH (v1:Disease {name: '前列腺增生'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "帕金森患者需要控制体重吗",
        "cypher": "MATCH (d:Disease {name: '帕金森病'}) RETURN d.easy_get"
    },
    {
        "input": "肠梗阻的预防与治疗注意啥？",
        "cypher": "MATCH (m:Disease {name:'肠梗阻'}) RETURN m.prevent"
    },
    {
        "input": "三叉神经痛怎么办啊用什么药膏三叉神经痛怎么治",
        "cypher": "MATCH (m:Disease {name:'三叉神经痛'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "怎样判断是血管瘤还是血管畸形",
        "cypher": "MATCH (m:Disease {name:'血管瘤'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "我岳父得了阴茎癌，去年做了环切手术，今年",
        "cypher": "MATCH (d:Disease {name: '阴茎癌'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "颈椎病症状是什么？如何治疗更好",
        "cypher": "MATCH (v1:Disease {name: '颈椎病'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "预防包皮过长是如何防治的呢",
        "cypher": "MATCH (m:Disease {name:'包皮过长'}) RETURN m.pevent"
    },
    {
        "input": "是痔疮还是直肠癌？！",
        "cypher": "MATCH (m:Disease {name: '痔疮'})-[:has_symptom]->(n:Symptom) RETURN m.name, collect(n.name)"
    },
    {
        "input": "先兆流产一般要怎样预防？",
        "cypher": "MATCH (n:Disease {name: '先兆流产'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "甲状腺癌的复发几率大吗？",
        "cypher": "MATCH (n:Disease {name: '甲状腺癌'}) RETURN n.cured_prob"
    },
    {
        "input": "视网膜毛细血管血管瘤怎么治？",
        "cypher": "MATCH (d:Disease {name: '视网膜毛细血管血管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "痔疮病人都有哪些是需要注意的",
        "cypher": "MATCH (v1:Disease {name: '痔疮'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "吸入性肺炎怎么治疗啊?",
        "cypher": "MATCH (d:Disease {name: '吸入性肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "痔疮应该做哪些检查",
        "cypher": "MATCH (v1:Disease {name: '痔疮'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "糖尿病需要哪些检查报告？",
        "cypher": "MATCH (m:Disease {name:'糖尿病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "宫颈癌与哪些因素相关?",
        "cypher": "MATCH (m:Disease {name: '宫颈癌'})-[]->(n) RETURN n"
    },
    {
        "input": "检查后医生告诉我说是恶性胸腔积液，我比较担心",
        "cypher": "MATCH (m1:Disease {name: '恶性胸腔积液'}) RETURN m1.cure_lasttime AS 治疗周期, m1.cured_prob AS 治愈率, m1.cost_money AS 费"
    },
    {
        "input": "治疗进行性肌营养不良症",
        "cypher": "MATCH (d:Disease {name: '进行性肌营养不良症'}) RETURN d.cure_way"
    },
    {
        "input": "肝囊肿10mm严重吗",
        "cypher": "MATCH (m:Disease {name: '肝囊肿'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率"
    },
    {
        "input": "肝血管肉瘤能否再次介入治疗？",
        "cypher": "MATCH (d:Disease {name: '肝血管肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "宝晚上咳得特别厉害如何缓解",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '咳嗽' RETURN d.name, d.desc, d.prevent, d.cause, d.get_prob, d.get"
    },
    {
        "input": "脑血栓脑梗死脑阻塞都有哪些症状",
        "cypher": "MATCH (m:Disease {name:'脑血栓'})-[:has_symptom]->(n:Symptom) RETURN m.name,collect(n.name)"
    },
    {
        "input": "我爸爸脑出血二次中风,脑出血引起肺部感染",
        "cypher": "MATCH (d:Disease {name: '脑出血'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "胃溃疡的早期症状",
        "cypher": "MATCH (d:Disease {name: '胃溃疡'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "请问治疗甲状腺结节哪家医院好",
        "cypher": "MATCH (n:Disease {name:'甲状腺结节'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "想知道这是什么类型的龟头炎？",
        "cypher": "MATCH (m:Disease {name: '龟头炎'}) RETURN m.desc"
    },
    {
        "input": "结肠癌门诊病历如何看",
        "cypher": "MATCH (v1:Disease {name: '结肠癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "外阴纤维肉瘤可以吃什么食物调节？",
        "cypher": "MATCH (m:Disease {name:'外阴纤维肉瘤'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "新生儿缺氧缺的血脑病怎么办？",
        "cypher": "MATCH (d:Disease {name: '新生儿缺氧缺血性脑病'}) RETURN d.cure_way"
    },
    {
        "input": "腰肌劳损改怎么治疗才是比较合适的",
        "cypher": "MATCH (d:Disease {name: '腰肌劳损'}) RETURN d.cure_way"
    },
    {
        "input": "为什么早上单吃稀饭（配点肉松），胃会经常反酸",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '反酸' RETURN n.name"
    },
    {
        "input": "恶心是为什么",
        "cypher": "MATCH (m:Symptom {name:'恶心'})-[:has_symptom]-(n:Disease) RETURN n.name"
    },
    {
        "input": "哮喘术后复发概率大不大",
        "cypher": "MATCH (n:Disease {name: '哮喘'})-[:acompany_with]->(m:Disease) RETURN m.cured_prob"
    },
    {
        "input": "小孩感冒流鼻涕怎么做才好",
        "cypher": "MATCH (d:Disease {name: '感冒'})-[:has_symptom]->(s:Symptom {name: '流鼻涕'}) RETURN d, s"
    },
    {
        "input": "在检查乙肝两对半的结果中一、五项呈阳性，是什",
        "cypher": "MATCH (m:Disease {name:'乙肝'})-[:need_check]->(n:Check {name:'乙肝两对半'}) RETURN n.name"
    },
    {
        "input": "月经期间有性关系会得阴道炎吗？",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "新生儿黄疸怎么看是生理性还是病理性？",
        "cypher": "MATCH (m1:Disease {name: '新生儿黄疸'})-[:has_symptom]->(m2:Symptom) RETURN m2.name"
    },
    {
        "input": "轻度脂肪肝、双肾小结石、三酯高",
        "cypher": "MATCH (d:Disease {name:'轻度脂肪肝'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "肠癌患者术后有哪些禁忌",
        "cypher": "MATCH (v1:Disease {name: '肠癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾结石身体会怕凉吗",
        "cypher": "MATCH (d:Disease {name: '肾结石'}) RETURN d.easy_get"
    },
    {
        "input": "输尿管结石，现在小便感觉有石头挡住！尿不",
        "cypher": "MATCH (m:Disease {name: '输尿管结石'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "异位胰腺怎么切除",
        "cypher": "MATCH (d:Disease {name: '异位胰腺'}) RETURN d.cure_way"
    },
    {
        "input": "肾囊肿是怎么样的？",
        "cypher": "MATCH (n:Disease {name:'肾囊肿'}) RETURN n"
    },
    {
        "input": "直肠癌与痔疮的区别有哪些",
        "cypher": "MATCH (m1:Disease {name: '直肠癌'})-[:acompany_with]-(m2:Disease {name: '痔疮'}) RETURN m1,m2"
    },
    {
        "input": "鼻咽癌复发会发生什么症状",
        "cypher": "MATCH (m:Disease {name: '鼻咽癌'})-[:acompany_with]->(n:Disease)-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "怎么治疗褥疮",
        "cypher": "MATCH (d:Disease {name: '褥疮'}) RETURN d.cure_way"
    },
    {
        "input": "有点担心，这个是糖尿病吗？",
        "cypher": "MATCH (m:Disease {name:'糖尿病'}) RETURN m"
    },
    {
        "input": "得了附睾炎影响不育吗？",
        "cypher": "MATCH (m:Disease {name:'附睾炎'}) RETURN m.desc"
    },
    {
        "input": "血小板减少性紫癜必须要做手术吗",
        "cypher": "MATCH (d:Disease {name: '血小板减少性紫癜'}) RETURN d.cure_way"
    },
    {
        "input": "男性不育症饮食上的注意事项是什么？",
        "cypher": "MATCH (n:Disease {name: '男性不育症'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "蛛网膜下腔出血治疗多久好",
        "cypher": "MATCH (d:Disease {name: '蛛网膜下腔出血'}) RETURN d.cure_way"
    },
    {
        "input": "患老年便秘，久治不愈该做哪些检查",
        "cypher": "MATCH (v1:Disease {name: '老年便秘'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "我是哮喘还肺部有问题?",
        "cypher": "MATCH (d:Disease {name: '哮喘'})-[:acompany_with]->(dd:Disease) RETURN dd.name"
    },
    {
        "input": "妊娠期糖尿病吃什么？",
        "cypher": "MATCH (m:Disease {name:'妊娠期糖尿病'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "排卵期出血需注意哪些事项",
        "cypher": "MATCH (v1:Disease {name: '排卵期出血'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "小孩过敏性鼻炎是什么表现症状的？",
        "cypher": "MATCH (m:Disease {name:'过敏性鼻炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "治疗早泄的费用估计是多少",
        "cypher": "MATCH (n:Disease {name:'早泄'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "要怎样才绝不会再次出现这样的情况？",
        "cypher": "MATCH (m:Disease {name:'心脏病'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "甲状腺囊肿的症状是什么",
        "cypher": "MATCH (m:Disease {name:'甲状腺囊肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我49岁一年前诊刮手术后绝经怎么办",
        "cypher": "MATCH (d:Disease {name: '绝经'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "我三十二年前检查出肾炎，想咨询哪家医院比较好",
        "cypher": "MATCH (d:Disease {name: '肾炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "头晕、胃胀、便血是什么症状？",
        "cypher": "MATCH (m:Symptom {name:'头晕'})-[:has_symptom]-(d:Disease) RETURN d.name"
    },
    {
        "input": "妊娠期糖尿病可以用什么药？？",
        "cypher": "MATCH (n:Disease {name: '妊娠期糖尿病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "流产能检查出来么？",
        "cypher": "MATCH (m:Disease {name:'流产'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "幽门螺杆菌感染如何处理",
        "cypher": "MATCH (d:Disease {name: '幽门螺杆菌感染'}) RETURN d.cure_way"
    },
    {
        "input": "早泄是不是性功能障碍呢?",
        "cypher": "MATCH (n:Disease {name: '早泄'})-[:acompany_with]-(m:Disease {name: '性功能障碍'}) RETURN m"
    },
    {
        "input": "贫血脑供血不足怎么补？",
        "cypher": "MATCH (m:Disease {name:'贫血'})-[:belongs_to]->(n:Department) RETURN m.cureWay"
    },
    {
        "input": "若一年发作一次，这类癫痫也需马上治疗吗？",
        "cypher": "MATCH (d:Disease {name: '癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "牙髓炎会不会转移？",
        "cypher": "MATCH (m:Disease {name: '牙髓炎'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "主动脉夹层治好率到底是多少?",
        "cypher": "MATCH (m:Disease {name:'主动脉夹层'}) RETURN m.cured_prob"
    },
    {
        "input": "癫痫吃药的话能好么？",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m.cure_lasttime,n.name"
    },
    {
        "input": "对于如何预防原发性腹膜炎",
        "cypher": "MATCH (m:Disease {name:'原发性腹膜炎'})-[:belongs_to]->(n:Department) RETURN m.prevent,n.name"
    },
    {
        "input": "刚怀孕吃了好多药对胎儿有影响吗？",
        "cypher": "MATCH (d:Disease {name: '药物中毒'}) RETURN d.easy_get"
    },
    {
        "input": "盆腔腹膜炎的症状都是什么？",
        "cypher": "MATCH (m:Disease {name:'盆腔腹膜炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "阳痿症状一般都有哪些？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '阳痿' RETURN n.name"
    },
    {
        "input": "甲状腺癌转移到肺，胸",
        "cypher": "MATCH (m:Disease {name: '甲状腺癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "颅内转移瘤都检查什么项目",
        "cypher": "MATCH (v1:Disease {name: '颅内转移瘤'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "肾囊肿可怕吗？",
        "cypher": "MATCH (n:Disease {name:'肾囊肿'})-[]->(m) RETURN m"
    },
    {
        "input": "包皮长期包住龟头是不是包皮过长？",
        "cypher": "MATCH (n:Disease {name:'包皮过长'}) RETURN n"
    },
    {
        "input": "小肠肿瘤要注意些什么？",
        "cypher": "MATCH (m:Disease {name:'小肠肿瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "疝气的症状都有些什么",
        "cypher": "MATCH (v1:Disease {name: '疝气'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "北京治疗脑性瘫痪医院哪家好啊？",
        "cypher": "MATCH (v1:Disease {name: '脑性瘫痪'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "滴虫性阴道炎导致的影响有什么",
        "cypher": "MATCH (v1:Disease {name: '滴虫性阴道炎'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "胃溃疡病历",
        "cypher": "MATCH (d:Disease {name: '胃溃疡'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "糜烂性胃炎饮食吃啥好",
        "cypher": "MATCH (v1:Disease {name: '糜烂性胃炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "孩子检查贫血要怎么办？",
        "cypher": "MATCH (m:Disease {name: '贫血'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "4岁男孩一年两次，癫痫微创手术能吃得消吗？",
        "cypher": "MATCH (d:Disease {name: '癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "肝脓肿的症状都有哪些",
        "cypher": "MATCH (m:Disease {name: '肝脓肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "癫痫遗传机率大吗",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:acompany_with]-(n:Disease) RETURN n.get_prob"
    },
    {
        "input": "小儿急性喉炎怎么防治",
        "cypher": "MATCH (d:Disease {name: '小儿急性喉炎'}) RETURN d.cure_way"
    },
    {
        "input": "登革出血热死亡率多少",
        "cypher": "MATCH (n:Disease {name: '登革出血热'}) RETURN n.cured_prob"
    },
    {
        "input": "引起脂肪肝原因是什么",
        "cypher": "MATCH (v1:Disease {name: '脂肪肝'})-[:acompany_with]-(v2:Disease) RETURN v2.cause"
    },
    {
        "input": "龟头炎，包皮炎已经很久了，最近才开始治疗",
        "cypher": "MATCH (d:Disease {name: '龟头炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "早期乳腺癌能检测出来吗？",
        "cypher": "MATCH (m:Disease {name:'早期乳腺癌'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "高血压心电图常见表现？",
        "cypher": "MATCH (m:Disease {name:'高血压'})-[:need_check]->(n:Check) WHERE n.name CONTAINS '心电图' RETURN n.name"
    },
    {
        "input": "系统性红斑狼疮能要孩子吗?",
        "cypher": "MATCH (d:Disease {name: '系统性红斑狼疮'}) RETURN d.easy_get"
    },
    {
        "input": "冠状动脉造影的费用",
        "cypher": "MATCH (v:Disease)-[e:need_check]->(v1:Check) WHERE v1.name = '冠状动脉造影' RETURN v.cost_money"
    },
    {
        "input": "脂肪肉瘤补充广泛切除手术后该如何进一步诊疗\n",
        "cypher": "MATCH (d:Disease {name: '脂肪肉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "苯丙酮尿症遗传有多大？",
        "cypher": "MATCH (m:Disease {name: '苯丙酮尿症'}) RETURN m.get_prob"
    },
    {
        "input": "周围神经炎如何治疗呢",
        "cypher": "MATCH (d:Disease {name: '周围神经炎'}) RETURN d.cure_way"
    },
    {
        "input": "妊娠期得糖尿病，生完宝宝后复查时血糖6.",
        "cypher": "MATCH (n:Disease {name: '妊娠期糖尿病'})-[:need_check]->(m:Check {name: '血糖'}) RETURN m.name AS 检查项目, n.get_prob AS 发"
    },
    {
        "input": "新生儿出生6天昨晚因黄疸高住院需要买保险吗？",
        "cypher": "MATCH (d:Disease {name: '新生儿黄疸'}) RETURN d.easy_get"
    },
    {
        "input": "甲状腺腺瘤的治疗都有哪一些方法可以解决呢？",
        "cypher": "MATCH (d:Disease {name: '甲状腺腺瘤'}) RETURN d.cure_way"
    },
    {
        "input": "支原体肺炎治愈后怎样中药调理提高免疫力？",
        "cypher": "MATCH (d:Disease {name: '支原体肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍指的有那些呢?",
        "cypher": "MATCH (m:Disease)-[r1:acompany_with]->(n:Disease) WHERE m.name = '性功能障碍' RETURN n.name"
    },
    {
        "input": "漏斗胸手术年龄一般是多大",
        "cypher": "MATCH (d:Disease {name: '漏斗胸'}) RETURN d.easy_get"
    },
    {
        "input": "较严重的支气管扩张有哪些药治疗比较有效一点呢",
        "cypher": "MATCH (n:Disease {name: '支气管扩张'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "胰腺炎有什么种类？",
        "cypher": "MATCH (m:Disease {name:'胰腺炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "治疗十二指肠炎的医院",
        "cypher": "MATCH (v1:Disease {name: '十二指肠炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "低血糖是怎么回事呀？",
        "cypher": "MATCH (m:Disease {name:'低血糖'}) RETURN m"
    },
    {
        "input": "内痔外痔都有如何用药",
        "cypher": "MATCH (v1:Disease {name: '内痔'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "心肌缺血并发症表现是什么？",
        "cypher": "MATCH (m:Disease {name: '心肌缺血'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "前列腺脓肿疾病患者可以吃什么食物",
        "cypher": "MATCH (v1:Disease {name: '前列腺脓肿'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "宝宝感冒了一到晚上就发烧怎么办",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom {name:'发烧'}) RETURN m.cureWay"
    },
    {
        "input": "患了弱视治不好会怎样",
        "cypher": "MATCH (m:Disease {name: '弱视'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "想知道自己的性功能是否正常怎么办？",
        "cypher": "MATCH (n:Disease {name:'性功能障碍'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "月经不调不能吃啥",
        "cypher": "MATCH (v1:Disease {name: '月经不调'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "习惯性流产的预防注意事项是啥",
        "cypher": "MATCH (n:Disease {name: '习惯性流产'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "31，男，糖尿病2年，每月有15天喝干啤，6",
        "cypher": "MATCH (d:Disease {name: '糖尿病'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "癌症属于重大疾病吗",
        "cypher": "MATCH (m:Disease {name:'癌症'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "怎样预防肝损伤发展",
        "cypher": "MATCH (d:Disease {name: '肝损伤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "胃病用什么药治疗?",
        "cypher": "MATCH (v1:Disease {name: '胃病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "结肠炎怎样预防呢",
        "cypher": "MATCH (m:Disease {name:'结肠炎'}) RETURN m.prevent"
    },
    {
        "input": "乳腺癌死亡率高吗",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'}) RETURN m.cured_prob"
    },
    {
        "input": "最严重的痔疮是哪种？",
        "cypher": "MATCH (m:Disease {name:'痔疮'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "发烧咳嗽，不想吃东西该怎么办",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '发烧' OR s.name = '咳嗽' OR s.name = '不想吃东西' RETURN d"
    },
    {
        "input": "前列腺到底要多少治疗费用",
        "cypher": "MATCH (n:Disease {name:'前列腺炎'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "得了内痔怎么看出来",
        "cypher": "MATCH (m:Disease {name: '内痔'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肝损伤的早期症状有哪些",
        "cypher": "MATCH (v1:Disease {name: '肝损伤'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "前庭大腺囊肿手术后高锰酸钾水坐浴用多长时间?",
        "cypher": "MATCH (d:Disease {name: '前庭大腺囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "乳腺结节有哪些注意事项吗",
        "cypher": "MATCH (m:Disease {name:'乳腺结节'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "细菌是生命体吗",
        "cypher": "MATCH (n:Disease) WHERE n.desc CONTAINS '细菌' RETURN n"
    },
    {
        "input": "风湿病痛症",
        "cypher": "MATCH (v1:Disease {name: '风湿病'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "慢性宫颈炎怎么检查?",
        "cypher": "MATCH (m:Disease {name:'慢性宫颈炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "脂肪肝转会发展成啥病",
        "cypher": "MATCH (v1:Disease {name: '脂肪肝'})-[:acompany_with]->(v2:Disease) RETURN v2.name"
    },
    {
        "input": "征兵体检说有多处肝血管瘤咋办",
        "cypher": "MATCH (m:Disease {name: '肝血管瘤'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "什么？是甲状腺血管瘤",
        "cypher": "MATCH (m1:Disease {name: '甲状腺血管瘤'}) RETURN m1"
    },
    {
        "input": "小儿癫痫发作诱发失语综合征怎样治疗？",
        "cypher": "MATCH (d:Disease {name: '小儿癫痫发作诱发失语综合征'}) RETURN d.cure_way"
    },
    {
        "input": "胃胀气，总是嗳气，想吐",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '胃胀气' OR s.name = '嗳气' OR s.name = '想吐' RETURN d"
    },
    {
        "input": "请问骨瘤和关节突出的区别是什么",
        "cypher": "MATCH (m:Disease {name:'骨瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "2岁宝宝患有颅咽管瘤 会抽搐吗",
        "cypher": "MATCH (m:Disease {name:'颅咽管瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "最近一直上火，牙疼，鼻子痛大便干燥，有时带血",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name IN ['上火', '牙疼', '鼻子痛', '大便干燥', '带血'] RETURN d"
    },
    {
        "input": "肺癌可能性大吗？",
        "cypher": "MATCH (m:Disease {name:'肺癌'}) RETURN m.get_prob"
    },
    {
        "input": "要接种宫颈癌九价疫苗吗",
        "cypher": "MATCH (m:Disease {name: '宫颈癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "医生阑尾炎手术后打的是什么药？",
        "cypher": "MATCH (v1:Disease {name: '阑尾炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "腹股沟疝宝宝手术治疗效果如何",
        "cypher": "MATCH (d:Disease {name: '腹股沟疝'}) RETURN d.cure_way"
    },
    {
        "input": "红斑狼疮的症状都有哪些？",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    }
]