[
    {
        "input": "小孩子得了支气管哮喘的症状是什么？",
        "cypher": "MATCH (m:Disease {name:'支气管哮喘'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "支气管哮喘病相关问答",
        "cypher": "MATCH (d:Disease {name: '支气管哮喘'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "什么是引起帕金森病的原因",
        "cypher": "MATCH (m:Disease {name: '帕金森病'}) RETURN m.cause"
    },
    {
        "input": "十二指肠炎的症状是什么样子的",
        "cypher": "MATCH (m:Disease {name:'十二指肠炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "卵巢癌腹腔化疗用什么药物好？",
        "cypher": "MATCH (v1:Disease {name: '卵巢癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "巧克力囊肿对女性都有哪些影响",
        "cypher": "MATCH (d:Disease {name: '巧克力囊肿'}) RETURN d.easy_get"
    },
    {
        "input": "下丘脑错构瘤会遗传吗？",
        "cypher": "MATCH (m:Disease {name: '下丘脑错构瘤'}) RETURN m.cause"
    },
    {
        "input": "弱智的主要症状表现是什么",
        "cypher": "MATCH (m:Disease {name:'弱智'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "包皮过长会引发哪些疾病",
        "cypher": "MATCH (m:Disease)-[r:acompany_with]-(n:Disease) WHERE m.name = '包皮过长' RETURN n.name"
    },
    {
        "input": "阴茎不能勃起导致性功能障碍怎么回事？",
        "cypher": "MATCH (m:Disease {name:'性功能障碍'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "小儿脑瘫饮食应该注意些什么？",
        "cypher": "MATCH (v1:Disease {name: '小儿脑瘫'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "胆管炎症状与治疗方法是什么？",
        "cypher": "MATCH (m:Disease {name: '胆管炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "什么原因患上细菌性阴道炎",
        "cypher": "MATCH (m:Disease {name:'细菌性阴道炎'})RETURN m.cause"
    },
    {
        "input": "得了膀胱癌吃什么好?",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "尿道癌早期能不能够用药物控制",
        "cypher": "MATCH (d:Disease {name: '尿道癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "脑震荡有什么症状？",
        "cypher": "MATCH (m:Disease {name:'脑震荡'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "得了精子畸形哪里治如何去缓解这状况？",
        "cypher": "MATCH (n:Disease {name: '精子畸形'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "4岁这半年晚上有7次流鼻血",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '流鼻血' RETURN m.name"
    },
    {
        "input": "内分泌失调怎么用药呀",
        "cypher": "MATCH (n:Disease {name: '内分泌失调'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "继发性高血压需要坐什么检查？",
        "cypher": "MATCH (m:Disease {name:'继发性高血压'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "脊髓内脓肿手术的风险是什么",
        "cypher": "MATCH (d:Disease {name: '脊髓内脓肿'}) RETURN d.cure_way"
    },
    {
        "input": "请问打肾结石的药有哪些",
        "cypher": "MATCH (v1:Disease {name: '肾结石'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脊髓肿瘤的病因有哪些呢？",
        "cypher": "MATCH (n:Disease {name: '脊髓肿瘤'}) RETURN n.cause"
    },
    {
        "input": "结节性甲状腺肿用什么药？",
        "cypher": "MATCH (m:Disease {name:'结节性甲状腺肿'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "治内分泌失调去哪治疗好",
        "cypher": "MATCH (v1:Disease {name: '内分泌失调'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "人工流产后来过一次大姨妈第二次怀孕了还能人流",
        "cypher": "MATCH (d:Disease {name: '人工流产'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "乳腺癌如何自己检查",
        "cypher": "MATCH (v1:Disease {name: '乳腺癌'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "乳腺囊肿疾病可以分别分为几级",
        "cypher": "MATCH (n:Disease {name: '乳腺囊肿'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "怎样治疗输卵管囊肿",
        "cypher": "MATCH (d:Disease {name: '输卵管囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "阴道痉挛请问有什么症状？",
        "cypher": "MATCH (m:Disease {name:'阴道痉挛'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "盆腔积液应该注意什么",
        "cypher": "MATCH (v1:Disease {name: '盆腔积液'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肝脏血管瘤挂什么科室",
        "cypher": "MATCH (v1:Disease {name: '肝脏血管瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "我奶奶有三叉神经痛一个多月了医生说现在很是严",
        "cypher": "MATCH (d:Disease {name: '三叉神经痛'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "球后视神经炎引起的视神经萎缩",
        "cypher": "MATCH (d:Disease {name: '球后视神经炎'})-[:acompany_with]->(v:Disease {name: '视神经萎缩'}) RETURN v"
    },
    {
        "input": "导致白血病的原因是什么？",
        "cypher": "MATCH (n:Disease {name: '白血病'}) RETURN n.cause"
    },
    {
        "input": "肝病专家解答乙肝并发症有哪些",
        "cypher": "MATCH (n1:Disease {name: '乙肝'})-[:acompany_with]->(n2:Disease) RETURN n2"
    },
    {
        "input": "直肠炎中西药都吃没有效果怎么治疗才好呢？？",
        "cypher": "MATCH (d:Disease {name: '直肠炎'}) RETURN d.cure_way"
    },
    {
        "input": "女性不孕不育就永远不能有自己的孩子了吗？",
        "cypher": "MATCH (d:Disease {name: '不孕不育'}) RETURN d.cure_way"
    },
    {
        "input": "有心脏刺痛的毛病怎么回事",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '心脏刺痛' RETURN m.name"
    },
    {
        "input": "病毒性脑膜炎有后遗症吗？",
        "cypher": "MATCH (n:Disease {name: '病毒性脑膜炎'})-[:acompany_with]-(m:Disease) RETURN m"
    },
    {
        "input": "小儿血管瘤发病原因有哪些？",
        "cypher": "MATCH (n:Disease {name: '小儿血管瘤'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "直肠癌白血球很低该用那种药？",
        "cypher": "MATCH (n:Disease {name: '直肠癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "胆管癌已切除胆囊应该注意哪些问题",
        "cypher": "MATCH (d:Disease {name: '胆管癌'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "治疗静脉炎的药物有哪些？",
        "cypher": "MATCH (v1:Disease {name: '静脉炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "诊断阑尾炎需要做哪些检查项目",
        "cypher": "MATCH (v1:Disease {name: '阑尾炎'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "老年人特发性肺纤维化有哪些症状",
        "cypher": "MATCH (m:Disease {name:'老年人特发性肺纤维化'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "间质性肾炎如何治好",
        "cypher": "MATCH (d:Disease {name: '间质性肾炎'}) RETURN d.cure_way"
    },
    {
        "input": "我今年20岁，还是处女，得了霉菌性阴道炎",
        "cypher": "MATCH (d:Disease {name: '霉菌性阴道炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "阴茎异常勃起和脑垂体有关系吗？",
        "cypher": "MATCH (m:Disease {name: '阴茎异常勃起'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "什么检查能清晰观察乳腺病情，对身体有害吗",
        "cypher": "MATCH (m:Disease {name: '乳腺病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "内痔检查需要什么手续",
        "cypher": "MATCH (v1:Disease {name: '内痔'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "想了解一下由冠心病引起的肠系膜血管栓塞的病前",
        "cypher": "MATCH (d:Disease {name: '冠心病'}) RETURN d.easy_get"
    },
    {
        "input": "因有脑血栓长期卧床皮肤流脓怎么办",
        "cypher": "MATCH (m:Disease {name:'脑血栓'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "有什么药能让膀胱癌者减小痛苦？",
        "cypher": "MATCH (v1:Disease {name: '膀胱癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "足月小样儿的身高什么?",
        "cypher": "MATCH (m:Disease {name:'足月小样儿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "为什么宝宝的支气管炎老是反复总也治不好？",
        "cypher": "MATCH (m:Disease {name:'支气管炎'})-[:acompany_with]->(n:Disease) RETURN m.cause,n.name"
    },
    {
        "input": "我有口臭不知道是什么原因",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '口臭' RETURN n.name"
    },
    {
        "input": "结肠息肉不治癌变怎么办",
        "cypher": "MATCH (m:Disease {name:'结肠息肉'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "喉上神经损伤的症状",
        "cypher": "MATCH (m:Disease {name:'喉上神经损伤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小儿脑瘫要怎么用药",
        "cypher": "MATCH (m:Disease {name:'小儿脑瘫'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "怎么检测动脉硬化",
        "cypher": "MATCH (m:Disease {name: '动脉硬化'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "小儿癫痫的危害是什么呢？",
        "cypher": "MATCH (m:Disease {name:'小儿癫痫'}) RETURN m.desc"
    },
    {
        "input": "得了急性化脓性乳腺炎要注意什么",
        "cypher": "MATCH (d:Disease {name: '急性化脓性乳腺炎'}) RETURN d.easy_get"
    },
    {
        "input": "侏儒症有哪些症状",
        "cypher": "MATCH (m:Disease {name:'侏儒症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "骨巨细胞瘤的治疗费用大概是多少",
        "cypher": "MATCH (n:Disease {name: '骨巨细胞瘤'}) RETURN n.cost_money"
    },
    {
        "input": "肾炎腰杆后面痛吃什么药",
        "cypher": "MATCH (v1:Disease {name: '肾炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "甲状腺肿瘤症状有哪些？如何治疗好？？",
        "cypher": "MATCH (m:Disease {name:'甲状腺肿瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "八个月宝宝患房间隔缺损该怎么治疗",
        "cypher": "MATCH (d:Disease {name: '房间隔缺损'}) RETURN d.cure_way"
    },
    {
        "input": "肿瘤疾病一般是怎么形成的",
        "cypher": "MATCH (n:Disease {name: '肿瘤'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "半年前睾丸在裤头里一走路就疼咋办？",
        "cypher": "MATCH (m:Disease {name:'睾丸炎'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "小孩得了血管瘤饮食方面应注意哪些细节？",
        "cypher": "MATCH (v1:Disease {name: '血管瘤'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "样会不会感染艾滋、乙肝、丙肝之类的？？",
        "cypher": "MATCH (m:Disease {name: '艾滋病'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "和乙肝病人同住一起会感染吗",
        "cypher": "MATCH (v1:Disease {name: '乙肝'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "内痔会自愈吗",
        "cypher": "MATCH (m:Disease {name:'内痔'}) RETURN m.cured_prob"
    },
    {
        "input": "血管炎病人日常饮食应多吃些什么..",
        "cypher": "MATCH (m:Disease {name: '血管炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "140算高血压吗？",
        "cypher": "MATCH (n:Disease {name: '高血压'})-[:need_check]->(m:Check {name: '血压'}) RETURN m.name AS name, m.value AS value"
    },
    {
        "input": "长期低烧该咋处理",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '低烧' RETURN d.name, d.prevent"
    },
    {
        "input": "关于精索静脉曲张",
        "cypher": "MATCH (m:Disease {name: '精索静脉曲张'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "结婚一年了总是不怀孕是怎么回事啊？",
        "cypher": "MATCH (m:Disease {name:'不孕不育'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "怎么治疗乳突炎",
        "cypher": "MATCH (d:Disease {name: '乳突炎'}) RETURN d.cure_way"
    },
    {
        "input": "月经末天同房感染阴道炎吊水塞药能一起吗？",
        "cypher": "MATCH (d:Disease {name: '阴道炎'}) RETURN d.cure_way"
    },
    {
        "input": "肺癌会把疾病传染给身边的人吗？",
        "cypher": "MATCH (n:Disease {name: '肺癌'})-[:acompany_with]->(m:Disease) RETURN m.get_way"
    },
    {
        "input": "肾错构瘤是一种什么病",
        "cypher": "MATCH (n:Disease {name:'肾错构瘤'}) RETURN n"
    },
    {
        "input": "前列腺癌治疗费用大概是多少呢",
        "cypher": "MATCH (m:Disease {name:'前列腺癌'}) RETURN m.cost_money"
    },
    {
        "input": "腔隙性脑梗死严重吗？不治疗可以自愈吗？如",
        "cypher": "MATCH (m:Disease {name:'腔隙性脑梗死'}) RETURN m.cure_lasttime"
    },
    {
        "input": "阴茎硬结症有什么表现？",
        "cypher": "MATCH (m:Disease {name:'阴茎硬结症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "怎么样区分新生儿黄疸？",
        "cypher": "MATCH (m:Disease {name:'新生儿黄疸'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "子宫内膜厚怎么办",
        "cypher": "MATCH (d:Disease {name: '子宫内膜厚'}) RETURN d.cure_way"
    },
    {
        "input": "小儿鼻炎的症状及治疗方法有哪些？",
        "cypher": "MATCH (m:Disease {name:'小儿鼻炎'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "女儿八岁发现性早熟怎么办？",
        "cypher": "MATCH (m:Disease {name: '性早熟'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "前阵子检查出癫痫，想咨询哪家医院比较好？",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "结核性腹膜炎没有腹水了肚子还痛吗？",
        "cypher": "MATCH (m:Disease {name:'结核性腹膜炎'})-[:has_symptom]->(n:Symptom {name:'腹水'}) RETURN m.cure_lasttime"
    },
    {
        "input": "细菌性阴道炎不能吃什么",
        "cypher": "MATCH (v1:Disease {name: '细菌性阴道炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "卵巢囊肿2.1*1.9的，中药灌肠后没有了？",
        "cypher": "MATCH (d:Disease {name: '卵巢囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "10小孩贫血怎么补上",
        "cypher": "MATCH (d:Disease {name: '贫血'}) RETURN d.easy_get"
    },
    {
        "input": "为什么会得脐炎？",
        "cypher": "MATCH (m:Disease {name:'脐炎'}) RETURN m.cause"
    },
    {
        "input": "胃窦炎不能吃的食物有哪些",
        "cypher": "MATCH (v1:Disease {name: '胃窦炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "面瘫可以化妆吗？",
        "cypher": "MATCH (m:Disease {name:'面瘫'}) RETURN m.desc"
    },
    {
        "input": "想要个男孩试管婴儿可以吗？",
        "cypher": "MATCH (d:Disease {name: '试管婴儿'}) RETURN d.easy_get"
    },
    {
        "input": "是什么原因引起的多发性硬化",
        "cypher": "MATCH (m:Disease {name:'多发性硬化'}) RETURN m.cause"
    },
    {
        "input": "失眠去哪治疗",
        "cypher": "MATCH (v1:Disease {name: '失眠'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "早上起来小便开始有点呼吸困难昨天我也会",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '呼吸困难' RETURN d.name"
    },
    {
        "input": "这个是不是恶性骨肿瘤能救缓解吗",
        "cypher": "MATCH (d:Disease {name: '恶性骨肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "请问我孩子隐匿性肾小球肾炎怎么办",
        "cypher": "MATCH (m:Disease {name:'隐匿性肾小球肾炎'})-[:belongs_to]->(n:Department) RETURN m.cure_lasttime,n.name"
    },
    {
        "input": "我检查出输卵管阻塞怎么办，谁能帮帮我？",
        "cypher": "MATCH (m:Disease {name:'输卵管阻塞'})-[:belongs_to]->(b:Department) RETURN b.name"
    },
    {
        "input": "您好：我在2013年10月份摘环时发现宫腔粘",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name CONTAINS '宫腔粘' RETURN n.name"
    },
    {
        "input": "孩子支气管哮喘的病饮食怎么调理？",
        "cypher": "MATCH (m:Disease {name:'支气管哮喘'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "非霍奇金淋巴瘤外周T细胞用什么方案治疗？",
        "cypher": "MATCH (d:Disease {name: '非霍奇金淋巴瘤'}) RETURN d.cure_way"
    },
    {
        "input": "尿痛这是怎么回事呢？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'尿痛'}) RETURN m.name"
    },
    {
        "input": "胸痹咋治疗才能快速缓解？",
        "cypher": "MATCH (d:Disease {name: '胸痹'}) RETURN d.cure_way"
    },
    {
        "input": "经常按摩睾丸的好处？",
        "cypher": "MATCH (n:Disease)-[r:belongs_to]->(m:Department) WHERE n.name = '睾丸炎' RETURN m.name"
    },
    {
        "input": "慢性阻塞性肺疾病如何治疗",
        "cypher": "MATCH (d:Disease {name: '慢性阻塞性肺疾病'}) RETURN d.cure_way"
    },
    {
        "input": "肺气肿患者要注意什么",
        "cypher": "MATCH (m:Disease {name: '肺气肿'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "手上有蜘蛛痣是什么病？",
        "cypher": "MATCH (m:Disease {name: '蜘蛛痣'}) RETURN m"
    },
    {
        "input": "阴道炎患者不应吃什么",
        "cypher": "MATCH (v1:Disease {name: '阴道炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "手淫导致的前列腺炎用药怎么样呢",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m.name,n.name"
    },
    {
        "input": "肾虚引起的勃起不坚早泄有手淫的习",
        "cypher": "MATCH (d:Disease {name: '肾虚'}) RETURN d.easy_get"
    },
    {
        "input": "小儿脑震荡检查什么？",
        "cypher": "MATCH (m:Disease {name:'小儿脑震荡'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "治疗血管瘤需要多少钱？",
        "cypher": "MATCH (m:Disease {name:'血管瘤'}) RETURN m.cost_money"
    },
    {
        "input": "更年期综合征怎么调理才好",
        "cypher": "MATCH (v1:Disease {name: '更年期综合征'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "原发性醛固酮增多症引起的并发症怎么办？",
        "cypher": "MATCH (m:Disease {name:'原发性醛固酮增多症'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "甲状腺癌患者想怀孕，可以吗？",
        "cypher": "MATCH (d:Disease {name: '甲状腺癌'}) RETURN d.easy_get"
    },
    {
        "input": "心动过缓怎么康复",
        "cypher": "MATCH (d:Disease {name: '心动过缓'}) RETURN d.cure_way"
    },
    {
        "input": "精子畸形的价格需要多少",
        "cypher": "MATCH (n:Disease {name:'精子畸形'}) RETURN n.cost_money"
    },
    {
        "input": "小儿支气管哮喘的饮食禁忌要求",
        "cypher": "MATCH (v1:Disease {name: '小儿支气管哮喘'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "脑出血者，引流术后的视物模糊怎样来解决？",
        "cypher": "MATCH (d:Disease {name: '脑出血'}) RETURN d.cure_way"
    },
    {
        "input": "急性尿道炎一般该会是哪些病症吗",
        "cypher": "MATCH (m:Disease {name: '急性尿道炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "直肠癌转移到肝左叶，该如何人治疗？注意什么？",
        "cypher": "MATCH (d:Disease {name: '直肠癌'}) RETURN d.cure_way"
    },
    {
        "input": "大脑萎缩一般能存活多久？",
        "cypher": "MATCH (m:Disease {name:'大脑萎缩'}) RETURN m.cure_lasttime"
    },
    {
        "input": "慢性附睾炎的症状有哪些",
        "cypher": "MATCH (v1:Disease {name: '慢性附睾炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "阴囊湿疹应用什么药",
        "cypher": "MATCH (v1:Disease {name: '阴囊湿疹'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "包皮炎大概需多少费用",
        "cypher": "MATCH (n:Disease {name:'包皮炎'}) RETURN n.cost_money"
    },
    {
        "input": "晚上长期失眠咋回事",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'失眠'}) RETURN m.name"
    },
    {
        "input": "苹果的功效与作用分别有哪些？",
        "cypher": "MATCH (v:Disease)-[e:do_eat]->(v1:Food {name:'苹果'}) RETURN v1.name,v1.desc"
    },
    {
        "input": "大脑有时候突然眩晕一下，但马上有过去了，",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'眩晕'}) RETURN m.name"
    },
    {
        "input": "胃癌的发生期到底有多快",
        "cypher": "MATCH (n:Disease {name: '胃癌'}) RETURN n.get_way"
    },
    {
        "input": "我父亲患的慢性肾小球肾炎严重吗？他吃的中药管",
        "cypher": "MATCH (d:Disease {name: '慢性肾小球肾炎'}) RETURN d.cure_way"
    },
    {
        "input": "氯化钠注射液多少钱一瓶？",
        "cypher": "MATCH (n:Drug {name:'氯化钠注射液'}) RETURN n.cost_money"
    },
    {
        "input": "什么病会引起耳鸣？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '耳鸣' RETURN m.name"
    },
    {
        "input": "卵巢癌患者怎么饮食较好？",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "卵巢囊肿怎么吃如何解决能消停点",
        "cypher": "MATCH (d:Disease {name: '卵巢囊肿'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "小儿血管瘤早期症状?",
        "cypher": "MATCH (m:Disease {name:'小儿血管瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "做输卵管造影片子出来了医生说没什么问",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE m.name CONTAINS '输卵管造影' RETURN n.name"
    },
    {
        "input": "患了破伤风未见好转应如何用药",
        "cypher": "MATCH (m:Disease {name:'破伤风'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "包茎的治疗费用多少钱？",
        "cypher": "MATCH (n:Disease {name:'包茎'}) RETURN n.cost_money"
    },
    {
        "input": "肾功能不全如何检测",
        "cypher": "MATCH (v1:Disease {name: '肾功能不全'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "胆结石患者最怕吃什么食物",
        "cypher": "MATCH (v1:Disease {name: '胆结石'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "胆汁返流性胃炎在哪治比较好",
        "cypher": "MATCH (v1:Disease {name: '胆汁返流性胃炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "星形细胞瘤是什么病状",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE m.name = '星形细胞瘤' RETURN m,n"
    },
    {
        "input": "慢性细菌性前列腺炎化验单",
        "cypher": "MATCH (d:Disease)-[r:need_check]->(c:Check) WHERE d.name='慢性细菌性前列腺炎' RETURN c.name"
    },
    {
        "input": "做完妊娠纹有疤痕了怎么办？",
        "cypher": "MATCH (d:Disease {name: '妊娠纹'}) RETURN d.cure_way"
    },
    {
        "input": "宝宝患有小儿支气管哮喘吃什么药物治疗？",
        "cypher": "MATCH (m:Disease {name:'小儿支气管哮喘'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "末梢神经炎是啥病？",
        "cypher": "MATCH (n:Disease {name:'末梢神经炎'}) RETURN n.name,n.desc"
    },
    {
        "input": "内分泌失调需要咋预防",
        "cypher": "MATCH (n:Disease {name: '内分泌失调'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "小儿咽喉炎使用哪种中药最有效",
        "cypher": "MATCH (v1:Disease {name: '小儿咽喉炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "结肠癌有什么特效药吗?",
        "cypher": "MATCH (m:Disease {name: '结肠癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "下肢动脉硬化闭塞症最好的治疗方法是什么？",
        "cypher": "MATCH (d:Disease {name: '下肢动脉硬化闭塞症'}) RETURN d.cure_way"
    },
    {
        "input": "预防多动症的病症需要怎么做?",
        "cypher": "MATCH (n:Disease {name: '多动症'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "附件炎需喝什么药才能好的比较快？",
        "cypher": "MATCH (n:Disease {name: '附件炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "新生儿肺炎会有什么危险",
        "cypher": "MATCH (m1:Disease {name: '新生儿肺炎'})-[:acompany_with]-(m2:Disease) RETURN m2"
    },
    {
        "input": "恶性肿瘤会转化吗?",
        "cypher": "MATCH (m1:Disease {name: '恶性肿瘤'})-[:acompany_with]-(m2:Disease) RETURN m2.name"
    },
    {
        "input": "胆囊息肉手术费用是多少",
        "cypher": "MATCH (v1:Disease {name: '胆囊息肉'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "预防卵巢癌有什么方法？",
        "cypher": "MATCH (m:Disease {name:'卵巢癌'}) RETURN m.prevent"
    },
    {
        "input": "什么叫泌尿系结石？",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '泌尿系结石' RETURN m,r1,n"
    },
    {
        "input": "想了解怎么判断是不是支气管炎",
        "cypher": "MATCH (m:Disease {name:'支气管炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肝病该怎么服药",
        "cypher": "MATCH (v1:Disease {name: '肝病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "颅咽管瘤不完全切除术后5年伽玛刀后2年复发咋",
        "cypher": "MATCH (d:Disease {name: '颅咽管瘤'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "腹泻与淋巴癌有何种关系？",
        "cypher": "MATCH (m1:Disease {name: '腹泻'})-[:acompany_with]-(m2:Disease {name: '淋巴癌'}) RETURN m1, m2"
    },
    {
        "input": "食管癌有没有特效药",
        "cypher": "MATCH (m:Disease {name:'食管癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "龟头癌怎么确诊",
        "cypher": "MATCH (m:Disease {name: '龟头癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "胃癌属于哪个科治疗？",
        "cypher": "MATCH (v1:Disease {name: '胃癌'})-[]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "家族性结肠息肉的治疗原则是什么？",
        "cypher": "MATCH (d:Disease {name: '家族性结肠息肉'}) RETURN d.cure_way"
    },
    {
        "input": "小儿癫痫的注意事项有哪些",
        "cypher": "MATCH (m:Disease {name:'小儿癫痫'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "肝硬化患者怎么保养乳房丰满呢？",
        "cypher": "MATCH (n:Disease {name: '肝硬化'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "毛细血管瘤是良性还是恶性肿瘤？",
        "cypher": "MATCH (n:Disease {name: '毛细血管瘤'}) RETURN n.cause"
    },
    {
        "input": "室性早博，心动过缓",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '室性早博' OR s.name = '心动过缓' RETURN d.name, d.desc"
    },
    {
        "input": "经常发低烧什么原因",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name CONTAINS '低烧' RETURN m.name, m.cause"
    },
    {
        "input": "较正规的子宫息肉医院是多少呢？",
        "cypher": "MATCH (m:Disease {name:'子宫息肉'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "月经不调的症状治疗",
        "cypher": "MATCH (d:Disease {name: '月经不调'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "总是反复发烧是什么原因",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '反复发烧' RETURN m.name"
    },
    {
        "input": "输尿管结石上段。中段。下段最大..",
        "cypher": "MATCH (m:Disease {name: '输尿管结石'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "肛窦炎做手术多少钱",
        "cypher": "MATCH (m:Disease {name:'肛窦炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "性功能障碍医院检查多少钱?",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'})-[:need_check]->(m:Check) RETURN m.name, m.cost_money"
    },
    {
        "input": "北京治疗脊髓空洞症那个医院比较好？",
        "cypher": "MATCH (v1:Disease {name: '脊髓空洞症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "宫颈糜烂患者会感染与她性交的男性吗",
        "cypher": "MATCH (v1:Disease {name: '宫颈糜烂'})-[:acompany_with]->(v2:Disease) RETURN v2.name"
    },
    {
        "input": "什么时候检查胎儿是否患有先天性巨结肠",
        "cypher": "MATCH (n:Disease {name:'先天性巨结肠'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "我月经来二十几天还有怎么办",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name CONTAINS '月经不调' RETURN d.name, d.desc"
    },
    {
        "input": "高位截瘫病人臀部大面积褥疮治疗方案",
        "cypher": "MATCH (d:Disease {name: '高位截瘫'}) RETURN d.cure_way"
    },
    {
        "input": "再生障碍性贫血会传染吗",
        "cypher": "MATCH (v1:Disease {name: '再生障碍性贫血'})-[]->(v2) RETURN v2.get_way"
    },
    {
        "input": "癫痫的人饮食方面要怎么注意？",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[:do_eat]->(v2:Food) RETURN v2"
    },
    {
        "input": "我想咨询慢性宫颈炎能自愈吗?",
        "cypher": "MATCH (n:Disease {name: '慢性宫颈炎'}) RETURN n.cured_prob"
    },
    {
        "input": "脑血管病人癒后，需要长期服用药物吗",
        "cypher": "MATCH (d:Disease {name: '脑血管病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肝癌是什么样的病",
        "cypher": "MATCH (m:Disease {name: '肝癌'}) RETURN m"
    },
    {
        "input": "睾丸炎一般是怎么来的？",
        "cypher": "MATCH (m:Disease {name:'睾丸炎'}) RETURN m.cause"
    },
    {
        "input": "孕三周做b超发现液性暗区盆腔积液怎么办？",
        "cypher": "MATCH (d:Disease {name: '盆腔积液'}) RETURN d.cure_way"
    },
    {
        "input": "静脉曲张前列腺钙化灶怎么办",
        "cypher": "MATCH (m:Disease {name: '静脉曲张'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "升主动脉瘤怎么治",
        "cypher": "MATCH (d:Disease {name: '升主动脉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "肝内胆管结石4mm严重吗",
        "cypher": "MATCH (m:Disease {name: '肝内胆管结石'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "阑尾炎能吃什么？",
        "cypher": "MATCH (m:Disease {name:'阑尾炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "精索静脉曲张能食疗吗",
        "cypher": "MATCH (n:Disease {name:'精索静脉曲张'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "孩子经常发烧干咳怎么办",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '发烧' OR n.name = '干咳' RETURN m.name"
    },
    {
        "input": "因胸腔积液吃什么药治疗",
        "cypher": "MATCH (v1:Disease {name: '胸腔积液'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "尿频，尿痛出血这是怎么一回事?",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '尿频' OR n.name = '尿痛出血' RETURN m.name"
    },
    {
        "input": "我该怎么办我很担心我儿子以后鸡胸？",
        "cypher": "MATCH (m:Disease {name: '鸡胸'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "阴道炎患者有哪些注意事项",
        "cypher": "MATCH (n:Disease {name:'阴道炎'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称"
    },
    {
        "input": "血管瘤对人有什么危害吗？",
        "cypher": "MATCH (m:Disease {name:'血管瘤'}) RETURN m.desc"
    },
    {
        "input": "我想咨询脑梗塞会遗传吗?",
        "cypher": "MATCH (n:Disease {name: '脑梗塞'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "肝炎检查有哪些步骤?",
        "cypher": "MATCH (v1:Disease {name: '肝炎'})-[:need_check]-(v2:Check) RETURN v2.name"
    },
    {
        "input": "睾丸扭转是立马疼吗",
        "cypher": "MATCH (m:Disease {name: '睾丸扭转'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "鞭虫病如何治疗",
        "cypher": "MATCH (d:Disease {name: '鞭虫病'}) RETURN d.cure_way"
    },
    {
        "input": "有霉菌性阴道炎能不能做人流？",
        "cypher": "MATCH (m:Disease {name:'霉菌性阴道炎'})-[:belongs_to]->(b:Department {name:'妇科'}) RETURN m.cure_lasttime"
    },
    {
        "input": "贲门癌病能和宝宝接触吗？",
        "cypher": "MATCH (m:Disease {name:'贲门癌'})-[:acompany_with]->(n:Disease) RETURN n.get_way"
    },
    {
        "input": "肺动脉高压早期有什么症状",
        "cypher": "MATCH (v1:Disease {name: '肺动脉高压'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "请问我是心脏病还是心脏神经症?",
        "cypher": "MATCH (m:Disease {name: '心脏病'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "这样能改善风湿病",
        "cypher": "MATCH (v1:Disease {name: '风湿病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "睾丸肿瘤要注意什么",
        "cypher": "MATCH (m:Disease {name: '睾丸肿瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "纵隔霍奇金淋巴瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'纵隔霍奇金淋巴瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "脊膜瘤，神经鞘瘤",
        "cypher": "MATCH (d:Disease {name: '脊膜瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "慢性盆腔炎用什么药可以治好呢？",
        "cypher": "MATCH (n:Disease {name: '慢性盆腔炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "关于肛周脓肿有哪些症状",
        "cypher": "MATCH (m:Disease {name: '肛周脓肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肋间神经痛是什么情况？",
        "cypher": "MATCH (m:Disease {name:'肋间神经痛'}) RETURN m"
    },
    {
        "input": "4岁孩子近视眼怎么办",
        "cypher": "MATCH (d:Disease {name: '近视眼'}) RETURN d.easy_get"
    },
    {
        "input": "5岁儿童霰粒肿做手术需要全麻吗?",
        "cypher": "MATCH (d:Disease {name: '霰粒肿'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺结石体检不合格怎么办",
        "cypher": "MATCH (m:Disease {name: '前列腺结石'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "这是神经衰弱引起的吗有什么办法可以自愈？",
        "cypher": "MATCH (d:Disease {name: '神经衰弱'}) RETURN d.cure_way"
    }
]