[
    {
        "input": "患有血管炎严重吗",
        "cypher": "MATCH (m:Disease {name: '血管炎'}) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率, m.get_prob AS 发病率"
    },
    {
        "input": "草莓状血管瘤症状",
        "cypher": "MATCH (m:Disease {name: '草莓状血管瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "一开始得的混合痔，用药物治疗后脱了一层皮怎么",
        "cypher": "MATCH (d:Disease {name:'混合痔'})-[:common_drug|:recommand_drug]->(dr:Drug) RETURN dr.name"
    },
    {
        "input": "脑瘤去医院治疗大概费用",
        "cypher": "MATCH (v1:Disease {name: '脑瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name AS 科室名称, v1.cost_money AS 费用"
    },
    {
        "input": "乳腺囊肿怀孕会有影响的吗？",
        "cypher": "MATCH (d:Disease {name: '乳腺囊肿'}) RETURN d.easy_get"
    },
    {
        "input": "小细胞肺癌治疗药物，小细胞肺癌该吃什么止疼药",
        "cypher": "MATCH (n1:Disease {name: '小细胞肺癌'})-[:common_drug|:recommand_drug]->(n2:Drug) RETURN n2"
    },
    {
        "input": "怎样注意外痔的饮食",
        "cypher": "MATCH (m:Disease {name: '外痔'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "胆囊结石是什么",
        "cypher": "MATCH (m:Disease {name: '胆囊结石'}) RETURN m"
    },
    {
        "input": "关于包皮过长问题",
        "cypher": "MATCH (n:Disease {name:'包皮过长'})-[]->(m) RETURN m"
    },
    {
        "input": "小阴茎和隐形阴茎有哪些区别？该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '小阴茎'}) RETURN d.cure_way"
    },
    {
        "input": "胸壁结核手术难度大吗",
        "cypher": "MATCH (d:Disease {name: '胸壁结核'}) RETURN d.cure_way"
    },
    {
        "input": "三年前做过子宫内膜息肉门诊手术现感腰酸咋办？",
        "cypher": "MATCH (m:Disease {name:'子宫内膜息肉'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "腺样体肥大手术后遗症有哪些",
        "cypher": "MATCH (m:Disease {name: '腺样体肥大'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "治疗血管瘤有什么药吗？",
        "cypher": "MATCH (m:Disease {name:'血管瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "绝经后查出有子宫肌瘤，请问医生，这样对身体还",
        "cypher": "MATCH (n:Disease {name:'子宫肌瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "乳腺癌转移的皮肤溃疡症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:acompany_with]->(n:Disease)-[:has_symptom]->(p:Symptom) RETURN p.name"
    },
    {
        "input": "脑垂体腺瘤是什么原因引起的？",
        "cypher": "MATCH (m:Disease {name: '脑垂体腺瘤'}) RETURN m.cause"
    },
    {
        "input": "红斑狼疮有那么可怕吗",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'}) RETURN m.get_prob"
    },
    {
        "input": "肾癌这病吃什么较好一点",
        "cypher": "MATCH (m:Disease {name: '肾癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "怀疑肌营养不良检查什么",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name CONTAINS '肌营养不良' RETURN n.name"
    },
    {
        "input": "什么是子宫内膜息肉？",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '子宫内膜息肉' RETURN m,r1,n"
    },
    {
        "input": "智力低下费用大概要多少钱？",
        "cypher": "MATCH (n:Disease {name: '智力低下'}) RETURN n.cost_money"
    },
    {
        "input": "高血压属于什么意思",
        "cypher": "MATCH (m:Disease {name:'高血压'}) RETURN m.name"
    },
    {
        "input": "异常血红蛋白病怎么回事",
        "cypher": "MATCH (m:Disease {name:'异常血红蛋白病'}) RETURN m.name,m.desc"
    },
    {
        "input": "今天三点多呕吐拉稀怎么办",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '呕吐' OR n.name = '拉稀' RETURN m.name, m.desc, m.prevent, m.c"
    },
    {
        "input": "慢性支气管炎打什么预防针",
        "cypher": "MATCH (v1:Disease {name: '慢性支气管炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "乳房纤维瘤的主要因素或病因",
        "cypher": "MATCH (n:Disease {name: '乳房纤维瘤'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "视神经脊髓炎请问中西治疗好不好",
        "cypher": "MATCH (d:Disease {name: '视神经脊髓炎'}) RETURN d.cure_way"
    },
    {
        "input": "得了早泄在哪里接受治疗好呢？",
        "cypher": "MATCH (n1:Disease {name: '早泄'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "我是宫外孕么",
        "cypher": "MATCH (d:Disease {name:'宫外孕'}) RETURN d"
    },
    {
        "input": "更年期总出汗可以吃什么药",
        "cypher": "MATCH (v1:Disease {name: '更年期综合征'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "17个月宝宝病毒性肺炎怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '病毒性肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "早泄对患者造成的不利影响是什么呢？",
        "cypher": "MATCH (m:Disease {name:'早泄'})-[:has_symptom]->(n:Symptom) RETURN n"
    },
    {
        "input": "7个月宝宝缺铁性贫血怎么补",
        "cypher": "MATCH (d:Disease {name: '缺铁性贫血'}) RETURN d.easy_get"
    },
    {
        "input": "中医治肾小球肾炎最好的方法",
        "cypher": "MATCH (d:Disease {name: '肾小球肾炎'}) RETURN d.cure_way"
    },
    {
        "input": "孩子的妈妈有肝病，小孩现在2周半了，也没",
        "cypher": "MATCH (d:Disease {name: '肝病'}) RETURN d.easy_get"
    },
    {
        "input": "软骨瘤患者",
        "cypher": "MATCH (m:Disease {name: '软骨瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "小儿咳嗽服用什么药",
        "cypher": "MATCH (v1:Disease {name: '小儿咳嗽'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "肛裂时间久了会怎样？",
        "cypher": "MATCH (m:Disease {name:'肛裂'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "肺部良性肿瘤会恶化吗?该如何医治？",
        "cypher": "MATCH (d:Disease {name: '肺部良性肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "多动症应该注意哪些",
        "cypher": "MATCH (m:Disease {name:'多动症'})-[:no_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "四个月宝宝母乳性腹泻有什么好办法？",
        "cypher": "MATCH (d:Disease {name: '母乳性腹泻'}) RETURN d.cure_way"
    },
    {
        "input": "请问肾病有哪些症状",
        "cypher": "MATCH (m:Disease {name: '肾病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "早期胰腺癌的危害是什么？",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'}) RETURN m.desc"
    },
    {
        "input": "不想上医院，如何辨别痔疮的症状程度",
        "cypher": "MATCH (d:Disease {name: '痔疮'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "血吸虫病潜伏期最长时间？",
        "cypher": "MATCH (m:Disease {name:'血吸虫病'}) RETURN m.cure_lasttime"
    },
    {
        "input": "液体测验称之为血管造影吗？",
        "cypher": "MATCH (v1:Disease)-[e1:need_check]->(v2:Check) WHERE v2.name = '血管造影' RETURN v1.name"
    },
    {
        "input": "化脓性扁桃体炎肺部感染要如何解决",
        "cypher": "MATCH (d:Disease {name: '化脓性扁桃体炎'}) RETURN d.cure_way"
    },
    {
        "input": "静脉曲张吃什么药效果好",
        "cypher": "MATCH (v1:Disease {name: '静脉曲张'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "宫颈癌是怎么回事呢?",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'}) RETURN m.name,m.desc"
    },
    {
        "input": "烧伤能用双氧水清洗吗，会有什么后果",
        "cypher": "MATCH (d:Disease {name: '烧伤'}) RETURN d.cure_way"
    },
    {
        "input": "医生我摘环后有点月经不调怎么办？",
        "cypher": "MATCH (m:Disease {name:'月经不调'})<-[:belongs_to]->(n:Department) RETURN m.cure_lasttime"
    },
    {
        "input": "神经母细胞瘤能否完全恢复？",
        "cypher": "MATCH (d:Disease {name: '神经母细胞瘤'}) RETURN d.cure_way"
    },
    {
        "input": "有什么药治疗鼻炎有效",
        "cypher": "MATCH (v1:Disease {name: '鼻炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "麦粒肿手术后有凸起正常吗？",
        "cypher": "MATCH (d:Disease {name: '麦粒肿'}) RETURN d.cure_way"
    },
    {
        "input": "排卵障碍注意哪些事项",
        "cypher": "MATCH (n:Disease {name:'排卵障碍'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "内痔看哪家医院好而且还有用？",
        "cypher": "MATCH (m:Disease {name: '内痔'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "做肛周脓肿手术多少钱",
        "cypher": "MATCH (n:Disease {name: '肛周脓肿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "肝硬化是怎么引起的?",
        "cypher": "MATCH (n:Disease {name: '肝硬化'})-[:acompany_with]-(m:Disease) RETURN m.cause"
    },
    {
        "input": "膀胱有肿瘤严重吗？能根治吗？",
        "cypher": "MATCH (m:Disease {name: '膀胱肿瘤'}) RETURN m.cure_lasttime, m.cured_prob"
    },
    {
        "input": "肾癌患者不能吃什么?",
        "cypher": "MATCH (m:Disease {name: '肾癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "我被检查出了纵膈肿瘤要注意些什么呢？",
        "cypher": "MATCH (m:Disease {name:'纵膈肿瘤'}) RETURN m.prevent"
    },
    {
        "input": "的得了唇癌想知道忌口有哪些多吃些水果可以么？",
        "cypher": "MATCH (m:Disease {name: '唇癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "慢性肾功能不全如何控制肌酐升高",
        "cypher": "MATCH (d:Disease {name: '慢性肾功能不全'}) RETURN d.cure_way"
    },
    {
        "input": "患有阴道炎饮食上的注意事项有什么",
        "cypher": "MATCH (v1:Disease {name: '阴道炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "性事手淫过多了导致硬不起来需要喝药吗？",
        "cypher": "MATCH (n:Disease {name:'阳痿'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "卵巢囊肿吃什么药治疗好",
        "cypher": "MATCH (v1:Disease {name: '卵巢囊肿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "请问我的情况会是前列腺吗",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "新生儿窒息会挣扎吗",
        "cypher": "MATCH (m:Disease {name:'新生儿窒息'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "听神经瘤手术后五年复发",
        "cypher": "MATCH (d:Disease {name: '听神经瘤'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "新生儿破伤风监测病例",
        "cypher": "MATCH (d:Disease {name: '新生儿破伤风'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "卵巢囊肿怎么办啊用什么药膏卵巢囊肿怎么治疗会",
        "cypher": "MATCH (m:Disease {name:'卵巢囊肿'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "我男朋友的妈妈血压160",
        "cypher": "MATCH (d:Disease)-[r:belongs_to]->(dp:Department) WHERE d.name = '高血压' RETURN dp.name"
    },
    {
        "input": "哮喘的发病原因都有哪些？",
        "cypher": "MATCH (n:Disease {name: '哮喘'}) RETURN n.cause"
    },
    {
        "input": "慢性肠炎在饮食上应禁口什么",
        "cypher": "MATCH (v1:Disease {name: '慢性肠炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "宝宝得了急性播散性脑脊髓炎是怎么回事?",
        "cypher": "MATCH (m:Disease {name:'急性播散性脑脊髓炎'}) RETURN m.get_prob"
    },
    {
        "input": "月经不调问题大吗？",
        "cypher": "MATCH (m:Disease {name:'月经不调'}) RETURN m.get_prob"
    },
    {
        "input": "隐匿阴茎治疗医保能否报销",
        "cypher": "MATCH (d:Disease {name: '隐匿阴茎'}) RETURN d.cure_way"
    },
    {
        "input": "慢性肠炎的病因有哪些",
        "cypher": "MATCH (n:Disease {name: '慢性肠炎'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "胰腺癌不能手术吃啥药?",
        "cypher": "MATCH (v1:Disease {name: '胰腺癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "胰腺癌晚期如何用药?",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n"
    },
    {
        "input": "婴儿脐疝带有用吗",
        "cypher": "MATCH (d:Disease {name: '婴儿脐疝'})-[:common_drug|:recommand_drug]->(dr:Drug) RETURN dr.name"
    },
    {
        "input": "糖尿病导致的并发症有什么",
        "cypher": "MATCH (v1:Disease {name: '糖尿病'})-[:acompany_with]->(v2:Disease) RETURN v2.name"
    },
    {
        "input": "老公性障碍或者冷淡咋回事？",
        "cypher": "MATCH (m:Disease {name:'性障碍'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "我这是不是得了前列腺炎",
        "cypher": "MATCH (d:Disease {name: '前列腺炎'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "什么检查可以确诊白血病",
        "cypher": "MATCH (v1:Disease {name: '白血病'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "原发性血小板增多症是什么病症",
        "cypher": "MATCH (m:Disease {name: '原发性血小板增多症'}) RETURN m"
    },
    {
        "input": "运动神经元病是种什么疾病",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '运动神经元病' RETURN m,n"
    },
    {
        "input": "慢性肾炎病人的注意事项有哪些",
        "cypher": "MATCH (v1:Disease {name: '慢性肾炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "性早熟会不会影响身高？",
        "cypher": "MATCH (m:Disease {name: '性早熟'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "坐骨神经痛是哪种病",
        "cypher": "MATCH (v:Disease)-[e:belongs_to]->(v2:Department) WHERE v.name='坐骨神经痛' RETURN v2.name"
    },
    {
        "input": "肠系膜上动脉栓塞的治疗方法有哪些？",
        "cypher": "MATCH (d:Disease {name: '肠系膜上动脉栓塞'}) RETURN d.cure_way"
    },
    {
        "input": "有早搏能运动吗",
        "cypher": "MATCH (d:Disease {name: '早搏'}) RETURN d.cure_way"
    },
    {
        "input": "内痔和什么疾病混淆",
        "cypher": "MATCH (m:Disease {name: '内痔'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "帮忙看看子宫肌瘤刮宫报告结果？",
        "cypher": "MATCH (m:Disease {name: '子宫肌瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "皮肤纤维瘤病理",
        "cypher": "MATCH (d:Disease {name: '皮肤纤维瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "自发性气胸最典型的症状是啥",
        "cypher": "MATCH (m:Disease {name: '自发性气胸'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "细菌性肠炎怎么办？",
        "cypher": "MATCH (d:Disease {name: '细菌性肠炎'}) RETURN d.cure_way"
    },
    {
        "input": "低血压注意些什么",
        "cypher": "MATCH (m:Disease {name:'低血压'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "胆囊息肉是什么因素导致的？",
        "cypher": "MATCH (m:Disease {name: '胆囊息肉'}) RETURN m.cause"
    },
    {
        "input": "什么是宫寒",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name = '宫寒' RETURN m,r1,n"
    },
    {
        "input": "尿路感染如何选择治疗药物",
        "cypher": "MATCH (v1:Disease {name: '尿路感染'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "怎样治疗低血糖，血粘",
        "cypher": "MATCH (d:Disease {name: '低血糖'}) RETURN d.cure_way"
    },
    {
        "input": "大生化检查",
        "cypher": "MATCH (v1:Disease)-[v2:need_check]->(v3:Check) WHERE v3.name = '大生化检查' RETURN v1.name,v2,v3.name"
    },
    {
        "input": "早产儿的精神运动发育的评估有哪些？",
        "cypher": "MATCH (m:Disease {name:'早产儿'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "早泄做检查一般多少钱？",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:need_check]->(v2:Check) RETURN v2.cost_money"
    },
    {
        "input": "未生育过得了慢性子宫内膜炎",
        "cypher": "MATCH (d:Disease {name: '慢性子宫内膜炎'}) RETURN d.easy_get"
    },
    {
        "input": "脑癌的检查有什么",
        "cypher": "MATCH (m:Disease {name: '脑癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "颞叶癫痫术后复查要做吗？",
        "cypher": "MATCH (n:Disease {name: '颞叶癫痫'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "治疗甲状腺疾病的医院哪家比较好？",
        "cypher": "MATCH (v1:Disease {name: '甲状腺疾病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "我爸爸51岁做了肠套叠手术后腹痛怎么办",
        "cypher": "MATCH (d:Disease {name: '肠套叠'})-[:has_symptom]->(s:Symptom {name: '腹痛'}) RETURN s"
    },
    {
        "input": "体检时发现右侧乳房边缘有乳腺结节怎么办？",
        "cypher": "MATCH (d:Disease {name: '乳腺结节'}) RETURN d.cure_way"
    },
    {
        "input": "外阴痛一般该会用什么药吗",
        "cypher": "MATCH (v1:Disease {name: '外阴痛'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "经常晚上遗精是怎么回事？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '遗精' RETURN m.name"
    },
    {
        "input": "突然面瘫怎么回事呢？",
        "cypher": "MATCH (m:Disease {name:'面瘫'}) RETURN m.get_way"
    },
    {
        "input": "艾滋病晚期应该如何医治？",
        "cypher": "MATCH (d:Disease {name: '艾滋病'}) RETURN d.cure_way"
    },
    {
        "input": "怎么查有没有宫颈糜烂？",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "请问。得了腹膜炎。腹部会有积水吗",
        "cypher": "MATCH (m:Disease {name:'腹膜炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肛周脓肿应该注意哪些问题",
        "cypher": "MATCH (d:Disease {name: '肛周脓肿'}) RETURN d.easy_get"
    },
    {
        "input": "娃得了多动症",
        "cypher": "MATCH (m:Disease {name: '多动症'}) RETURN m"
    },
    {
        "input": "高尿酸血症以什么标准来诊断",
        "cypher": "MATCH (n:Disease {name: '高尿酸血症'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "被同学踢到睾丸问题大吗",
        "cypher": "MATCH (m:Disease {name: '睾丸炎'})-[:belongs_to]->(n:Department) RETURN m.name, n.name"
    },
    {
        "input": "3岁孩子生长激素的标准是多少",
        "cypher": "MATCH (d:Disease {name: '生长激素缺乏症'}) RETURN d.easy_get"
    },
    {
        "input": "看智力低下啥医院好？",
        "cypher": "MATCH (n:Disease {name: '智力低下'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "不了解乳腺炎怎么办",
        "cypher": "MATCH (m:Disease {name: '乳腺炎'}) RETURN m"
    },
    {
        "input": "肺癌扩散还能活多久",
        "cypher": "MATCH (m:Disease {name: '肺癌'})-[:acompany_with]->(n:Disease) RETURN n.get_lasttime"
    },
    {
        "input": "流产后都有哪些后果",
        "cypher": "MATCH (v1:Disease {name: '流产'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "好像有点黑便",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '黑便' RETURN m.name"
    },
    {
        "input": "淋巴瘤都有哪些症状？",
        "cypher": "MATCH (m:Disease {name: '淋巴瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "狼疮性肾炎哪个医院治的好呢",
        "cypher": "MATCH (n:Disease {name: '狼疮性肾炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "宫外孕手术费要多少",
        "cypher": "MATCH (v1:Disease {name: '宫外孕'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "请问冠状动脉造影是啥意思呢",
        "cypher": "MATCH (m:Disease)-[:need_check]->(n:Check) WHERE n.name = '冠状动脉造影' RETURN m.name"
    },
    {
        "input": "孕前检查出抗心磷脂抗体阳性，医生通知3个",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE m.name CONTAINS '抗心磷脂抗体' RETURN n.name"
    },
    {
        "input": "再生障碍性贫血患者能否长时间上网？",
        "cypher": "MATCH (d:Disease {name: '再生障碍性贫血'}) RETURN d.easy_get"
    },
    {
        "input": "巨球蛋白血症是否只有定期输血才..",
        "cypher": "MATCH (d:Disease {name: '巨球蛋白血症'}) RETURN d.cure_way"
    },
    {
        "input": "肺炎听诊器听得出吗",
        "cypher": "MATCH (n:Disease {name: '肺炎'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "肿瘤患者不能吃什么啊",
        "cypher": "MATCH (v1:Disease {name: '肿瘤'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "你好医生  我是名高中生  前几天晚上上自习",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '头痛' RETURN n.name"
    },
    {
        "input": "气管肿瘤后遗症具体有什么",
        "cypher": "MATCH (m:Disease {name: '气管肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "早期乳腺癌术后复查项目有哪些？",
        "cypher": "MATCH (m:Disease {name:'早期乳腺癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "得了肺气肿症状具体是什么呢？",
        "cypher": "MATCH (m:Disease {name:'肺气肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "疝气和积水如何确诊？",
        "cypher": "MATCH (m:Disease {name:'疝气'})-[:need_check]->(n:Check) RETURN m.name, n.name"
    },
    {
        "input": "结肠癌遗传因素大吗?",
        "cypher": "MATCH (m:Disease {name: '结肠癌'}) RETURN m.cause"
    },
    {
        "input": "怎样有效的预防附睾炎？",
        "cypher": "MATCH (n:Disease {name: '附睾炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肾下垂是否可以中医治疗吗？",
        "cypher": "MATCH (d:Disease {name: '肾下垂'}) RETURN d.cure_way"
    },
    {
        "input": "多发性大动脉炎的治疗",
        "cypher": "MATCH (d:Disease {name: '多发性大动脉炎'}) RETURN d.cure_way"
    },
    {
        "input": "便秘这是怎么回事呢?",
        "cypher": "MATCH (m:Disease {name:'便秘'}) RETURN m"
    },
    {
        "input": "肛周脓肿需要注意什么呢？",
        "cypher": "MATCH (m:Disease {name:'肛周脓肿'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "男生前列腺钙化的危害有哪些?",
        "cypher": "MATCH (d:Disease {name: '前列腺钙化'}) RETURN d.easy_get"
    },
    {
        "input": "为什么宝宝刚出生就会有黄疸？",
        "cypher": "MATCH (m:Disease {name: '黄疸'}) RETURN m.cause"
    },
    {
        "input": "不知道是不是睾丸炎？",
        "cypher": "MATCH (m:Disease {name:'睾丸炎'}) RETURN m"
    },
    {
        "input": "脑胶质瘤哪里治疗效果最好最明显？",
        "cypher": "MATCH (m:Disease {name:'脑胶质瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "我想了解一下血管瘤的表现",
        "cypher": "MATCH (m:Disease {name:'血管瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "小儿脑积水心境不良传染吗？",
        "cypher": "MATCH (m:Disease {name:'小儿脑积水'}) RETURN m.get_way"
    },
    {
        "input": "什么叫佝偻病呢",
        "cypher": "MATCH (m:Disease {name:'佝偻病'}) RETURN m.desc"
    },
    {
        "input": "母亲癫痫病很多年了，现在发作频繁怎么办？",
        "cypher": "MATCH (d:Disease {name: '癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "新生儿败血症有什么症状?",
        "cypher": "MATCH (m:Disease {name: '新生儿败血症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "直肠癌到底怎么预防",
        "cypher": "MATCH (d:Disease {name: '直肠癌'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "应该怎么预防前列腺肉瘤?",
        "cypher": "MATCH (m:Disease {name:'前列腺肉瘤'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "纵隔神经鞘源性肿瘤的危害有哪些？",
        "cypher": "MATCH (m:Disease {name:'纵隔神经鞘源性肿瘤'}) RETURN m.desc"
    },
    {
        "input": "疑似手足口已退烧是否需要再次入院检查",
        "cypher": "MATCH (d:Disease {name: '手足口病'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "急性腹膜炎症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '急性腹膜炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "甲状腺疾病都有什么症状",
        "cypher": "MATCH (n:Disease {name: '甲状腺疾病'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "感冒的时候打预防针要紧吗",
        "cypher": "MATCH (n:Disease {name:'感冒'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "治疗急性盆腔炎需要多少钱？",
        "cypher": "MATCH (n:Disease {name: '急性盆腔炎'}) RETURN n.cost_money"
    },
    {
        "input": "子宫内膜增生早期症状是啥？",
        "cypher": "MATCH (m:Disease {name:'子宫内膜增生'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我女友有洗手帮我自慰，请问我们双方会得艾",
        "cypher": "MATCH (d:Disease {name: '艾滋病'})-[:acompany_with]->(r:Disease) RETURN r"
    },
    {
        "input": "会变小的淋巴结是淋巴癌吗 ",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'})-[:has_symptom]->(n:Symptom {name:'淋巴结肿大'}) RETURN m.cure_lasttime"
    },
    {
        "input": "直肠癌的成因是什么",
        "cypher": "MATCH (n:Disease {name: '直肠癌'}) RETURN n.cause"
    },
    {
        "input": "脑动静脉畸形患者的饮食禁忌有什么",
        "cypher": "MATCH (v1:Disease {name: '脑动静脉畸形'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "宫颈癌放化疗价格多少",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name, m.cost_money"
    },
    {
        "input": "检查阳痿项目花多少钱",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:need_check]->(v2:Check) RETURN v2.cost_money"
    },
    {
        "input": "宫颈癌早期分为几期",
        "cypher": "MATCH (n:Disease {name: '宫颈癌'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "胰腺炎的症状有哪些呢",
        "cypher": "MATCH (m:Disease {name:'胰腺炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "低血压怎么预防如何治疗才好呢？",
        "cypher": "MATCH (m:Disease {name:'低血压'}) RETURN m.prevent"
    },
    {
        "input": "肾阴虚和阳痿吃中成药能治疗好吗",
        "cypher": "MATCH (n:Disease {name:'肾阴虚'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "一岁宝宝感冒了吃了就好感冒药不拉大便咋办呀？",
        "cypher": "MATCH (d:Disease {name: '感冒'}) RETURN d.easy_get"
    },
    {
        "input": "子宫内膜炎手术到哪家做？",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "卵巢囊肿有何种可怕的因素？",
        "cypher": "MATCH (m:Disease {name:'卵巢囊肿'}) RETURN m.cause"
    },
    {
        "input": "难治性癫痫患者是否可以做手术治疗",
        "cypher": "MATCH (d:Disease {name: '难治性癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "孩子咳嗽呕吐发烧怎么办",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '咳嗽' OR n.name = '呕吐' OR n.name = '发烧' RETURN m"
    },
    {
        "input": "如何判断死精症这回事？",
        "cypher": "MATCH (m:Disease {name:'死精症'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "预防肝癌需要怎么做",
        "cypher": "MATCH (m:Disease {name:'肝癌'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "得睾丸癌的人能活多久？",
        "cypher": "MATCH (m1:Disease {name: '睾丸癌'}) RETURN m1.cure_lasttime"
    },
    {
        "input": "支气管炎患者对于阿奇霉素分散片的用量？",
        "cypher": "MATCH (n:Disease {name: '支气管炎'})-[:common_drug|:recommand_drug]->(m:Drug {name: '阿奇霉素分散片'}) RETURN m"
    },
    {
        "input": "脑血栓形成吃什么好？",
        "cypher": "MATCH (v1:Disease {name: '脑血栓形成'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "癫痫会不会通过空气传染人?",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[]->(v2) RETURN v2.get_way"
    },
    {
        "input": "宝宝肠炎拉肚子能吃什么",
        "cypher": "MATCH (v1:Disease {name: '肠炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "内分泌失调有什么症状出现呢",
        "cypher": "MATCH (m:Disease {name:'内分泌失调'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "静脉曲张的症状有哪些?",
        "cypher": "MATCH (v1:Disease {name: '静脉曲张'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "肋软骨炎吃什么药吃什么食物？",
        "cypher": "MATCH (m:Disease {name:'肋软骨炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "我以前得过肺炎，是不是以后一感冒咳嗽就很",
        "cypher": "MATCH (d:Disease {name: '肺炎'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "乳腺癌切除后还会复发吗",
        "cypher": "MATCH (n:Disease {name: '乳腺癌'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "结节病患者的饮食禁忌有哪些呀？",
        "cypher": "MATCH (n:Disease {name: '结节病'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "月经不调之前去医院检查三次是什么原因？",
        "cypher": "MATCH (m:Disease {name: '月经不调'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "尿毒症哪些食物不能吃？",
        "cypher": "MATCH (v1:Disease {name: '尿毒症'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "得白血病有哪些症状",
        "cypher": "MATCH (m:Disease {name:'白血病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "胃炎的症状是什么?",
        "cypher": "MATCH (v1:Disease {name: '胃炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "肺大泡是什么",
        "cypher": "MATCH (n:Disease) WHERE n.name = '肺大泡' RETURN n.desc"
    },
    {
        "input": "类风湿患者如何保护关节",
        "cypher": "MATCH (d:Disease {name: '类风湿关节炎'}) RETURN d.cure_way"
    },
    {
        "input": "动脉瘤样骨囊肿怎么治",
        "cypher": "MATCH (d:Disease {name: '动脉瘤样骨囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "我是怎么回事啊是流产吗",
        "cypher": "MATCH (m:Disease {name: '流产'}) RETURN m"
    },
    {
        "input": "膀胱癌什么医院较好效果明显？",
        "cypher": "MATCH (m:Disease {name: '膀胱癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "包皮炎是什么原因造成的",
        "cypher": "MATCH (m:Disease {name:'包皮炎'}) RETURN m.cause"
    },
    {
        "input": "怎样确定是否患了乳腺癌？",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "妇科炎症为何会长出了肉",
        "cypher": "MATCH (d:Disease {name: '妇科炎症'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "治疗乳腺增生和盆腔炎的药?",
        "cypher": "MATCH (m:Disease)-[:common_drug|:recommand_drug]->(n:Drug) WHERE m.name = '乳腺增生' OR m.name = '盆腔炎' RETURN n.name"
    },
    {
        "input": "肠系膜肿瘤有什么症状，常州哪家医院好",
        "cypher": "MATCH (m:Disease {name: '肠系膜肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "软组织肿瘤怎么调节?",
        "cypher": "MATCH (m:Disease {name: '软组织肿瘤'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "食管癌的术后饮食应该注意些什么",
        "cypher": "MATCH (m:Disease {name: '食管癌'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "外阴瘙痒是什么原因引起的?",
        "cypher": "MATCH (m:Disease {name:'外阴瘙痒'})RETURN m.cause"
    },
    {
        "input": "孩子出现扁桃体炎难受如何诊治",
        "cypher": "MATCH (m:Disease {name: '扁桃体炎'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "前列腺癌的发病因素有哪些",
        "cypher": "MATCH (n:Disease {name: '前列腺癌'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "胰腺癌手术之后不能吃饭吗",
        "cypher": "MATCH (m:Disease {name: '胰腺癌'})-[:no_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "治疗小细胞肺癌有效的医院是哪家呢？",
        "cypher": "MATCH (n1:Disease {name: '小细胞肺癌'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "小宝宝便秘吃药就好怎么查？",
        "cypher": "MATCH (m:Disease {name:'便秘'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "治疗小儿遗尿药有哪些？",
        "cypher": "MATCH (v1:Disease {name: '小儿遗尿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脑积水后期会怎么样，有生命危险吗",
        "cypher": "MATCH (m:Disease {name:'脑积水'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "睾丸囊肿严重不要手术不？",
        "cypher": "MATCH (d:Disease {name: '睾丸囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "女儿得了细菌性痢疾，在恢复期应该注意什么",
        "cypher": "MATCH (d:Disease {name: '细菌性痢疾'}) RETURN d.easy_get"
    },
    {
        "input": "慢性肾小球肾炎影像表现有什么",
        "cypher": "MATCH (v1:Disease {name: '慢性肾小球肾炎'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "是肾阴虚还是肾阳虚啊？？",
        "cypher": "MATCH (m:Disease {name:'肾阴虚'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "请问房间隔缺损要注意什么？",
        "cypher": "MATCH (d:Disease {name: '房间隔缺损'}) RETURN d.easy_get"
    },
    {
        "input": "蛋白质-热能营养障碍的症状是什么样的？",
        "cypher": "MATCH (n:Disease {name: '蛋白质-热能营养障碍'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "性功能障碍和啥有关系？",
        "cypher": "MATCH (v1:Disease {name: '性功能障碍'})-[]->(v2) RETURN v2"
    },
    {
        "input": "治疗结核性脑膜炎哪里的医院好",
        "cypher": "MATCH (v1:Disease {name: '结核性脑膜炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "我是甲亢，也经五年了，在上海去治疗过一次",
        "cypher": "MATCH (d:Disease {name:'甲亢'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "急性肾功能不全可以治愈吗",
        "cypher": "MATCH (d:Disease {name: '急性肾功能不全'}) RETURN d.cure_way"
    }
]