[
    {
        "input": "结核性脑膜炎并发脑积水何时分流术后合适",
        "cypher": "MATCH (d:Disease {name: '结核性脑膜炎'}) RETURN d.cure_way"
    },
    {
        "input": "我是否有肾病？",
        "cypher": "MATCH (n:Disease {name:'肾病'}) RETURN n"
    },
    {
        "input": "前列腺炎尿频早泄平时该注意什么呢？",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "心肌梗死支架手术后心脏还会有破裂风险吗？",
        "cypher": "MATCH (d:Disease {name: '心肌梗死'}) RETURN d.cure_way"
    },
    {
        "input": "结核病和肺纤维化可以同时治疗吗？",
        "cypher": "MATCH (d:Disease {name: '结核病'}) RETURN d.cure_way"
    },
    {
        "input": "甲状腺肿瘤手术费或许要多少",
        "cypher": "MATCH (n:Disease {name: '甲状腺肿瘤'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "我想了解前列腺炎会导致早泄吗",
        "cypher": "MATCH (v1:Disease {name: '前列腺炎'})-[:acompany_with]-(v2:Disease {name: '早泄'}) RETURN v2"
    },
    {
        "input": "门静脉高压的最佳治方法？",
        "cypher": "MATCH (d:Disease {name: '门静脉高压'}) RETURN d.cure_way"
    },
    {
        "input": "中国有没有淋巴癌的救助基金?",
        "cypher": "MATCH (d:Disease {name: '淋巴癌'}) RETURN d.easy_get"
    },
    {
        "input": "中医治慢性附睾炎效果好吗",
        "cypher": "MATCH (d:Disease {name: '慢性附睾炎'}) RETURN d.cure_way"
    },
    {
        "input": "风疹IgM阴性IgG阳性什么意思？",
        "cypher": "MATCH (d:Disease {name: '风疹'}) RETURN d.easy_get"
    },
    {
        "input": "抽动症的小孩子饮食上怎么样的？",
        "cypher": "MATCH (m:Disease {name:'抽动症'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "精索静脉曲张有什么影响",
        "cypher": "MATCH (m:Disease {name: '精索静脉曲张'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "卵巢肿瘤有没有良性的",
        "cypher": "MATCH (m:Disease {name:'卵巢肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "外阴肿瘤有什么种类",
        "cypher": "MATCH (m:Disease {name:'外阴肿瘤'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "主动脉夹层保守治疗方法有什么",
        "cypher": "MATCH (d:Disease {name: '主动脉夹层'}) RETURN d.cure_way"
    },
    {
        "input": "高血压30年冠心病3年血糖高怎么办",
        "cypher": "MATCH (d:Disease {name: '高血压'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "淋巴癌的病因都有什么呢？",
        "cypher": "MATCH (n:Disease {name: '淋巴癌'}) RETURN n.cause"
    },
    {
        "input": "乳腺囊肿饮食注意什么",
        "cypher": "MATCH (v1:Disease {name: '乳腺囊肿'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "残胃癌饮食上应该怎么调节？",
        "cypher": "MATCH (v1:Disease {name: '残胃癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "小脑萎缩病症是怎么样的？",
        "cypher": "MATCH (m:Disease {name:'小脑萎缩'}) RETURN m.name, m.desc"
    },
    {
        "input": "身体虚弱，心慌，请专家帮忙分析分析病因？",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '心慌' RETURN n.cause"
    },
    {
        "input": "小儿鼻炎的治疗方法有哪些？",
        "cypher": "MATCH (d:Disease {name: '小儿鼻炎'}) RETURN d.cure_way"
    },
    {
        "input": "结核性腹膜炎能吃什么水喝奶粉和豆奶行吗？",
        "cypher": "MATCH (v1:Disease {name: '结核性腹膜炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "怎样治疗混合性结缔组织病？",
        "cypher": "MATCH (d:Disease {name: '混合性结缔组织病'}) RETURN d.cure_way"
    },
    {
        "input": "北京看急性宫颈炎哪家医院是最实在？",
        "cypher": "MATCH (n:Disease {name: '急性宫颈炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "手足口病好了以后多长时间可以不用隔离啊？",
        "cypher": "MATCH (d:Disease {name: '手足口病'}) RETURN d.cure_way"
    },
    {
        "input": "老人有脑血栓吃什么好？",
        "cypher": "MATCH (v1:Disease {name: '脑血栓'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "中风急救药有哪些？",
        "cypher": "MATCH (v1:Disease {name: '中风'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "小孩抽动症医院哪家好啊",
        "cypher": "MATCH (v1:Disease {name: '抽动症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "宫寒加月经不调怎么样才能受孕？",
        "cypher": "MATCH (d:Disease {name: '宫寒'}) RETURN d.cure_way"
    },
    {
        "input": "细菌性阴道炎和霉菌性阴道炎怎么用药",
        "cypher": "MATCH (v1:Disease {name: '细菌性阴道炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "会得的是鼻咽癌吗?",
        "cypher": "MATCH (m:Disease {name: '鼻咽癌'}) RETURN m.get_prob"
    },
    {
        "input": "前列腺炎反反复复怎么回事",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "精液不液化，成活率低怎么办",
        "cypher": "MATCH (d:Disease {name: '精液不液化'}) RETURN d.cure_way"
    },
    {
        "input": "盆腔积液1.8cm严不严重",
        "cypher": "MATCH (d:Disease {name: '盆腔积液'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "早泄最近小便异味重是有阳痿现象吗？",
        "cypher": "MATCH (m:Disease {name:'早泄'})-[:acompany_with]->(n:Disease) WHERE n.name = '阳痿' RETURN m,n"
    },
    {
        "input": "小儿维生素B2缺乏病什么症状？",
        "cypher": "MATCH (m:Disease {name:'小儿维生素B2缺乏病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "诊断胰腺癌的方法有哪些",
        "cypher": "MATCH (m:Disease {name: '胰腺癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "胃癌患者术后产生并发症发怎么办",
        "cypher": "MATCH (m:Disease {name: '胃癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "这症状是血管炎吗？",
        "cypher": "MATCH (n:Symptom {name: '血管炎'}) RETURN n"
    },
    {
        "input": "血管炎肺部严重感染怎么治疗靠谱？",
        "cypher": "MATCH (d:Disease {name: '血管炎'}) RETURN d.cure_way"
    },
    {
        "input": "子宫内膜薄怎么处理好？",
        "cypher": "MATCH (d:Disease {name: '子宫内膜薄'}) RETURN d.cure_way"
    },
    {
        "input": "癫痫饮食注意事项是什么呀？",
        "cypher": "MATCH (n:Disease {name: '癫痫'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "请问这样会有什么吗？因为我已经有2次自然流产",
        "cypher": "MATCH (m:Disease {name: '自然流产'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "血栓性静脉炎的症状有什么",
        "cypher": "MATCH (m:Disease {name:'血栓性静脉炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "有卵巢囊肿吃什么食物比较好",
        "cypher": "MATCH (v1:Disease {name: '卵巢囊肿'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "面神经炎后期需要治疗吗",
        "cypher": "MATCH (d:Disease {name: '面神经炎'}) RETURN d.cure_way"
    },
    {
        "input": "支气管哮喘如何医治支气管哮喘如何医治",
        "cypher": "MATCH (d:Disease {name: '支气管哮喘'}) RETURN d.cure_way"
    },
    {
        "input": "我想了解一下治疗哮喘的好医院都有哪几家呢？",
        "cypher": "MATCH (v1:Disease {name: '哮喘'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "自从上次出了一个车祸之后我就不知道为什么经常",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name CONTAINS '经常' RETURN d.name"
    },
    {
        "input": "贲门癌晚期吃饭需要用水送怎么办",
        "cypher": "MATCH (m:Disease {name: '贲门癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "坐骨神经痛要如何治疗",
        "cypher": "MATCH (d:Disease {name: '坐骨神经痛'}) RETURN d.cure_way"
    },
    {
        "input": "肝血管瘤会自己变小吗",
        "cypher": "MATCH (m:Disease {name: '肝血管瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "如何知道女性阴道是酸性还是碱性",
        "cypher": "MATCH (n:Disease)-[r:belongs_to]->(m:Department) WHERE m.name = '妇科' AND n.name = '阴道炎' RETURN n.get_prob"
    },
    {
        "input": "如何确定是大肠癌早期",
        "cypher": "MATCH (m:Disease {name: '大肠癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "身体出现包茎了怎么办",
        "cypher": "MATCH (m:Disease {name: '包茎'}) RETURN m.cure_way"
    },
    {
        "input": "各位医生所见过的肺癌患者生存期最久的是？",
        "cypher": "MATCH (d:Disease {name: '肺癌'}) RETURN d.cure_way"
    },
    {
        "input": "合肥哪家医院治疗性功能障碍好",
        "cypher": "MATCH (v1:Disease {name: '性功能障碍'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "前列腺囊肿怎么回事？",
        "cypher": "MATCH (m:Disease {name:'前列腺囊肿'}) RETURN m.name,m.desc"
    },
    {
        "input": "甲亢恢复期的患者要注意什么",
        "cypher": "MATCH (d:Disease {name: '甲亢'}) RETURN d.easy_get"
    },
    {
        "input": "怎么预防睾丸癌发病而且还是比较安全的？",
        "cypher": "MATCH (m:Disease {name:'睾丸癌'}) RETURN m.prevent"
    },
    {
        "input": "尿急是尿路感染引起的吗",
        "cypher": "MATCH (m:Disease {name:'尿路感染'})-[:has_symptom]->(n:Symptom {name:'尿急'}) RETURN m,n"
    },
    {
        "input": "怀孕一个多月，白带异常，该如何办？",
        "cypher": "MATCH (n:Disease {name:'白带异常'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "附睾畸形治疗哪家比较好？",
        "cypher": "MATCH (n1:Disease {name: '附睾畸形'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "请问月经不调可以要孩子吗",
        "cypher": "MATCH (d:Disease {name: '月经不调'}) RETURN d.easy_get"
    },
    {
        "input": "请问什么是轻度脂肪肝",
        "cypher": "MATCH (n:Disease) WHERE n.name = '脂肪肝' RETURN n.desc"
    },
    {
        "input": "重庆哪有治疗前列腺脓肿的医院",
        "cypher": "MATCH (v1:Disease {name: '前列腺脓肿'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "得甲亢九年了。。",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:belongs_to]->(b:Department) RETURN b.name AS name"
    },
    {
        "input": "是否得了乳腺癌",
        "cypher": "MATCH (m:Disease {name: '乳腺癌'}) RETURN m"
    },
    {
        "input": "脖子与肩中间有个脂肪瘤要怎么办",
        "cypher": "MATCH (d:Disease {name: '脂肪瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "食管癌有哪些术后并发症",
        "cypher": "MATCH (m:Disease {name: '食管癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "肝癌的原因都是什么",
        "cypher": "MATCH (m:Disease {name: '肝癌'}) RETURN m.cause"
    },
    {
        "input": "多发性软骨瘤或许在多大年龄会恶化",
        "cypher": "MATCH (m:Disease {name:'多发性软骨瘤'})-[:acompany_with]->(n:Disease) RETURN n.get_way"
    },
    {
        "input": "细菌性阴道炎久治不愈什么原因",
        "cypher": "MATCH (n:Disease {name: '细菌性阴道炎'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "请问窦性心律失常对身体有影响吗",
        "cypher": "MATCH (m:Disease {name:'窦性心律失常'}) RETURN m.desc"
    },
    {
        "input": "急性盆腔炎治疗需要花多少钱",
        "cypher": "MATCH (d:Disease {name: '急性盆腔炎'}) RETURN d.cure_way"
    },
    {
        "input": "肺癌患者的饮食需要注意些什么",
        "cypher": "MATCH (m:Disease {name: '肺癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "肠梗阻后遗症，总是拉肚子不吸收怎么办？",
        "cypher": "MATCH (m:Disease {name: '肠梗阻'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "怎样能确诊是否是肺病",
        "cypher": "MATCH (m:Disease {name:'肺病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "想知道甲状旁腺功能减退症是什么情况",
        "cypher": "MATCH (m:Disease {name:'甲状旁腺功能减退症'}) RETURN m.name,m.desc"
    },
    {
        "input": "卵巢浆液性肿瘤应该怎么治疗",
        "cypher": "MATCH (d:Disease {name: '卵巢浆液性肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "癌症复查要去原医院吗",
        "cypher": "MATCH (v1:Disease {name: '癌症'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "重度脂肪肝的症状有哪些",
        "cypher": "MATCH (m:Disease {name:'重度脂肪肝'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "附件炎的发病原因有哪几种呢？",
        "cypher": "MATCH (n:Disease {name: '附件炎'}) RETURN n.cause"
    },
    {
        "input": "甘油三脂高，血脂高怎么调理",
        "cypher": "MATCH (d:Disease)-[r:do_eat]->(f:Food) WHERE d.name = '高血脂' RETURN f.name"
    },
    {
        "input": "小儿支气管哮喘能根治吗?",
        "cypher": "MATCH (n:Disease {name: '小儿支气管哮喘'}) RETURN n.cured_prob"
    },
    {
        "input": "脑外伤如何有效的恢复偏瘫的手脚？",
        "cypher": "MATCH (d:Disease {name: '脑外伤'}) RETURN d.cure_way"
    },
    {
        "input": "想知道淋巴癌是一种什么病",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'})-[]->(n) RETURN m,n"
    },
    {
        "input": "中暑能汗蒸吗",
        "cypher": "MATCH (d:Disease {name: '中暑'}) RETURN d.cure_way"
    },
    {
        "input": "两岁的宝宝体重29斤有点咳嗽可以泡澡吗？",
        "cypher": "MATCH (d:Disease {name: '咳嗽'}) RETURN d.easy_get"
    },
    {
        "input": "新生儿黄疸18高吗",
        "cypher": "MATCH (m:Disease {name: '新生儿黄疸'}) RETURN m.get_prob"
    },
    {
        "input": "衣原体肺炎的大致症状是什么？",
        "cypher": "MATCH (n:Disease {name: '衣原体肺炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "经常便血怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '便血'}) RETURN d.cure_way"
    },
    {
        "input": "婴儿痉挛症怎么办？",
        "cypher": "MATCH (d:Disease {name: '婴儿痉挛症'}) RETURN d.cure_way"
    },
    {
        "input": "破伤风药物有副作用吗？",
        "cypher": "MATCH (n:Disease {name: '破伤风'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "前列腺囊肿会导致什么后果？",
        "cypher": "MATCH (m:Disease {name:'前列腺囊肿'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "结核性胸膜炎治疗期间意外怀孕，孩子能要吗",
        "cypher": "MATCH (d:Disease {name: '结核性胸膜炎'}) RETURN d.cure_way"
    },
    {
        "input": "直肠癌患者的膳食原则是怎样的",
        "cypher": "MATCH (n:Disease {name: '直肠癌'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "得了克罗恩病用什么缓解方法",
        "cypher": "MATCH (d:Disease {name: '克罗恩病'}) RETURN d.cure_way"
    },
    {
        "input": "多发性肌炎如何治疗",
        "cypher": "MATCH (d:Disease {name: '多发性肌炎'}) RETURN d.cure_way"
    },
    {
        "input": "高原病以后能重回西藏工作吗？",
        "cypher": "MATCH (d:Disease {name: '高原病'}) RETURN d.cure_way"
    },
    {
        "input": "治子宫内膜炎专科哪家好？",
        "cypher": "MATCH (n:Disease {name: '子宫内膜炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "我的甘油三酯高达9.1怎么办？",
        "cypher": "MATCH (d:Disease {name: '高甘油三酯血症'}) RETURN d.cure_way"
    },
    {
        "input": "宝宝肺炎住院有呼声如何改善",
        "cypher": "MATCH (d:Disease {name: '肺炎'})-[:belongs_to]->(dp:Department)<-[:belongs_to]-(d2:Disease {name: '呼吸衰竭'}) RETURN dp"
    },
    {
        "input": "关于胸膜炎复发的问题",
        "cypher": "MATCH (d:Disease {name: '胸膜炎'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "不同的精子会不会在子宫里斗争",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜异位症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "红斑狼疮在生活中需要注意那些食材那?",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "侏儒症的人性生活有吗",
        "cypher": "MATCH (d:Disease {name: '侏儒症'}) RETURN d.easy_get"
    },
    {
        "input": "宫颈肥大的危害有啥",
        "cypher": "MATCH (m:Disease {name:'宫颈肥大'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "我的宝宝得了佝偻病该怎么办啊？",
        "cypher": "MATCH (d:Disease {name: '佝偻病'}) RETURN d.cure_way"
    },
    {
        "input": "胃石症症状最佳治疗是什么",
        "cypher": "MATCH (d:Disease {name: '胃石症'}) RETURN d.cure_way"
    },
    {
        "input": "肿瘤体检",
        "cypher": "MATCH (m:Disease {name: '肿瘤'})-[:need_check]->(n:Check) RETURN n"
    },
    {
        "input": "治脑血管硬化那些药物效果较好?",
        "cypher": "MATCH (v1:Disease {name: '脑血管硬化'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "肾移植后服用进口抗排异药物要多少钱？",
        "cypher": "MATCH (n:Disease {name: '肾移植'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name, m.price"
    },
    {
        "input": "错构瘤可不可能",
        "cypher": "MATCH (d:Disease {name: '错构瘤'}) RETURN d.cure_way"
    },
    {
        "input": "吃什么对妇科疾病有好处",
        "cypher": "MATCH (v1:Disease {name: '妇科疾病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "一般混合痔有什么症状",
        "cypher": "MATCH (m:Disease {name:'混合痔'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "宝宝到医院怎么能检查出是不是佝偻病？或许",
        "cypher": "MATCH (m:Disease {name:'佝偻病'})-[:need_check]->(n:Check) RETURN m.name, n.name"
    },
    {
        "input": "前列腺病怎么治疗好？",
        "cypher": "MATCH (m:Disease {name:'前列腺病'}) RETURN m.cure_way"
    },
    {
        "input": "精索静脉曲张怎么引起的？",
        "cypher": "MATCH (m:Disease {name:'精索静脉曲张'}) RETURN m.cause"
    },
    {
        "input": "我想请问一下口腔疾病。",
        "cypher": "MATCH (m:Disease {name: '口腔疾病'}) RETURN m"
    },
    {
        "input": "呕吐厉害怎么回事",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'呕吐'}) RETURN m.name"
    },
    {
        "input": "盆腔积液12mm严重吗",
        "cypher": "MATCH (m:Disease {name:'盆腔积液'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "治疗乳腺癌费用大约多少钱会很贵吗？",
        "cypher": "MATCH (n:Disease {name: '乳腺癌'}) RETURN n.cost_money"
    },
    {
        "input": "治疗肝母细胞瘤费用是多少？",
        "cypher": "MATCH (m:Disease {name:'肝母细胞瘤'})-[:belongs_to]->(n:Department) RETURN n.cost_money"
    },
    {
        "input": "如何治疗失语症我应该在饮食方面多注意些什么呢",
        "cypher": "MATCH (d:Disease {name: '失语症'}) RETURN d.cure_way"
    },
    {
        "input": "宝宝拉尿有点截想拉又有点拉不出的怎么办",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name CONTAINS '尿频' OR s.name CONTAINS '尿急' OR s.name CONTAINS '尿痛' RETURN d.name"
    },
    {
        "input": "亚急性甲状腺炎这种病该如何治疗",
        "cypher": "MATCH (d:Disease {name: '亚急性甲状腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "鞘膜积液多长时间能治好",
        "cypher": "MATCH (d:Disease {name: '鞘膜积液'}) RETURN d.cure_way"
    },
    {
        "input": "肝脓肿这个疾病需要什么样子的治疗方法好点那?",
        "cypher": "MATCH (d:Disease {name: '肝脓肿'}) RETURN d.cure_way"
    },
    {
        "input": "请问哪有治疗痔疮好的医院",
        "cypher": "MATCH (n:Disease {name: '痔疮'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "我得的是霉菌性阴道炎，现在我老公被我传染了他",
        "cypher": "MATCH (d:Disease {name: '霉菌性阴道炎'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "上呼吸道感染要包括什么",
        "cypher": "MATCH (m:Disease)-[r1:belongs_to]->(n:Department) WHERE m.name='上呼吸道感染' RETURN n.name"
    },
    {
        "input": "精液不液化的诊断多少钱",
        "cypher": "MATCH (n:Disease {name: '精液不液化'})-[:need_check]->(m:Check) RETURN m.name AS name, n.cost_money AS cost_money"
    },
    {
        "input": "求问甲状腺功能减退咋办？",
        "cypher": "MATCH (d:Disease {name: '甲状腺功能减退'}) RETURN d.cure_way"
    },
    {
        "input": "包皮龟头炎的治疗费用",
        "cypher": "MATCH (n:Disease {name:'包皮龟头炎'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "什么是卵巢癌？",
        "cypher": "MATCH (m:Disease {name:'卵巢癌'}) RETURN m.name, m.desc"
    },
    {
        "input": "北京专业治疗肺癌的医院有哪些？",
        "cypher": "MATCH (v1:Disease {name: '肺癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "弱智遗传的几率有多大",
        "cypher": "MATCH (n:Disease {name: '弱智'}) RETURN n.get_prob"
    },
    {
        "input": "是否得了子宫内膜异位症",
        "cypher": "MATCH (m:Disease {name:'子宫内膜异位症'}) RETURN m"
    },
    {
        "input": "怀孕10周流行性感冒合并细菌感染怎么治",
        "cypher": "MATCH (d:Disease {name: '流行性感冒'}) RETURN d.cure_way"
    },
    {
        "input": "肠癌术后会扩散吗",
        "cypher": "MATCH (m:Disease {name: '肠癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "孩子得了风湿热怎么办？",
        "cypher": "MATCH (d:Disease {name: '风湿热'}) RETURN d.cure_way"
    },
    {
        "input": "妊娠呕吐厉害会影响胎儿发育吗？",
        "cypher": "MATCH (m:Disease {name:'妊娠呕吐'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "动脉硬化能治疗好的吗",
        "cypher": "MATCH (d:Disease {name: '动脉硬化'}) RETURN d.cure_way"
    },
    {
        "input": "请问什么叫做外阴白斑呢",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name='外阴白斑' RETURN m.name,m.desc"
    },
    {
        "input": "小儿脑瘫的发病机制",
        "cypher": "MATCH (d:Disease {name: '小儿脑瘫'})-[:acompany_with]->(r:Disease) RETURN r.cause"
    },
    {
        "input": "心脏神经症导致失眠怎么治疗",
        "cypher": "MATCH (d:Disease {name: '心脏神经症'}) RETURN d.cure_way"
    },
    {
        "input": "直肠癌的危害很严重吗?",
        "cypher": "MATCH (m:Disease {name:'直肠癌'}) RETURN m.cause"
    },
    {
        "input": "手术后病人食谱",
        "cypher": "MATCH (v1:Disease)-[e1:do_eat]->(v2:Food) WHERE v1.name CONTAINS '手术后' RETURN v2.name"
    },
    {
        "input": "子宫肌瘤这种情况会不会病变",
        "cypher": "MATCH (n:Disease {name: '子宫肌瘤'})-[:acompany_with]-(m:Disease) RETURN m"
    },
    {
        "input": "视神经炎有什么好的治疗方法吗",
        "cypher": "MATCH (d:Disease {name: '视神经炎'}) RETURN d.cure_way"
    },
    {
        "input": "血压140-95服药高压80低压65",
        "cypher": "MATCH (d:Disease {name: '高血压'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "宝宝黄疸值5.7可以不吃药了吗？",
        "cypher": "MATCH (m:Disease {name: '黄疸'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "睾丸鞘膜积液通常的情况下怎样治疗效果好？",
        "cypher": "MATCH (m:Disease {name:'睾丸鞘膜积液'}) RETURN m.cure_way"
    },
    {
        "input": "胃溃疡在饮食上都需要注意什么？",
        "cypher": "MATCH (m:Disease {name:'胃溃疡'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "难治性癫痫是什么症状",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '难治性癫痫' RETURN n.name"
    },
    {
        "input": "癌症晚期吃不下饭了怎么办",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "淋巴癌饮食要注意哪些情况",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'})-[:no_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "前列腺增生早期表现是什么",
        "cypher": "MATCH (m:Disease {name: '前列腺增生'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "怎么才能让气胸断根?",
        "cypher": "MATCH (d:Disease {name: '气胸'}) RETURN d.cure_way"
    },
    {
        "input": "重度脂肪肝的后果",
        "cypher": "MATCH (m:Disease {name: '重度脂肪肝'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "宝宝的肠套叠的症状有什么",
        "cypher": "MATCH (m:Disease {name: '肠套叠'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肺癌都是些什么原因引起的？",
        "cypher": "MATCH (n:Disease {name: '肺癌'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "请问国内哪家医院能治疗败血症？",
        "cypher": "MATCH (n1:Disease {name: '败血症'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "结直肠癌晚期的治疗方法有哪些?",
        "cypher": "MATCH (d:Disease {name: '结直肠癌'}) RETURN d.cure_way"
    },
    {
        "input": "子宫肌瘤怀孕会不会对胎儿有影响",
        "cypher": "MATCH (d:Disease {name: '子宫肌瘤'}) RETURN d.easy_get"
    },
    {
        "input": "怎样预防结肠癌的发生？",
        "cypher": "MATCH (n:Disease {name: '结肠癌'}) RETURN n.prevent"
    },
    {
        "input": "我这是子宫内膜增生吗？",
        "cypher": "MATCH (m:Disease {name:'子宫内膜增生'}) RETURN m"
    },
    {
        "input": "中国治白血病最好的医院",
        "cypher": "MATCH (v1:Disease {name: '白血病'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "咨询骨软骨瘤能够手术吗？",
        "cypher": "MATCH (d:Disease {name: '骨软骨瘤'}) RETURN d.cure_way"
    },
    {
        "input": "泌尿感染的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'泌尿感染'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "慢性附睾炎单纯用药见效快吗?",
        "cypher": "MATCH (n1:Disease {name: '慢性附睾炎'})-[:common_drug|:recommand_drug]->(n2:Drug) RETURN n2.name"
    },
    {
        "input": "红斑狼疮的病人饮食该怎么吃？",
        "cypher": "MATCH (v1:Disease {name: '红斑狼疮'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "包皮蹭破了会不会得艾滋病呢？",
        "cypher": "MATCH (m:Disease {name:'艾滋病'}) RETURN m.get_way"
    },
    {
        "input": "中风后遗症，头脑清醒，但大小便失禁怎么办？",
        "cypher": "MATCH (d:Disease {name: '中风后遗症'}) RETURN d.cure_way"
    },
    {
        "input": "我老公多次检测染色体为46XX，请问能生",
        "cypher": "MATCH (d:Disease {name: '染色体异常'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "阴茎癌术后四个月,出现腹股沟淋巴肿大,急寻治",
        "cypher": "MATCH (d:Disease {name: '阴茎癌'})-[:acompany_with]->(r:Disease) RETURN r"
    },
    {
        "input": "脑癌有哪些特点",
        "cypher": "MATCH (m:Disease {name:'脑癌'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "如何可以有效预防死精症？",
        "cypher": "MATCH (n:Disease {name: '死精症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肝癌如何判断是晚期还是早期",
        "cypher": "MATCH (d:Disease {name: '肝癌'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "嗜铬细胞瘤怎么检查",
        "cypher": "MATCH (m:Disease {name: '嗜铬细胞瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "是淋巴癌还是白血病",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "孩子五岁啦发现有便血是什么情况",
        "cypher": "MATCH (m:Disease {name: '便血'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "照顾我婆婆 甲亢需要注意些什么呢？",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:belongs_to]->(n:Department) RETURN m.cause,n.name"
    },
    {
        "input": "尿道肉阜的注意事项有哪些？",
        "cypher": "MATCH (m:Disease {name:'尿道肉阜'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "急性淋巴结炎吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '急性淋巴结炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "早泄请问是什么疾病",
        "cypher": "MATCH (n:Disease {name: '早泄'}) RETURN n"
    },
    {
        "input": "我已经5个月没来月经啦，正常吗",
        "cypher": "MATCH (n:Disease {name:'闭经'}) RETURN n.get_prob"
    },
    {
        "input": "请问两个月没有来月经，是不是得了什么病。",
        "cypher": "MATCH (m:Disease {name: '闭经'}) RETURN m"
    },
    {
        "input": "肾结石看好费用是多少",
        "cypher": "MATCH (v1:Disease {name: '肾结石'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "吃什么对肺炎恢复期好",
        "cypher": "MATCH (v1:Disease {name: '肺炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "臂丛神经损伤有哪些典型症状？",
        "cypher": "MATCH (m:Disease {name:'臂丛神经损伤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "性冷淡的表现都有哪些",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '性冷淡' RETURN n.name"
    },
    {
        "input": "脂肪肝临床症状表现在哪",
        "cypher": "MATCH (m:Disease {name: '脂肪肝'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小儿脑水肿与颅内高压综合征该怎么办？",
        "cypher": "MATCH (d:Disease {name: '小儿脑水肿与颅内高压综合征'}) RETURN d.cure_way"
    },
    {
        "input": "肾囊肿吃啥药？",
        "cypher": "MATCH (v1:Disease {name: '肾囊肿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "小儿癫痫发病机理是什么",
        "cypher": "MATCH (m:Disease {name:'小儿癫痫'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "龟头炎都会有哪些问题呢",
        "cypher": "MATCH (m:Disease)-[r1:acompany_with]->(n:Disease) WHERE m.name='龟头炎' RETURN n.name"
    },
    {
        "input": "癫痫病人吃过的东西能给八九个月的孩子吃吗?",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "男人包皮过长影响性生活吗？",
        "cypher": "MATCH (m:Disease {name:'包皮过长'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "皮肤癌的原因是什么",
        "cypher": "MATCH (m:Disease {name: '皮肤癌'}) RETURN m.cause"
    },
    {
        "input": "76岁老人，哮喘，起床前咳嗽不止，吃什么药缓",
        "cypher": "MATCH (n:Disease {name: '哮喘'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "小儿哮喘性肌萎缩综合征怎么治疗啊？",
        "cypher": "MATCH (d:Disease {name: '小儿哮喘性肌萎缩综合征'}) RETURN d.cure_way"
    },
    {
        "input": "胸腔积液可以引起其他的疾病吗？",
        "cypher": "MATCH (v1:Disease {name: '胸腔积液'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "太原哪有治疗胆囊炎的医院",
        "cypher": "MATCH (v1:Disease {name: '胆囊炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肋间神经痛有20年了，还能治好不？",
        "cypher": "MATCH (d:Disease {name: '肋间神经痛'}) RETURN d.cure_way"
    },
    {
        "input": "阴道炎时做人流能放药吗？",
        "cypher": "MATCH (v1:Disease {name: '阴道炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "急性附睾炎明显症状是什么？",
        "cypher": "MATCH (m:Disease {name:'急性附睾炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "鼻咽癌通常会导致什么并发症？",
        "cypher": "MATCH (m:Disease {name:'鼻咽癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "如果是酒精性心肌病怎么治疗",
        "cypher": "MATCH (d:Disease {name: '酒精性心肌病'}) RETURN d.cure_way"
    },
    {
        "input": "心肌炎严重后果是什么",
        "cypher": "MATCH (m:Disease {name:'心肌炎'}) RETURN m.desc"
    },
    {
        "input": "帕金森病是什么原因引起的",
        "cypher": "MATCH (n:Disease {name: '帕金森病'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "脑动静脉畸形可以治愈吗？",
        "cypher": "MATCH (d:Disease {name: '脑动静脉畸形'}) RETURN d.cure_way"
    },
    {
        "input": "肠系膜上动脉血栓形成这病严重吗？",
        "cypher": "MATCH (n:Disease {name:'肠系膜上动脉血栓形成'}) RETURN n.cure_lasttime"
    },
    {
        "input": "31岁月经量少怎么回事？",
        "cypher": "MATCH (m:Disease {name:'月经量少'})<-[:acompany_with]->(n:Disease) RETURN m.name,n.name"
    },
    {
        "input": "乳腺癌初期自检如何判断?",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "癫痫做哪些检查更好",
        "cypher": "MATCH (v1:Disease {name: '癫痫'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "什么是肝血管瘤呢？",
        "cypher": "MATCH (m:Disease {name:'肝血管瘤'}) RETURN m.name,m.desc"
    },
    {
        "input": "有死精症的危害有哪些？",
        "cypher": "MATCH (m:Disease {name:'死精症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "哪里治疗尿道炎效果好",
        "cypher": "MATCH (v1:Disease {name: '尿道炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "患有哮喘应该怎么调理比较好？",
        "cypher": "MATCH (v1:Disease {name: '哮喘'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "性功能障碍到底是指什么?",
        "cypher": "MATCH (n:Disease) WHERE n.name = '性功能障碍' RETURN n.desc"
    },
    {
        "input": "得了肛周脓肿需要注意什么？",
        "cypher": "MATCH (m:Disease {name:'肛周脓肿'}) RETURN m.prevent"
    },
    {
        "input": "早产儿应该注意什么？",
        "cypher": "MATCH (d:Disease {name: '早产儿'}) RETURN d.easy_get"
    },
    {
        "input": "乳头内陷对哺乳有影响吗？",
        "cypher": "MATCH (d:Disease {name: '乳头内陷'}) RETURN d.easy_get"
    },
    {
        "input": "请问什么是腺样体肥大？",
        "cypher": "MATCH (m:Disease) WHERE m.name='腺样体肥大' RETURN m.desc"
    },
    {
        "input": "细菌性前列腺炎怎么治疗比较好？",
        "cypher": "MATCH (d:Disease {name: '细菌性前列腺炎'}) RETURN d.cure_way"
    },
    {
        "input": "睾丸囊肿需要注意什么",
        "cypher": "MATCH (d:Disease {name: '睾丸囊肿'}) RETURN d.easy_get"
    },
    {
        "input": "小儿多动症怎么进行治疗",
        "cypher": "MATCH (d:Disease {name: '小儿多动症'}) RETURN d.cure_way"
    },
    {
        "input": "面瘫需要查血吗？",
        "cypher": "MATCH (m:Disease {name:'面瘫'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "滴虫性阴道炎是啥？",
        "cypher": "MATCH (m:Disease {name:'滴虫性阴道炎'}) RETURN m.name, m.desc"
    }
]