[
    {
        "input": "我结婚10年没有孩子，我是男性不育吗？",
        "cypher": "MATCH (n:Disease)-[r1:has_symptom]->(m:Symptom) WHERE m.name CONTAINS '不育' RETURN n.name"
    },
    {
        "input": "阳痿了怎么样才能检查出来",
        "cypher": "MATCH (m:Disease {name: '阳痿'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "小脑萎缩有遗传导吗?",
        "cypher": "MATCH (m:Disease {name:'小脑萎缩'}) RETURN m.get_way"
    },
    {
        "input": "脊髓肿瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name: '脊髓肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肾上腺肿瘤激素检测都正常?",
        "cypher": "MATCH (m:Disease {name: '肾上腺肿瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "治疗哮喘最专业的医院在哪？",
        "cypher": "MATCH (n:Disease {name: '哮喘'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "包皮龟头炎危害生殖系统健康吗？",
        "cypher": "MATCH (m:Disease {name:'包皮龟头炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "粘连性肠梗阻的咨询",
        "cypher": "MATCH (m:Disease {name:'粘连性肠梗阻'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "小孩经常咳嗽加哮喘怎么办?",
        "cypher": "MATCH (m:Disease {name:'哮喘'})-[:has_symptom]->(n:Symptom {name:'咳嗽'}) RETURN m.cureWay"
    },
    {
        "input": "萎缩性胃炎患者要注意哪些",
        "cypher": "MATCH (v1:Disease {name: '萎缩性胃炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "恶性肿瘤的早期",
        "cypher": "MATCH (n:Disease {name: '恶性肿瘤'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "请问尿道结石在哪里治疗比较好？？结石形成",
        "cypher": "MATCH (m:Disease {name:'尿道结石'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "精囊炎用什么药效果好？",
        "cypher": "MATCH (n:Disease {name: '精囊炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "前列腺炎能是疼痛吗",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:has_symptom]->(n:Symptom) WHERE n.name CONTAINS '疼痛' RETURN m.name,n.name"
    },
    {
        "input": "面神经损伤怎么办，如何快速恢复",
        "cypher": "MATCH (d:Disease {name: '面神经损伤'}) RETURN d.cure_way"
    },
    {
        "input": "小儿支气管哮喘病的危害都有哪些？",
        "cypher": "MATCH (m:Disease {name:'小儿支气管哮喘'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "不孕不育的因素或病因有哪些？",
        "cypher": "MATCH (n:Disease {name: '不孕不育'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "甲亢有什么症状 我这是得了甲亢吗？",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:has_symptom]->(n:Symptom) RETURN m.name,collect(n.name)"
    },
    {
        "input": "神经性贪食症如何治疗",
        "cypher": "MATCH (d:Disease {name: '神经性贪食症'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺药物大概要多少钱",
        "cypher": "MATCH (v:Disease {name: '前列腺炎'})-[:common_drug|:recommand_drug]->(v1:Drug) RETURN v1.name, v1.cost_money"
    },
    {
        "input": "治疗肿瘤较好的医院有哪些？",
        "cypher": "MATCH (v1:Disease {name: '肿瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "乳腺结节需要注意什么",
        "cypher": "MATCH (m:Disease {name: '乳腺结节'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "癫痫症状都有哪些表现?",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '癫痫' RETURN n.name"
    },
    {
        "input": "患有淋巴癌饮食要注意什么",
        "cypher": "MATCH (v1:Disease {name: '淋巴癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "治疗肝癌中医院都有哪几家的治疗效果最好呢？",
        "cypher": "MATCH (n1:Disease {name: '肝癌'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "吃药的话能防止乳腺增生癌变吗？",
        "cypher": "MATCH (n:Disease {name: '乳腺增生'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "乳腺肿瘤切除后还会复发吗？",
        "cypher": "MATCH (m:Disease {name:'乳腺肿瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "小儿单侧肺异常透亮综合征",
        "cypher": "MATCH (m:Disease {name:'小儿单侧肺异常透亮综合征'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "头痛严重是什么原因",
        "cypher": "MATCH (m:Disease {name:'头痛'})<-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "您好我左肾因肿瘤被摘除半年后肾功复查怎么办",
        "cypher": "MATCH (v1:Disease {name: '肾肿瘤'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "癌症的高发年龄是多大，患癌几率多大",
        "cypher": "MATCH (n:Disease {name: '癌症'}) RETURN n.get_prob"
    },
    {
        "input": "粘连性肠梗阻会遗传吗?",
        "cypher": "MATCH (m:Disease {name:'粘连性肠梗阻'}) RETURN m.get_prob"
    },
    {
        "input": "霉菌性阴道炎请问怎么回事",
        "cypher": "MATCH (m:Disease {name: '霉菌性阴道炎'}) RETURN m"
    },
    {
        "input": "尿频是不是前列腺炎引起的",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'})-[:has_symptom]->(n:Symptom {name: '尿频'}) RETURN m, n"
    },
    {
        "input": "肾移植以后可以活多久呢",
        "cypher": "MATCH (d:Disease {name: '肾移植'}) RETURN d.cure_way"
    },
    {
        "input": "如何防治外阴肿瘤？",
        "cypher": "MATCH (m:Disease {name:'外阴肿瘤'}) RETURN m.prevent"
    },
    {
        "input": "乳腺增生在饮食方面应注意什么？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "胃下垂能怀孕吗",
        "cypher": "MATCH (d:Disease {name: '胃下垂'}) RETURN d.easy_get"
    },
    {
        "input": "小孩打了卡介疫苗的会感染结核病吗",
        "cypher": "MATCH (d:Disease {name: '结核病'}) RETURN d.easy_get"
    },
    {
        "input": "请问精索静脉曲张是什么",
        "cypher": "MATCH (m:Disease) WHERE m.name = '精索静脉曲张' RETURN m"
    },
    {
        "input": "肺气肿易感冒怎么办，有啥好中医药方",
        "cypher": "MATCH (d:Disease {name: '肺气肿'}) RETURN d.easy_get"
    },
    {
        "input": "频繁手淫因而导致的阳痿是什么性质的",
        "cypher": "MATCH (m:Disease {name: '阳痿'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "附睾炎是如何发病的",
        "cypher": "MATCH (m:Disease {name:'附睾炎'}) RETURN m.cause"
    },
    {
        "input": "糖尿病酮症酸中毒机理是什么？",
        "cypher": "MATCH (n:Disease {name: '糖尿病酮症酸中毒'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "甲状腺肿瘤迅速增大，怎么办?该看医生吗？",
        "cypher": "MATCH (d:Disease {name: '甲状腺肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "肝硬化常见症状表现",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "肺病咳嗽怎么治疗",
        "cypher": "MATCH (d:Disease {name: '肺病'}) RETURN d.cure_way"
    },
    {
        "input": "如何治疗好骨淋巴管瘤？",
        "cypher": "MATCH (d:Disease {name: '骨淋巴管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "你好~脑出血出院后，应注意事项,谢谢~",
        "cypher": "MATCH (m:Disease {name:'脑出血'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "治癫痫费用大约多少",
        "cypher": "MATCH (m:Disease {name:'癫痫'}) RETURN m.cost_money"
    },
    {
        "input": "记忆障碍用点什么药恢复的最好在哪里可以买到呢",
        "cypher": "MATCH (v1:Disease {name: '记忆障碍'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "囊状淋巴管瘤怎么食疗？",
        "cypher": "MATCH (n:Disease {name: '囊状淋巴管瘤'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "检查才能确认是肠易激综合征吗？",
        "cypher": "MATCH (m:Disease {name:'肠易激综合征'})<-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "怎么判断性病还是龟头炎",
        "cypher": "MATCH (m:Disease {name: '性病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "冠心病做那种检查效果较好。",
        "cypher": "MATCH (m:Disease {name:'冠心病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "扩张型心肌病吃什么药比较好？",
        "cypher": "MATCH (v1:Disease {name: '扩张型心肌病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "贲门癌诊断标准及做哪些检查",
        "cypher": "MATCH (m:Disease {name: '贲门癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "针对风寒感冒和风热感冒有什么区别",
        "cypher": "MATCH (m:Disease {name:'风寒感冒'})-[]->(n) RETURN m,n"
    },
    {
        "input": "结肠癌病人不能吃什么",
        "cypher": "MATCH (v1:Disease {name: '结肠癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "检查睾丸炎大约要多少钱",
        "cypher": "MATCH (m:Disease {name:'睾丸炎'})-[:need_check]->(n:Check) RETURN n.name,m.cost_mone"
    },
    {
        "input": "胆结石22mm",
        "cypher": "MATCH (m:Disease {name: '胆结石'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "肝脏血管瘤的注意事项有哪些？",
        "cypher": "MATCH (m:Disease {name:'肝脏血管瘤'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "心慌气短和喘气困难怎么回事",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '心慌气短' OR n.name = '喘气困难' RETURN m.name"
    },
    {
        "input": "皮肤癌患者平时怎么护理",
        "cypher": "MATCH (m:Disease {name: '皮肤癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "用什么抗生素治疗急性乳腺炎好",
        "cypher": "MATCH (d:Disease {name: '急性乳腺炎'})-[:common_drug|:recommand_drug]->(drug:Drug) RETURN drug.name"
    },
    {
        "input": "什么是脐炎",
        "cypher": "MATCH (m:Disease {name: '脐炎'}) RETURN m"
    },
    {
        "input": "残胃癌腹泻如何治疗？",
        "cypher": "MATCH (d:Disease {name: '残胃癌'}) RETURN d.cure_way"
    },
    {
        "input": "尿道与阴茎结核要怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '尿道与阴茎结核'}) RETURN d.cure_way"
    },
    {
        "input": "治疗精液不液化费用大概要多少钱",
        "cypher": "MATCH (n:Disease {name: '精液不液化'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "男科病该如何治疗",
        "cypher": "MATCH (d:Disease {name: '男科病'}) RETURN d.cure_way"
    },
    {
        "input": "得了宫颈息肉以后的注意事项",
        "cypher": "MATCH (v1:Disease {name: '宫颈息肉'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "胰腺囊肿切除后有可能复发吗？",
        "cypher": "MATCH (n:Disease {name: '胰腺囊肿'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "确诊卵巢癌要做哪些检查",
        "cypher": "MATCH (v1:Disease {name: '卵巢癌'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "胰腺癌转移有哪些途径",
        "cypher": "MATCH (v1:Disease {name: '胰腺癌'})-[:acompany_with]->(v2:Disease) RETURN v2.name"
    },
    {
        "input": "治疗鱼鳞病多少钱？",
        "cypher": "MATCH (n:Disease {name: '鱼鳞病'}) RETURN n.cost_money"
    },
    {
        "input": "精索静脉曲张不知道严不严重",
        "cypher": "MATCH (m:Disease {name: '精索静脉曲张'}) RETURN m.cure_lasttime, m.cured_prob"
    },
    {
        "input": "治疗小儿多动症的医院那里好。",
        "cypher": "MATCH (n:Disease {name: '小儿多动症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "卵巢癌发病的原因是啥?",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'}) RETURN m.cause"
    },
    {
        "input": "有了睡眠型癫痫怎么样治较好？",
        "cypher": "MATCH (d:Disease {name: '睡眠型癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "5个月宝宝突然晕厥，怎么办？",
        "cypher": "MATCH (m:Disease {name:'晕厥'})-[:has_symptom]->(n:Symptom) RETURN m.cure_lasttime"
    },
    {
        "input": "痛风应该挂什么科",
        "cypher": "MATCH (v1:Disease {name: '痛风'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "\n你好，蔡医生我是一名直肠癌病人，以切除19",
        "cypher": "MATCH (d:Disease {name: '直肠癌'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "痛风性关节炎用什么药好？",
        "cypher": "MATCH (v1:Disease {name: '痛风性关节炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "如何防肺癌呀",
        "cypher": "MATCH (m:Disease {name: '肺癌'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "直肠癌术后的并发症",
        "cypher": "MATCH (v1:Disease {name: '直肠癌'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "百日咳病因有哪些？",
        "cypher": "MATCH (n:Disease {name: '百日咳'}) RETURN n.cause"
    },
    {
        "input": "阴茎隔小姐内裤丝袜摩擦会感染艾滋吗",
        "cypher": "MATCH (m:Disease {name: '艾滋病'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "脑胶质瘤手术后吃什么对病情有帮助？",
        "cypher": "MATCH (v1:Disease {name: '脑胶质瘤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "烫伤能用创灼膏吗",
        "cypher": "MATCH (v1:Disease {name: '烫伤'})-[:common_drug|:recommand_drug]->(v2:Drug {name: '创灼膏'}) RETURN v2"
    },
    {
        "input": "精索静脉曲张手术价格是多少",
        "cypher": "MATCH (v1:Disease {name: '精索静脉曲张'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "肾虚是吃六味地黄丸吗",
        "cypher": "MATCH (v1:Disease {name: '肾虚'})-[:common_drug|:recommand_drug]->(v2:Drug {name: '六味地黄丸'}) RETURN v1, v2"
    },
    {
        "input": "急性荨麻疹可以自愈吗",
        "cypher": "MATCH (d:Disease {name: '急性荨麻疹'}) RETURN d.cure_way"
    },
    {
        "input": "心脏神经症的病因？",
        "cypher": "MATCH (n:Disease {name: '心脏神经症'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "怎么确诊胸腺癌",
        "cypher": "MATCH (m:Disease {name: '胸腺癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "阳痿早泄是什么样的吗？",
        "cypher": "MATCH (m:Disease) WHERE m.name = '阳痿' RETURN m.desc"
    },
    {
        "input": "得了卵巢癌腹水怎么办",
        "cypher": "MATCH (m:Disease {name: '卵巢癌'})-[:has_symptom]->(n:Symptom {name: '腹水'}) RETURN m.cureWay"
    },
    {
        "input": "颅脑损伤患者观察需要护理什么",
        "cypher": "MATCH (v1:Disease {name: '颅脑损伤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "焦虑症最严重能到什么程度",
        "cypher": "MATCH (n:Disease {name: '焦虑症'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "红斑狼疮请问治的好吗?",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'}) RETURN m.cured_prob"
    },
    {
        "input": "想知道为什么会得肾病",
        "cypher": "MATCH (m:Disease {name: '肾病'}) RETURN m.cause"
    },
    {
        "input": "胃穿孔应该注意什么，吃什么药，打什么药水",
        "cypher": "MATCH (m:Disease {name:'胃穿孔'})-[:belongs_to]->(n:Department) RETURN m.prevent,n.name"
    },
    {
        "input": "食管有良性肿瘤好治吗",
        "cypher": "MATCH (d:Disease {name: '食管良性肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "医院哪个治输精管堵塞好",
        "cypher": "MATCH (v1:Disease {name: '输精管堵塞'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "巨人症治好后能活多久",
        "cypher": "MATCH (d:Disease {name: '巨人症'}) RETURN d.cure_way"
    },
    {
        "input": "神经内科疾病",
        "cypher": "MATCH (v1:Disease)-[v2:belongs_to]->(v3:Department) WHERE v3.name = '神经内科' RETURN v1"
    },
    {
        "input": "十二指肠溃疡会哪里感觉疼痛",
        "cypher": "MATCH (m:Disease {name: '十二指肠溃疡'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "感冒发烧和拉肚子的症状是什么",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "请教卵巢囊肿",
        "cypher": "MATCH (m:Disease {name: '卵巢囊肿'}) RETURN m"
    },
    {
        "input": "肝癌晚期癌症患者用哪些药？",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "外痔治疗的费用要多少",
        "cypher": "MATCH (n:Disease {name: '外痔'}) RETURN n.cost_money"
    },
    {
        "input": "治疗宫外孕费用贵吗",
        "cypher": "MATCH (n:Disease {name:'宫外孕'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "怎么预防化脓性扁桃体炎",
        "cypher": "MATCH (m:Disease {name:'化脓性扁桃体炎'}) RETURN m.prevent"
    },
    {
        "input": "诱发大肠癌原因",
        "cypher": "MATCH (n:Disease {name: '大肠癌'})-[:acompany_with]-(m:Disease) RETURN m.cause"
    },
    {
        "input": "甲状腺腺瘤手术后疤痕使用什么药物涂抹？",
        "cypher": "MATCH (n:Disease {name: '甲状腺腺瘤'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "请问 医生 甲亢都有些什么症状？危害是什么？",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "要是月经不调的影响有哪些",
        "cypher": "MATCH (m:Disease {name: '月经不调'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "治疗附件炎花多少钱",
        "cypher": "MATCH (n:Disease {name:'附件炎'}) RETURN n.cost_money"
    },
    {
        "input": "子宫性不孕的症状是什么呢？",
        "cypher": "MATCH (n:Disease {name: '子宫性不孕'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "北京治鼻窦炎哪家医院效果好",
        "cypher": "MATCH (v1:Disease {name: '鼻窦炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "新生儿黄疸哪里去测",
        "cypher": "MATCH (v1:Disease {name: '新生儿黄疸'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "支气管镜检查正常能确定不是肺癌吗",
        "cypher": "MATCH (m:Disease {name:'肺癌'})-[:need_check]->(n:Check {name:'支气管镜检查'}) RETURN m.cure_lasttime"
    },
    {
        "input": "慢性阑尾炎，经住院治疗，现仍不时有隐痛，希望",
        "cypher": "MATCH (d:Disease {name: '慢性阑尾炎'}) RETURN d.cure_way"
    },
    {
        "input": "治疗多动症到哪好",
        "cypher": "MATCH (v1:Disease {name: '多动症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "看子宫内膜炎哪儿较好",
        "cypher": "MATCH (m:Disease {name:'子宫内膜炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "去年7月，在湖北省人民医院检查说：甲状",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE m.name CONTAINS '甲状' RETURN n.name, r, m.name"
    },
    {
        "input": "包茎主要的症状有哪些呢？",
        "cypher": "MATCH (m:Disease {name:'包茎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "甲状腺结节我这确定是腺瘤吗？",
        "cypher": "MATCH (m:Disease {name:'甲状腺结节'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "肺大泡患者吃什么比较好",
        "cypher": "MATCH (v1:Disease {name: '肺大泡'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肝炎属于什么类型肝病",
        "cypher": "MATCH (v1:Disease {name: '肝炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "脑干梗塞，目前全瘫",
        "cypher": "MATCH (m:Disease {name: '脑干梗塞'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "前列腺炎请问是什么疾病？",
        "cypher": "MATCH (n:Disease {name:'前列腺炎'}) RETURN n.name,n.desc"
    },
    {
        "input": "问一下前列腺结石的因素或病因，西安哪里治疗这",
        "cypher": "MATCH (n:Disease {name:'前列腺结石'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "甲状腺结节增长速度快吗？",
        "cypher": "MATCH (m:Disease {name:'甲状腺结节'}) RETURN m.get_way"
    },
    {
        "input": "脑积水的治疗关键有哪些？",
        "cypher": "MATCH (m:Disease {name:'脑积水'}) RETURN m.desc"
    },
    {
        "input": "中医治疗骨髓增生异常综合征",
        "cypher": "MATCH (d:Disease {name: '骨髓增生异常综合征'}) RETURN d.cure_way"
    },
    {
        "input": "脂肪肝后果严重不严重",
        "cypher": "MATCH (m:Disease {name: '脂肪肝'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "有动脉瘤怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '动脉瘤'}) RETURN d.cure_way"
    },
    {
        "input": "先天性心脏病术后复查",
        "cypher": "MATCH (v1:Disease {name: '先天性心脏病'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "胃癌开什么证明或诊断图片可以离职",
        "cypher": "MATCH (d:Disease {name: '胃癌'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "肛裂有什么药治疗更好",
        "cypher": "MATCH (v1:Disease {name: '肛裂'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "前列腺增生会出现尿频？",
        "cypher": "MATCH (m:Disease {name: '前列腺增生'})-[:has_symptom]->(n:Symptom {name: '尿频'}) RETURN m, n"
    },
    {
        "input": "脑炎吃什么有助恢复？",
        "cypher": "MATCH (v1:Disease {name: '脑炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "性早熟的特征有哪些？",
        "cypher": "MATCH (m:Disease {name:'性早熟'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "细菌性阴道炎如何用药才能治好呢",
        "cypher": "MATCH (m:Disease {name:'细菌性阴道炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "治疗毛细血管瘤需要多少钱",
        "cypher": "MATCH (n:Disease {name: '毛细血管瘤'}) RETURN n.cost_money"
    },
    {
        "input": "宝宝斜颈怎么治疗",
        "cypher": "MATCH (d:Disease {name: '斜颈'}) RETURN d.cure_way"
    },
    {
        "input": "能预防支气管炎的方法有哪些",
        "cypher": "MATCH (n:Disease {name: '支气管炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "肾囊肿会引起高血压吗",
        "cypher": "MATCH (m:Disease {name:'肾囊肿'})-[:acompany_with]->(n:Disease {name:'高血压'}) RETURN m,n"
    },
    {
        "input": "得了性功能障碍了生活上要注意什么呢？",
        "cypher": "MATCH (m:Disease {name:'性功能障碍'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "怎么预防妊娠合并宫颈癌",
        "cypher": "MATCH (m:Disease {name:'妊娠合并宫颈癌'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "子宫囊肿有什么症状对怀孕有什么影响",
        "cypher": "MATCH (m:Disease {name:'子宫囊肿'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "脑瘤发生的病因是什么",
        "cypher": "MATCH (m:Disease {name:'脑瘤'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "肝癌手术后应该吃什么药物",
        "cypher": "MATCH (v1:Disease {name: '肝癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "6岁小孩佝偻病吃什么药",
        "cypher": "MATCH (m:Disease {name:'佝偻病'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "小儿肥胖症怎么办才好？",
        "cypher": "MATCH (d:Disease {name: '小儿肥胖症'}) RETURN d.cure_way"
    },
    {
        "input": "想知道前列腺钙化是什么",
        "cypher": "MATCH (m:Disease) WHERE m.name = '前列腺钙化' RETURN m.desc"
    },
    {
        "input": "面部偏侧萎缩有哪些症状",
        "cypher": "MATCH (m:Disease {name:'面部偏侧萎缩'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "孩子睡眠怎么样才会好？",
        "cypher": "MATCH (d:Disease {name: '儿童睡眠障碍'}) RETURN d.cure_way"
    },
    {
        "input": "帕金森病和运动障碍疾病有何有效药物？",
        "cypher": "MATCH (n:Disease {name: '帕金森病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "想知道新生儿黄疸是什么",
        "cypher": "MATCH (m:Disease {name: '新生儿黄疸'}) RETURN m"
    },
    {
        "input": "经常出冷汗为什么",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '出冷汗' RETURN m.name"
    },
    {
        "input": "缺铁性贫血饮食中要注意什么",
        "cypher": "MATCH (v1:Disease {name: '缺铁性贫血'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "出现孩子扁桃体炎症会发生哪些表现",
        "cypher": "MATCH (m:Disease {name: '扁桃体炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "常见妇科病有哪一些",
        "cypher": "MATCH (v:Disease)-[e:belongs_to]->(v2:Department) WHERE v2.name = '妇科' RETURN v.name"
    },
    {
        "input": "头痛该怎么吃药？",
        "cypher": "MATCH (m:Disease {name:'头痛'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "手足口病预防针几岁打比较好？",
        "cypher": "MATCH (n:Disease {name: '手足口病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "矽肺吃什么药好？",
        "cypher": "MATCH (v1:Disease {name: '矽肺'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "看结肠癌晚期的医院有哪些？",
        "cypher": "MATCH (n:Disease {name: '结肠癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "咨询治疗肝血管瘤药方如何处理得当",
        "cypher": "MATCH (d:Disease {name: '肝血管瘤'})-[:common_drug|:recommand_drug]->(dr:Drug) RETURN dr.name"
    },
    {
        "input": "2个月婴儿斜颈是什么情况",
        "cypher": "MATCH (m:Disease {name: '斜颈'})-[:belongs_to]->(n:Department) RETURN m, n"
    },
    {
        "input": "脑干肿瘤治疗去看什么科室比较好？",
        "cypher": "MATCH (v1:Disease {name: '脑干肿瘤'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "急性胃炎有什么注意事项",
        "cypher": "MATCH (m:Disease {name:'急性胃炎'})-[:belongs_to]->(n:Department) RETURN m.prevent,n.name"
    },
    {
        "input": "糖尿病肾病高血压全身肿怎么办",
        "cypher": "MATCH (m:Disease {name:'糖尿病肾病'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "输卵管造影分为几种？",
        "cypher": "MATCH (v:Disease)-[e:need_check]->(v1:Check) WHERE v1.name = '输卵管造影' RETURN COUNT(v1)"
    },
    {
        "input": "疝气是要怎么预防？",
        "cypher": "MATCH (n:Disease {name: '疝气'}) RETURN n.prevent"
    },
    {
        "input": "我是否有心脏神经症",
        "cypher": "MATCH (n:Disease {name: '心脏神经症'}) RETURN n"
    },
    {
        "input": "做爱后腰酸为什么",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '腰酸' RETURN d.name"
    },
    {
        "input": "我的孩子有抽筋请问可是癫痫啊怎么查啊？",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "溃疡性结肠炎要用点什么药",
        "cypher": "MATCH (v1:Disease {name: '溃疡性结肠炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "得了甲状腺癌有生命危险吗？",
        "cypher": "MATCH (m:Disease {name:'甲状腺癌'}) RETURN m.cure_lasttime"
    },
    {
        "input": "视神经炎导致视神经萎缩",
        "cypher": "MATCH (v1:Disease {name: '视神经炎'})-[:acompany_with]->(v2:Disease {name: '视神经萎缩'}) RETURN v1, v2"
    },
    {
        "input": "小细胞肺癌晚期严重怎么办，西安治疗肺癌哪里最",
        "cypher": "MATCH (n:Disease {name: '小细胞肺癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "之前是胃炎和溃疡吃药一个月怎么办？",
        "cypher": "MATCH (n:Disease {name: '胃炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "得了恶性骨肿瘤还能活多长时间",
        "cypher": "MATCH (m:Disease {name: '恶性骨肿瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "平滑肌肉瘤是什么病",
        "cypher": "MATCH (m:Disease {name:'平滑肌肉瘤'}) RETURN m"
    },
    {
        "input": "混合性结缔组织病的起因和治疗预防",
        "cypher": "MATCH (n:Disease {name: '混合性结缔组织病'})-[:acompany_with]->(m:Disease) RETURN m.cause, m.prevent"
    },
    {
        "input": "骨肿瘤怎么预防和处理呢",
        "cypher": "MATCH (m:Disease {name: '骨肿瘤'})-[:belongs_to]->(n:Department) RETURN m.prevent, m.cure_lasttime"
    },
    {
        "input": "嗜铬细胞瘤恶性程度有多高？",
        "cypher": "MATCH (m:Disease {name: '嗜铬细胞瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "急性胃炎输了液还能哺乳吗？",
        "cypher": "MATCH (d:Disease {name: '急性胃炎'}) RETURN d.easy_get"
    },
    {
        "input": "前列腺炎特点是什么",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'}) RETURN n.desc"
    },
    {
        "input": "脑梗死病情加重的因素有哪些",
        "cypher": "MATCH (m:Disease {name: '脑梗死'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "怎么判断是纵欲还是阳痿？",
        "cypher": "MATCH (m:Disease {name:'阳痿'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "乳腺增生会不会遗传？",
        "cypher": "MATCH (n:Disease {name: '乳腺增生'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "蓝鼓膜与胆固醇肉芽肿注意什么饮食？",
        "cypher": "MATCH (n:Disease {name: '蓝鼓膜与胆固醇肉芽肿'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "阴囊炎是慢性还是急性？",
        "cypher": "MATCH (n:Disease {name: '阴囊炎'}) RETURN n.get_way"
    },
    {
        "input": "肺炎怎么处理补充营养",
        "cypher": "MATCH (m:Disease {name: '肺炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "关于包皮龟头炎的一系列问题？",
        "cypher": "MATCH (m:Disease {name:'包皮龟头炎'})-[]->(n) RETURN m,n"
    },
    {
        "input": "请问妇科炎症会影响月经吗",
        "cypher": "MATCH (m:Disease {name:'妇科炎症'})-[:has_symptom]->(n:Symptom) WHERE n.name CONTAINS '月经' RETURN m,n"
    },
    {
        "input": "胃有没有出血怎么检查？",
        "cypher": "MATCH (m:Disease {name:'胃出血'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "治小儿支气管哮喘一般要吃什么药",
        "cypher": "MATCH (v1:Disease {name: '小儿支气管哮喘'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "我的宝宝得了血管瘤严重吗",
        "cypher": "MATCH (m:Disease {name:'血管瘤'}) RETURN m.cure_lasttime AS 治疗周期,m.cured_prob AS 治愈率"
    },
    {
        "input": "什么疾病会引来盆腔积液",
        "cypher": "MATCH (v1:Disease {name: '盆腔积液'})-[:acompany_with]-(v2:Disease) RETURN v2"
    },
    {
        "input": "孩子生病该吃什么饭",
        "cypher": "MATCH (v1:Disease)-[e1:do_eat]->(v2:Food) WHERE v1.name CONTAINS '儿童' RETURN v2.name"
    },
    {
        "input": "胆囊结石这个疾病以后会不会更加的严重那?",
        "cypher": "MATCH (n:Disease {name: '胆囊结石'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "胸腔积液很严重吗",
        "cypher": "MATCH (m:Disease {name:'胸腔积液'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "得了急性糜烂性胃炎反复发作？",
        "cypher": "MATCH (m:Disease {name:'急性糜烂性胃炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "先天性睾丸发育不全发病原因是啥呢？",
        "cypher": "MATCH (n:Disease {name:'先天性睾丸发育不全'})-[]->(m) RETURN m.cause"
    },
    {
        "input": "小孩子长流鼻涕且黏膜破皮是什么鼻炎",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '流鼻涕' AND d.name = '鼻炎' RETURN d.name"
    },
    {
        "input": "淋巴瘤确诊后还需要进行哪些检查？",
        "cypher": "MATCH (m:Disease {name:'淋巴瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "多动症患儿吃什么比较好",
        "cypher": "MATCH (v1:Disease {name: '多动症'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "性功能障碍，早泄需要有吃些什么药",
        "cypher": "MATCH (v1:Disease {name: '性功能障碍'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "23岁月经不调是怎么回事",
        "cypher": "MATCH (m:Disease {name:'月经不调'})<-[:acompany_with]-(n:Disease) RETURN m.name,n.name"
    },
    {
        "input": "是否是系统性红斑狼疮，需要哪些检查",
        "cypher": "MATCH (m:Disease {name:'系统性红斑狼疮'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "做过肾癌的人今后如何调理?",
        "cypher": "MATCH (m:Disease {name: '肾癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "这些里面哪个对肾没有伤害，可以吃",
        "cypher": "MATCH (v1:Disease)-[e1:do_eat]->(v2:Food) WHERE v1.name = '肾病' RETURN v2.name"
    },
    {
        "input": "我儿子这种情况的化脓性脑膜炎会有后遗症吗",
        "cypher": "MATCH (n:Disease {name:'化脓性脑膜炎'})-[:acompany_with]-(m:Disease) RETURN m"
    },
    {
        "input": "怎么区别膀胱肿瘤侵润性和非侵润性",
        "cypher": "MATCH (m:Disease {name:'膀胱肿瘤'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "烫伤吃点什么会缓解",
        "cypher": "MATCH (v1:Disease {name: '烫伤'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "高脂血症的中医救治方法有几种？",
        "cypher": "MATCH (d:Disease {name: '高脂血症'}) RETURN d.cure_way"
    },
    {
        "input": "脑血管病如何来检查",
        "cypher": "MATCH (m:Disease {name: '脑血管病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "生活中该怎么样预防妇科炎症",
        "cypher": "MATCH (v1:Disease {name: '妇科炎症'})-[:belongs_to]->(v2:Department) RETURN v1.prevent"
    },
    {
        "input": "请问什么是毛细血管瘤?",
        "cypher": "MATCH (m:Disease) WHERE m.name = '毛细血管瘤' RETURN m.desc"
    },
    {
        "input": "哪家医院救治共济失调好",
        "cypher": "MATCH (v1:Disease {name: '共济失调'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "霍奇金淋巴瘤能够治愈吗？",
        "cypher": "MATCH (m:Disease {name: '霍奇金淋巴瘤'}) RETURN m.cured_prob"
    }
]