[
    {
        "input": "孩子有蔓状血管瘤要怎么治疗比较好",
        "cypher": "MATCH (d:Disease {name: '蔓状血管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "纵膈肿瘤症状一般什么时候出现？",
        "cypher": "MATCH (m:Disease {name:'纵膈肿瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "胃息肉手术后的饮食与保健",
        "cypher": "MATCH (v1:Disease {name: '胃息肉'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "尿频、尿痛、尿出血什么原因?",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '尿频' OR n.name = '尿痛' OR n.name = '尿出血' RETURN m.name AS disease"
    },
    {
        "input": "治疗混合痔需要多少钱？",
        "cypher": "MATCH (n:Disease {name: '混合痔'}) RETURN n.cost_money"
    },
    {
        "input": "龟头炎有的救治药物有几种？",
        "cypher": "MATCH (n:Disease {name: '龟头炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m"
    },
    {
        "input": "脑梗塞患者要注意些什么?",
        "cypher": "MATCH (m:Disease {name: '脑梗塞'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "是妇科得阴道炎还是宫颈炎怎么判断",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})-[:has_symptom]->(n:Symptom) RETURN m.name,collect(n.name)"
    },
    {
        "input": "毛细血管瘤手术费用是多少？",
        "cypher": "MATCH (m:Disease {name:'毛细血管瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "包皮龟头炎患者需要注意的饮食禁忌？",
        "cypher": "MATCH (n:Disease {name: '包皮龟头炎'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "我母亲大脑萎缩怎么治疗",
        "cypher": "MATCH (d:Disease {name: '大脑萎缩'}) RETURN d.cure_way"
    },
    {
        "input": "请问引起子宫性不孕的原因有哪些",
        "cypher": "MATCH (m:Disease {name:'子宫性不孕'})RETURN m.cause"
    },
    {
        "input": "阴道炎的检查项目有哪些",
        "cypher": "MATCH (v1:Disease {name: '阴道炎'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "女性患有输卵管粘连对身体有什么危害？",
        "cypher": "MATCH (d:Disease {name: '输卵管粘连'}) RETURN d.easy_get"
    },
    {
        "input": "治疗疝气用什么药",
        "cypher": "MATCH (v1:Disease {name: '疝气'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "结核性腹膜炎传染吗?",
        "cypher": "MATCH (m:Disease {name:'结核性腹膜炎'})-[:acompany_with]-(n:Disease) RETURN n.get_way"
    },
    {
        "input": "想了解冠心病应注意些啥",
        "cypher": "MATCH (m:Disease {name:'冠心病'}) RETURN m.prevent"
    },
    {
        "input": "如何鉴别三叉神经痛与偏头疼？",
        "cypher": "MATCH (m:Disease {name:'三叉神经痛'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "孩子长大了癫痫会自然就好了吗",
        "cypher": "MATCH (m:Disease {name:'癫痫'}) RETURN m.cure_lasttime"
    },
    {
        "input": "胆管癌生存几率是多大？",
        "cypher": "MATCH (m:Disease {name: '胆管癌'}) RETURN m.cured_prob"
    },
    {
        "input": "老年人血栓性疾病有哪些表现？",
        "cypher": "MATCH (m:Disease {name:'老年人血栓性疾病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "膀胱炎吃什么药比较好",
        "cypher": "MATCH (m:Disease {name:'膀胱炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "新生儿溶血病换血后多久能好",
        "cypher": "MATCH (d:Disease {name: '新生儿溶血病'}) RETURN d.cure_lasttime"
    },
    {
        "input": "孩子早产住院新农合能报销吗？",
        "cypher": "MATCH (d:Disease {name: '早产'}) RETURN d.easy_get"
    },
    {
        "input": "为什么我会得红斑狼疮？",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'}) RETURN m.cause"
    },
    {
        "input": "想知道我会不会闭经？",
        "cypher": "MATCH (m:Disease {name: '闭经'}) RETURN m.get_prob"
    },
    {
        "input": "恶性淋巴瘤侵犯其他组织会有何症状?",
        "cypher": "MATCH (m1:Disease {name: '恶性淋巴瘤'})-[:acompany_with]->(m2:Disease) RETURN m2"
    },
    {
        "input": "乳腺炎怎样做检查",
        "cypher": "MATCH (m:Disease {name: '乳腺炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "请问做宫颈糜烂需要多少钱？",
        "cypher": "MATCH (n:Disease {name:'宫颈糜烂'}) RETURN n.cost_money"
    },
    {
        "input": "请问大夫：对于这种情况（可能是浅表性胃炎），",
        "cypher": "MATCH (d:Disease {name: '浅表性胃炎'}) RETURN d.cure_way"
    },
    {
        "input": "酒精性心肌病会突发什么并发症",
        "cypher": "MATCH (v1:Disease {name: '酒精性心肌病'})-[:acompany_with]->(v2:Disease) RETURN v2.name"
    },
    {
        "input": "新生儿45天去打预防针说是还有黄疸怎么办？",
        "cypher": "MATCH (m:Disease {name: '黄疸'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "怎么预防蛛网膜炎",
        "cypher": "MATCH (v1:Disease {name: '蛛网膜炎'})-[:belongs_to]->(v2:Department) RETURN v1.prevent"
    },
    {
        "input": "胆结石痛在哪个位置是正确的？",
        "cypher": "MATCH (m:Disease {name: '胆结石'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "川崎病不吃药会缓解吗？",
        "cypher": "MATCH (n:Disease {name: '川崎病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "前列腺囊肿的检查方法是什么?",
        "cypher": "MATCH (n:Disease {name: '前列腺囊肿'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "痔疮手术会引起直肠癌吗",
        "cypher": "MATCH (m:Disease {name: '痔疮'})-[:acompany_with]-(n:Disease {name: '直肠癌'}) RETURN m, n"
    },
    {
        "input": "附睾畸形患者应该注意些什么呢？",
        "cypher": "MATCH (d:Disease {name: '附睾畸形'}) RETURN d.easy_get"
    },
    {
        "input": "左乳内有一个良性肿瘤需要有摘除嘛？",
        "cypher": "MATCH (d:Disease {name: '良性肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "幽门梗阻吃什么食物？",
        "cypher": "MATCH (v1:Disease {name: '幽门梗阻'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "先天性青光眼会失明吗",
        "cypher": "MATCH (d:Disease {name: '先天性青光眼'}) RETURN d.cure_way"
    },
    {
        "input": "脑炎后遗症还能治好吗",
        "cypher": "MATCH (m:Disease {name:'脑炎'})-[:acompany_with]->(n:Disease) RETURN n.cure_lasttime"
    },
    {
        "input": "先兆流产后需要注意哪些",
        "cypher": "MATCH (d:Disease {name: '先兆流产'}) RETURN d.easy_get"
    },
    {
        "input": "咨询蔓状血管瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'蔓状血管瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "心肌炎的原因有什么",
        "cypher": "MATCH (n:Disease {name: '心肌炎'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "做爱时老公不小心把阴茎插到了肛门",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '肛门出血' RETURN d.name, d.desc"
    },
    {
        "input": "发热起病急，病程较短，是流行性感冒吗？",
        "cypher": "MATCH (m:Disease {name:'流行性感冒'}) RETURN m.get_way"
    },
    {
        "input": "癫痫病症状",
        "cypher": "MATCH (m:Disease {name:'癫痫'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "怎样治疗慢性扁桃体",
        "cypher": "MATCH (d:Disease {name: '慢性扁桃体炎'}) RETURN d.cure_way"
    },
    {
        "input": "接种疫苗可以预防小儿麻痹症吗？",
        "cypher": "MATCH (n:Disease {name: '小儿麻痹症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "乳头内陷手术前需要做哪些准备？",
        "cypher": "MATCH (v1:Disease {name: '乳头内陷'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "胸腺囊肿的症状有哪些",
        "cypher": "MATCH (m:Disease {name:'胸腺囊肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肾癌去哪治效果好",
        "cypher": "MATCH (v1:Disease {name: '肾癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "小儿病毒性肺炎总是反复怎么治疗",
        "cypher": "MATCH (d:Disease {name: '小儿病毒性肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "远视度数太高怎么办",
        "cypher": "MATCH (d:Disease {name: '远视'}) RETURN d.cure_way"
    },
    {
        "input": "混合痔需要多少费用",
        "cypher": "MATCH (m:Disease {name:'混合痔'}) RETURN m.cost_money"
    },
    {
        "input": "心源性休克患者的饮食禁忌有哪些？",
        "cypher": "MATCH (m:Disease {name:'心源性休克'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "黄体功能不全能完全治好吗？",
        "cypher": "MATCH (d:Disease {name: '黄体功能不全'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺炎这个病的症状表现会有哪些？",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "颈动脉狭窄会有哪些症状",
        "cypher": "MATCH (m:Disease {name: '颈动脉狭窄'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肛窦炎这个还会病发吗？",
        "cypher": "MATCH (m:Disease {name:'肛窦炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "如何正确预防黑色素瘤",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "卵巢囊肿症状有哪些呢？",
        "cypher": "MATCH (m:Disease {name:'卵巢囊肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肝血管瘤吃药能治疗好吗",
        "cypher": "MATCH (m:Disease {name:'肝血管瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m.cured_prob"
    },
    {
        "input": "急性播散性脑脊髓炎饮食禁忌有哪些？",
        "cypher": "MATCH (n:Disease {name: '急性播散性脑脊髓炎'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "功血服用炔诺酮片应该如何减药？",
        "cypher": "MATCH (n:Disease {name: '功血'})-[:common_drug|:recommand_drug]->(m:Drug {name: '炔诺酮片'}) RETURN m.cure_lasttime"
    },
    {
        "input": "什么原因会引起肺栓塞？",
        "cypher": "MATCH (m:Disease {name:'肺栓塞'}) RETURN m.causee"
    },
    {
        "input": "肝癌常见的死亡原因会是什么",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "治疗前列腺炎左氧氟沙星片多久呢？",
        "cypher": "MATCH (n:Disease {name: '前列腺炎'})-[:common_drug|:recommand_drug]->(m:Drug {name: '左氧氟沙星片'}) RETURN m.cure_lasttime"
    },
    {
        "input": "检查是否肠癌用什么仪器的方法吗",
        "cypher": "MATCH (m:Disease {name:'肠癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "哪里治卵巢囊肿的病？",
        "cypher": "MATCH (n1:Disease {name: '卵巢囊肿'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "新生儿肺炎后期怎么护理？",
        "cypher": "MATCH (d:Disease {name: '新生儿肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "宝宝肚子上有一片血管瘤对宝宝的成长有影响",
        "cypher": "MATCH (m:Disease {name:'血管瘤'})-[:belongs_to]->(n:Department) RETURN m,n"
    },
    {
        "input": "治疗附睾炎中成药的介绍吗？",
        "cypher": "MATCH (n1:Disease {name: '附睾炎'})-[:common_drug|:recommand_drug]->(n2:Drug) RETURN n2.name"
    },
    {
        "input": "怀疑心源性休克，怎么确诊",
        "cypher": "MATCH (m:Disease {name: '心源性休克'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "患有前列腺病治疗方法主要有哪些？",
        "cypher": "MATCH (d:Disease {name: '前列腺病'}) RETURN d.cure_way"
    },
    {
        "input": "怎么治恰当小儿咳嗽的症状好的快",
        "cypher": "MATCH (m:Disease {name:'小儿咳嗽'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "想知道是不是地中海贫血，没有家族遗传史",
        "cypher": "MATCH (d:Disease {name: '地中海贫血'}) RETURN d.easy_get"
    },
    {
        "input": "得了附睾炎影响怀孕吗？",
        "cypher": "MATCH (d:Disease {name: '附睾炎'}) RETURN d.easy_get"
    },
    {
        "input": "不安腿综合征患者有哪些饮食禁忌",
        "cypher": "MATCH (v1:Disease {name: '不安腿综合征'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "菌血症还能活多久呢？",
        "cypher": "MATCH (m:Disease {name:'菌血症'}) RETURN m.cure_lasttime"
    },
    {
        "input": "如何治疗慢性子宫内膜炎?",
        "cypher": "MATCH (d:Disease {name: '慢性子宫内膜炎'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍的病因有哪些的呢？",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'}) RETURN n.cause"
    },
    {
        "input": "膀胱癌的存活率有多大？",
        "cypher": "MATCH (m:Disease {name:'膀胱癌'}) RETURN m.cured_prob"
    },
    {
        "input": "淋巴瘤传染吗",
        "cypher": "MATCH (v1:Disease {name: '淋巴瘤'})-[]->(v2) RETURN v2.get_way"
    },
    {
        "input": "我好讨厌我自己啊！如何不再胡思乱想",
        "cypher": "MATCH (d:Disease {name: '抑郁症'}) RETURN d.cure_way"
    },
    {
        "input": "排大便前,恶心,呕吐咋回事？",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '恶心' OR n.name = '呕吐' RETURN m.name"
    },
    {
        "input": "胆囊在什么位置",
        "cypher": "MATCH (m:Disease {name: '胆囊炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "轻度脂肪肝的饮食有什么应该注意的",
        "cypher": "MATCH (v1:Disease {name: '轻度脂肪肝'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "有没有医生为子宫内膜癌早期患者制订食谱",
        "cypher": "MATCH (d:Disease {name: '子宫内膜癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "痛风引起什么并发症",
        "cypher": "MATCH (m:Disease {name:'痛风'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "什么是神经纤维瘤",
        "cypher": "MATCH (m:Disease {name: '神经纤维瘤'}) RETURN m"
    },
    {
        "input": "毛细血管瘤有哪些症状",
        "cypher": "MATCH (m:Disease {name:'毛细血管瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "睾丸囊肿看什么科？",
        "cypher": "MATCH (n1:Disease)-[r1:belongs_to]->(n2:Department) WHERE n1.name = '睾丸囊肿' RETURN n2.name"
    },
    {
        "input": "胰头癌术后每晚高热不退怎么办？",
        "cypher": "MATCH (d:Disease {name: '胰头癌'}) RETURN d.cure_way"
    },
    {
        "input": "妊娠期糖尿病什么意思",
        "cypher": "MATCH (m:Disease {name:'妊娠期糖尿病'}) RETURN m.name, m.desc"
    },
    {
        "input": "低血压需要治疗吗？",
        "cypher": "MATCH (d:Disease {name: '低血压'}) RETURN d.cure_way"
    },
    {
        "input": "滴虫性阴道炎的症状",
        "cypher": "MATCH (m:Disease {name:'滴虫性阴道炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "直肠癌是不是一定要做肠镜?",
        "cypher": "MATCH (n:Disease {name: '直肠癌'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "脑出血后遗症的药物治疗",
        "cypher": "MATCH (v1:Disease {name: '脑出血'})-[:acompany_with]->(v2:Disease)-[:common_drug|:recommand_drug]->(v3:Drug) RETURN v3.name"
    },
    {
        "input": "新生儿为啥会有疝气？",
        "cypher": "MATCH (m:Disease {name: '疝气'}) RETURN m.cause"
    },
    {
        "input": "子宫肌瘤服用哪些药好",
        "cypher": "MATCH (v1:Disease {name: '子宫肌瘤'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "舌癌的症状有什么",
        "cypher": "MATCH (m:Disease {name: '舌癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "直肠癌患者长期坚持跑步会好么",
        "cypher": "MATCH (d:Disease {name: '直肠癌'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "输卵管有几个？",
        "cypher": "MATCH (m:Disease {name:'输卵管炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "原位癌会转移吗？",
        "cypher": "MATCH (m:Disease {name:'原位癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "十八岁有得肺癌的可能吗",
        "cypher": "MATCH (d:Disease {name: '肺癌'}) RETURN d.easy_get"
    },
    {
        "input": "功能性胃肠病怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '功能性胃肠病'}) RETURN d.cure_way"
    },
    {
        "input": "胰腺囊肿的症状是怎样的？",
        "cypher": "MATCH (m:Disease {name:'胰腺囊肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小儿支气管哮喘的要在注意哪些问题？",
        "cypher": "MATCH (m:Disease {name:'小儿支气管哮喘'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "为什么会得胆囊炎？",
        "cypher": "MATCH (m:Disease {name: '胆囊炎'}) RETURN m.cause"
    },
    {
        "input": "女性尿道癌患者的饮食禁忌？",
        "cypher": "MATCH (m:Disease {name:'女性尿道癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "勃起功能障碍去哪家医院看好",
        "cypher": "MATCH (d:Disease {name: '勃起功能障碍'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "宫颈肥大的病因有什么",
        "cypher": "MATCH (v1:Disease {name: '宫颈肥大'})-[:acompany_with]-(v2:Disease) RETURN v2.cause"
    },
    {
        "input": "中晚期的甲状腺癌已转移到淋巴治好率多大？",
        "cypher": "MATCH (d:Disease {name: '甲状腺癌'}) RETURN d.cure_way"
    },
    {
        "input": "有什么方法能诊断得了阴道炎",
        "cypher": "MATCH (m:Disease)-[r1:need_check]->(n:Check) WHERE m.name='阴道炎' RETURN m.name,n.name"
    },
    {
        "input": "自发性气胸可以完全缓解吗?",
        "cypher": "MATCH (m:Disease {name:'自发性气胸'}) RETURN m.cured_prob"
    },
    {
        "input": "请问这个情况会是黑色素瘤吗？",
        "cypher": "MATCH (m1:Disease {name: '黑色素瘤'})-[:has_symptom]->(m2:Symptom) RETURN m2.name"
    },
    {
        "input": "最好的食管癌医院哪家治疗的最好呢？",
        "cypher": "MATCH (n:Disease {name: '食管癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "孩子干呕如何解决",
        "cypher": "MATCH (d:Disease {name: '干呕'}) RETURN d.cure_way"
    },
    {
        "input": "阴囊湿疹是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'阴囊湿疹'}) RETURN m"
    },
    {
        "input": "治肿瘤便宜的医院是哪家？",
        "cypher": "MATCH (n:Disease {name: '肿瘤'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "想咨询前列腺囊肿应该注意些什么？",
        "cypher": "MATCH (n:Disease {name: '前列腺囊肿'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "月经不调为什么有炎症？",
        "cypher": "MATCH (m:Disease {name:'月经不调'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "神经炎做哪种检查比较准确",
        "cypher": "MATCH (v1:Disease {name: '神经炎'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "前列腺增生的原因？",
        "cypher": "MATCH (n:Disease {name: '前列腺增生'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "肝硬化患者饮食上要注意什么",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "甲状腺癌复发的症状是什么",
        "cypher": "MATCH (m:Disease {name:'甲状腺癌'})-[:acompany_with]->(n:Disease)-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "癌症会不会遗传呢",
        "cypher": "MATCH (n:Disease {name: '癌症'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "脑出血患者用什么药？",
        "cypher": "MATCH (v1:Disease {name: '脑出血'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "得了淋巴癌需要忌口吗?",
        "cypher": "MATCH (n:Disease {name: '淋巴癌'})-[:no_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "扁桃体有点红应当服食什么药",
        "cypher": "MATCH (n:Disease {name: '扁桃体炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "如何确诊结肠炎",
        "cypher": "MATCH (m:Disease {name: '结肠炎'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "新生儿肺炎能打针吗",
        "cypher": "MATCH (m:Disease {name:'新生儿肺炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "高血压对性生活有没有影响啊",
        "cypher": "MATCH (m:Disease {name: '高血压'}) RETURN m.desc"
    },
    {
        "input": "十二指肠憩室能治愈吗",
        "cypher": "MATCH (d:Disease {name: '十二指肠憩室'}) RETURN d.cure_way"
    },
    {
        "input": "早泄手术费用？",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:belongs_to]->(v2:Department) RETURN v2.name AS name"
    },
    {
        "input": "关于阳痿是什么病",
        "cypher": "MATCH (m:Disease) WHERE m.name = '阳痿' RETURN m"
    },
    {
        "input": "心脏病的饮食食谱大全如何",
        "cypher": "MATCH (v1:Disease {name: '心脏病'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "此种属子宫下垂吗？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'子宫下垂'}) RETURN m,r1,n"
    },
    {
        "input": "乳腺增生看什么科？",
        "cypher": "MATCH (v1:Disease {name: '乳腺增生'})-[]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "胆管结石经常疼痛怎么为？",
        "cypher": "MATCH (m:Disease {name: '胆管结石'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "转移性肝癌晚期如何机智处理合适",
        "cypher": "MATCH (d:Disease {name: '转移性肝癌'}) RETURN d.cure_way"
    },
    {
        "input": "今天妈妈做了内镜手术切除胃息肉，需要住院",
        "cypher": "MATCH (d:Disease {name: '胃息肉'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "肾动脉狭窄是否可以做肾动脉手术",
        "cypher": "MATCH (d:Disease {name: '肾动脉狭窄'}) RETURN d.cure_way"
    },
    {
        "input": "宫颈糜烂和滴虫性阴道炎怎办用什么药物治疗？",
        "cypher": "MATCH (m:Disease {name:'宫颈糜烂'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN m,n"
    },
    {
        "input": "包皮水肿有哪些主要的诱因？",
        "cypher": "MATCH (n:Disease {name:'包皮水肿'})-[]->(m) RETURN m.cause"
    },
    {
        "input": "外阴瘙痒用什么药治疗比较好",
        "cypher": "MATCH (v1:Disease {name: '外阴瘙痒'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "先天性耳前瘘管吃什么药？",
        "cypher": "MATCH (n:Disease {name: '先天性耳前瘘管'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "如何判断妇科病",
        "cypher": "MATCH (m:Disease {name:'妇科病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "系统性红斑狼疮",
        "cypher": "MATCH (d:Disease {name: '系统性红斑狼疮'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "腹泻无变化现服用蒙脱石散可以吗",
        "cypher": "MATCH (v1:Disease {name: '腹泻'})-[:common_drug|:recommand_drug]->(v2:Drug {name: '蒙脱石散'}) RETURN v2"
    },
    {
        "input": "食管癌治疗会引发并发症吗",
        "cypher": "MATCH (v1:Disease {name: '食管癌'})-[:acompany_with]-(v2:Disease) RETURN v2"
    },
    {
        "input": "月经不调中药怎样熬服，多久服用一次?",
        "cypher": "MATCH (n:Disease {name: '月经不调'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肛裂生活中需要怎么的饮食比较好？",
        "cypher": "MATCH (v1:Disease {name: '肛裂'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "内痔一般需要多少费用",
        "cypher": "MATCH (m:Disease {name:'内痔'})-[:belongs_to]->(n:Department) RETURN m.cost_money AS 内痔一般需要多少费用"
    },
    {
        "input": "胆囊炎能不能吃鸡肉？",
        "cypher": "MATCH (m:Disease {name:'胆囊炎'})-[:do_eat]->(n:Food) WHERE n.name = '鸡肉' RETURN n.name AS name"
    },
    {
        "input": "一般什么人染色体异常？",
        "cypher": "MATCH (d:Disease {name: '染色体异常'}) RETURN d.easy_get"
    },
    {
        "input": "我这两天有黑便，有贫血症状.伴有少量的恶",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '黑便' OR s.name = '贫血' OR s.name = '恶心' RETURN d"
    },
    {
        "input": "先天性巨结肠上哪个医院手术好",
        "cypher": "MATCH (d:Disease {name: '先天性巨结肠'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "孩子病毒性肠炎发烧，呕吐，腹泻怎么处理？",
        "cypher": "MATCH (d:Disease {name: '病毒性肠炎'}) RETURN d.cure_way"
    },
    {
        "input": "怎么预防脑膜瘤",
        "cypher": "MATCH (d:Disease {name: '脑膜瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "我弟弟得了癫痫，药物治疗根本不起效果怎么办？",
        "cypher": "MATCH (d:Disease {name: '癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "胸主动脉夹层动脉瘤的症状是什么",
        "cypher": "MATCH (m:Disease {name:'胸主动脉夹层动脉瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "导致急性宫颈炎的因素有什么？",
        "cypher": "MATCH (m:Disease {name:'急性宫颈炎'}) RETURN m.cause"
    },
    {
        "input": "妇科检查大约多少费用？",
        "cypher": "MATCH (v:Disease)-[e:need_check]->(v1:Check) WHERE v1.name = '妇科检查' RETURN v1.cost_money"
    },
    {
        "input": "脑瘤潜伏期要多久?",
        "cypher": "MATCH (m:Disease {name:'脑瘤'}) RETURN m.cure_lasttime"
    },
    {
        "input": "阴茎硬结症请问有什么危害？",
        "cypher": "MATCH (m:Disease {name:'阴茎硬结症'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.desc"
    },
    {
        "input": "前列腺钙化要做哪些检查",
        "cypher": "MATCH (v1:Disease {name: '前列腺钙化'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "宫颈癌是由什么原因所引起的呢",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'}) RETURN m.cause"
    },
    {
        "input": "心力衰竭检查怎么做？",
        "cypher": "MATCH (m:Disease {name:'心力衰竭'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "不开刀能治好胆汁性肝硬化吗？",
        "cypher": "MATCH (d:Disease {name: '胆汁性肝硬化'}) RETURN d.cure_way"
    },
    {
        "input": "肝癌晚期也什么有关?",
        "cypher": "MATCH (m:Disease {name: '肝癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "胃癌患者服用哪些药效果明显",
        "cypher": "MATCH (v1:Disease {name: '胃癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "每天早上起床后胸痛，其他时间无异常",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '胸痛' RETURN d.name"
    },
    {
        "input": "晚上睡觉老爱遗精，这是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'遗精'})<-[:acompany_with]-(n:Disease) RETURN m.name, n.name"
    },
    {
        "input": "肿瘤患者有高血压，服用什么药疗效好？",
        "cypher": "MATCH (n:Disease {name: '肿瘤'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "外痔这病到哪儿治疗才好",
        "cypher": "MATCH (v1:Disease {name: '外痔'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肝硬化并发症有什么",
        "cypher": "MATCH (v1:Disease {name: '肝硬化'})-[:acompany_with]->(v2:Disease) RETURN v2"
    },
    {
        "input": "垂体瘤是什么原因造成的？",
        "cypher": "MATCH (m:Disease {name: '垂体瘤'}) RETURN m.cause"
    },
    {
        "input": "得病了是不是龟头炎？",
        "cypher": "MATCH (m:Disease {name: '龟头炎'}) RETURN m"
    },
    {
        "input": "喉癌的症状和治疗有什么",
        "cypher": "MATCH (m:Disease {name: '喉癌'})-[:has_symptom]->(n:Symptom) RETURN m.name, n.name"
    },
    {
        "input": "多囊卵巢综合征该会是如何诊断？",
        "cypher": "MATCH (m:Disease {name:'多囊卵巢综合征'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "小孩扁桃体炎吃哪些药",
        "cypher": "MATCH (v1:Disease {name: '扁桃体炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "宫颈糜烂检查",
        "cypher": "MATCH (v1:Disease {name: '宫颈糜烂'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "怀孕早孕反应是正常吗",
        "cypher": "MATCH (n:Disease {name:'早孕反应'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "前列腺严重吗需要及时医治吗",
        "cypher": "MATCH (m:Disease {name: '前列腺炎'}) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率"
    },
    {
        "input": "四岁得慢性支气管炎怎么治疗",
        "cypher": "MATCH (d:Disease {name: '慢性支气管炎'}) RETURN d.cure_way"
    },
    {
        "input": "新生儿生理性黄疸怎么办",
        "cypher": "MATCH (d:Disease {name: '新生儿生理性黄疸'}) RETURN d.cure_way"
    },
    {
        "input": "做淋巴癌手术要多少钱？",
        "cypher": "MATCH (n:Disease {name: '淋巴癌'})-[:belongs_to]->(m:Department) RETURN m.name AS name"
    },
    {
        "input": "疝气要注意什么怎么治疗？",
        "cypher": "MATCH (m:Disease {name:'疝气'})-[:acompany_with]->(n:Disease) RETURN m.get_way,n.name"
    },
    {
        "input": "眩晕症有哪些治疗和预防的方法",
        "cypher": "MATCH (d:Disease {name: '眩晕症'}) RETURN d.cure_way"
    },
    {
        "input": "有胆结石子宫肌瘤肚子胀怎么办？",
        "cypher": "MATCH (m:Disease {name:'胆结石'})-[:belongs_to]->(n:Department) RETURN m.cureWay"
    },
    {
        "input": "血管瘤的并发症",
        "cypher": "MATCH (m:Disease {name: '血管瘤'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "耻骨有阴影是不是胃癌转移了呢",
        "cypher": "MATCH (m:Disease {name: '胃癌'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "精索静脉曲张应该吃什么药物会好一点",
        "cypher": "MATCH (v1:Disease {name: '精索静脉曲张'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "为什么转氨酶会增高 ",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'转氨酶增高'}) RETURN m.name"
    },
    {
        "input": "怎么确定高血压？",
        "cypher": "MATCH (m:Disease {name:'高血压'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "我女儿佝偻病严重吗？",
        "cypher": "MATCH (m:Disease {name: '佝偻病'}) RETURN m.cure_lasttime AS 治疗周期, m.cured_prob AS 治愈率"
    },
    {
        "input": "中度脂肪肝用哪些药物好？",
        "cypher": "MATCH (v1:Disease {name: '中度脂肪肝'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "幼儿急疹什么样子？",
        "cypher": "MATCH (m:Disease {name:'幼儿急疹'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我早博己有2年了，经过治疗还没有效果怎么办？",
        "cypher": "MATCH (d:Disease {name: '早泄'}) RETURN d.cure_way"
    },
    {
        "input": "子宫内膜癌患者可以多吃什么食物",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "乳腺增生怎么回事呢？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'}) RETURN m.get_way"
    },
    {
        "input": "卵巢早衰的具体指标是什么？",
        "cypher": "MATCH (n:Disease)-[r1:need_check]->(m:Check) WHERE n.name='卵巢早衰' RETURN m.name"
    },
    {
        "input": "内分泌失调有怀孕可能吗",
        "cypher": "MATCH (d:Disease {name: '内分泌失调'}) RETURN d.easy_get"
    },
    {
        "input": "多发性硬化可存活多长时间",
        "cypher": "MATCH (n:Disease {name: '多发性硬化'}) RETURN n.cure_lasttime"
    },
    {
        "input": "子宫内膜异位症有什么症状",
        "cypher": "MATCH (m:Disease {name:'子宫内膜异位症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "请问结肠癌患者康复期有什么是需要注意的？",
        "cypher": "MATCH (d:Disease {name: '结肠癌'}) RETURN d.cure_way"
    },
    {
        "input": "如何防止乳腺癌的出现呢",
        "cypher": "MATCH (m:Disease {name:'乳腺癌'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "我是肾病吗?看中医还是看西医？",
        "cypher": "MATCH (n:Disease {name: '肾病'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "急性胃炎对身体的危害大吗",
        "cypher": "MATCH (m:Disease {name:'急性胃炎'}) RETURN m.desc"
    },
    {
        "input": "请问咳嗽不好要换药吗？",
        "cypher": "MATCH (n:Disease {name: '咳嗽'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "肋软骨炎应该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '肋软骨炎'}) RETURN d.cure_way"
    },
    {
        "input": "子宫脱垂手术多少费用",
        "cypher": "MATCH (v1:Disease {name: '子宫脱垂'})-[:belongs_to]->(v2:Department) RETURN v1.cost_money"
    },
    {
        "input": "脑梗塞什么原因引起的呢?",
        "cypher": "MATCH (m:Disease {name:'脑梗塞'}) RETURN m.cause"
    },
    {
        "input": "患有子宫内膜炎吃什么",
        "cypher": "MATCH (v1:Disease {name: '子宫内膜炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "得了白带异常对患者有什么危害",
        "cypher": "MATCH (d:Disease {name: '白带异常'}) RETURN d.easy_get"
    },
    {
        "input": "有黄疸的宝宝该不该去打防疫针",
        "cypher": "MATCH (n:Disease {name: '黄疸'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "人工流产后的症状是什么？",
        "cypher": "MATCH (v1:Disease {name: '人工流产'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "子宫内膜异位症注意事项有哪些？",
        "cypher": "MATCH (m:Disease {name:'子宫内膜异位症'})RETURN m.prevent"
    },
    {
        "input": "孩子出现扁桃体炎哭闹有哪些饮食禁忌",
        "cypher": "MATCH (m:Disease {name:'扁桃体炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "前列腺了囊肿怎么回事?",
        "cypher": "MATCH (m:Disease {name:'前列腺囊肿'}) RETURN m"
    },
    {
        "input": "如何检查自己是弱精?",
        "cypher": "MATCH (m:Disease {name: '弱精'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "急性心肌梗死出现室性期前收缩首选要做什么？",
        "cypher": "MATCH (d:Disease {name: '急性心肌梗死'}) RETURN d.cure_way"
    },
    {
        "input": "宫颈癌怎么预防?",
        "cypher": "MATCH (m:Disease {name:'宫颈癌'})-[:belongs_to]->(n:Department) RETURN m.prevent"
    },
    {
        "input": "咳嗽性哮喘去北京哪家医院比较好",
        "cypher": "MATCH (v1:Disease {name: '咳嗽性哮喘'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "淋巴癌的分类通常会有几种？",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'})-[:acompany_with]->(n:Disease) RETURN n"
    }
]