[
    {
        "input": "孩子贫血会有什么后果",
        "cypher": "MATCH (m:Disease {name:'贫血'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "为何乳腺癌患者不能热敷",
        "cypher": "MATCH (m:Disease {name: '乳腺癌'})-[:no_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "上海治疗甲状腺癌比较好的医院有哪些",
        "cypher": "MATCH (v1:Disease {name: '甲状腺癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肝癌这样的疾病还有什么样子的区分吗?",
        "cypher": "MATCH (m1:Disease {name: '肝癌'})-[:acompany_with]-(m2:Disease) RETURN m2"
    },
    {
        "input": "骨旁骨肉瘤要注意些什么？",
        "cypher": "MATCH (m:Disease {name:'骨旁骨肉瘤'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "得了龟头炎会传染吗",
        "cypher": "MATCH (m:Disease {name:'龟头炎'}) RETURN m.get_way"
    },
    {
        "input": "中国每年肺癌的增长率多少",
        "cypher": "MATCH (v:Disease {name: '肺癌'}) RETURN v.get_prob"
    },
    {
        "input": "看妇科炎症要不要做什么准备呢？",
        "cypher": "MATCH (n:Disease {name: '妇科炎症'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "分娩疼痛很难坚持时怎么办？",
        "cypher": "MATCH (d:Disease {name: '难产'}) RETURN d.cure_way"
    },
    {
        "input": "阳痿应该如何调理好",
        "cypher": "MATCH (d:Disease {name: '阳痿'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "肠系膜上动脉血栓形成治疗费用大概是多少？",
        "cypher": "MATCH (n:Disease {name: '肠系膜上动脉血栓形成'}) RETURN n.cost_money"
    },
    {
        "input": "想问下尿频怎么缓解",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '尿频' RETURN d.name, d.prevent"
    },
    {
        "input": "小肠肿瘤怎么回事",
        "cypher": "MATCH (m:Disease {name:'小肠肿瘤'}) RETURN m"
    },
    {
        "input": "喉癌患者有什么不能够吃的吗？",
        "cypher": "MATCH (m:Disease {name:'喉癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "肾盂肿瘤要做哪些检查项目？",
        "cypher": "MATCH (m:Disease {name:'肾盂肿瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "结核性阴道炎应该怎么治疗",
        "cypher": "MATCH (d:Disease {name: '结核性阴道炎'}) RETURN d.cure_way"
    },
    {
        "input": "肠瘘做哪些化验检查？",
        "cypher": "MATCH (m:Disease {name:'肠瘘'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "肾病患者忌食什么",
        "cypher": "MATCH (v1:Disease {name: '肾病'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "胆石症怎么治稳妥疗恰当好？",
        "cypher": "MATCH (d:Disease {name: '胆石症'}) RETURN d.cure_way"
    },
    {
        "input": "肛裂手术后25天了为什么便秘",
        "cypher": "MATCH (d:Disease {name: '肛裂'})-[:has_symptom]->(s:Symptom {name: '便秘'}) RETURN d, s"
    },
    {
        "input": "卵巢囊肿又出现",
        "cypher": "MATCH (m:Disease {name: '卵巢囊肿'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "宝宝腹泻母乳妈妈忌口什么呢？",
        "cypher": "MATCH (v1:Disease {name: '腹泻'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "怎样注意子宫息肉的饮食",
        "cypher": "MATCH (v1:Disease {name: '子宫息肉'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "做了睾丸鞘膜积液手术俩月多了又复发该咋办",
        "cypher": "MATCH (d:Disease {name:'睾丸鞘膜积液'})-[:acompany_with]->(r:Disease) RETURN r.name"
    },
    {
        "input": "酒精性肝病复发了怎么办",
        "cypher": "MATCH (d:Disease {name: '酒精性肝病'}) RETURN d.cure_way"
    },
    {
        "input": "关于月经量少是什么引起，会影响怀孕吗?",
        "cypher": "MATCH (m:Disease {name:'月经量少'})RETURN m.cause"
    },
    {
        "input": "乳腺增生如何食疗？",
        "cypher": "MATCH (m:Disease {name:'乳腺增生'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "一年前因前列腺癌手术摘除",
        "cypher": "MATCH (d:Disease {name: '前列腺癌'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "8个月孩子得了肠炎吃什么好得快？",
        "cypher": "MATCH (m:Disease {name:'肠炎'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "患有结节性甲状腺肿该求治疗？",
        "cypher": "MATCH (d:Disease {name: '结节性甲状腺肿'}) RETURN d.cure_way"
    },
    {
        "input": "有一个睾丸能生孩子吗？",
        "cypher": "MATCH (d:Disease {name: '睾丸炎'}) RETURN d.easy_get"
    },
    {
        "input": "医生，我这个会是胰腺癌吗？",
        "cypher": "MATCH (m:Disease {name:'胰腺癌'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "糖尿病烫伤怎么办啊？",
        "cypher": "MATCH (m:Disease {name:'糖尿病'})-[:belongs_to]->(n:Department) RETURN m.cureWay"
    },
    {
        "input": "蛛网膜囊肿这个病症状会有哪些具体表现多吃水果",
        "cypher": "MATCH (m:Disease {name: '蛛网膜囊肿'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "喉癌专业医院哪比较好呢？",
        "cypher": "MATCH (v1:Disease {name: '喉癌'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肺栓塞很严重吗？",
        "cypher": "MATCH (n:Disease {name: '肺栓塞'}) RETURN n.cure_lasttime"
    },
    {
        "input": "请问肝炎的原因是什么啊？",
        "cypher": "MATCH (n:Disease {name: '肝炎'}) RETURN n.cause"
    },
    {
        "input": "胆囊癌肝昏迷症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'胆囊癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "怎样判断腱鞘囊肿",
        "cypher": "MATCH (m:Disease {name: '腱鞘囊肿'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "宫颈糜烂手术后症状?",
        "cypher": "MATCH (v1:Disease {name: '宫颈糜烂'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "骨癌治疗医药费需要花费多少钱？",
        "cypher": "MATCH (n:Disease {name: '骨癌'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "精子畸形要做什么检查？",
        "cypher": "MATCH (m:Disease {name:'精子畸形'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "樱桃状血管瘤是由什么因素或病因引起的？",
        "cypher": "MATCH (n:Disease {name: '樱桃状血管瘤'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "风湿热是由什么引发的会怎样呢？",
        "cypher": "MATCH (m:Disease {name:'风湿热'}) RETURN m.cause"
    },
    {
        "input": "外阴黑色素瘤吃什么药好?",
        "cypher": "MATCH (m:Disease {name:'外阴黑色素瘤'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "想了解引起的黄褐斑能去掉吗？",
        "cypher": "MATCH (d:Disease {name: '黄褐斑'}) RETURN d.cure_way"
    },
    {
        "input": "过敏性紫癜肾炎有什么好的治疗方法？",
        "cypher": "MATCH (d:Disease {name: '过敏性紫癜肾炎'}) RETURN d.cure_way"
    },
    {
        "input": "输精管堵塞检查费用",
        "cypher": "MATCH (n:Disease {name: '输精管堵塞'})-[:need_check]->(m:Check) RETURN m.name AS name, m.cost_money AS cost_money"
    },
    {
        "input": "肝癌细胞会转移到哪些脏器",
        "cypher": "MATCH (v1:Disease {name: '肝癌'})-[:acompany_with]->(v2:Disease) RETURN v2.name"
    },
    {
        "input": "肾病综合征的危害有哪些",
        "cypher": "MATCH (m:Disease {name: '肾病综合征'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "5岁孩子近视眼怎么办？",
        "cypher": "MATCH (d:Disease {name: '近视眼'}) RETURN d.cure_way"
    },
    {
        "input": "胃下垂请问有啥症状呢？",
        "cypher": "MATCH (m:Disease {name:'胃下垂'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "孩子7个月便秘打开塞露有什么负作用啊？",
        "cypher": "MATCH (m:Disease {name:'便秘'})<-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "我宫颈糜烂刚贴了蛋白下个月烧这段时间注意",
        "cypher": "MATCH (d:Disease {name: '宫颈糜烂'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "该怎么治睾丸损伤好",
        "cypher": "MATCH (m:Disease {name:'睾丸损伤'}) RETURN m.cure_way"
    },
    {
        "input": "月经不调半个月来一次怎么回事？",
        "cypher": "MATCH (m:Disease {name:'月经不调'}) RETURN m.desc"
    },
    {
        "input": "武汉哪有治疗重症肌无力的医院？",
        "cypher": "MATCH (v1:Disease {name: '重症肌无力'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "和肺结核患者同住，我可能受到传染么？",
        "cypher": "MATCH (v1:Disease {name: '肺结核'})-[:acompany_with]->(v2:Disease) RETURN v2.get_way"
    },
    {
        "input": "哪些疾病会引起痔疮呢",
        "cypher": "MATCH (m:Disease {name: '痔疮'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "皮脂腺囊肿术后能抽烟吗",
        "cypher": "MATCH (d:Disease {name: '皮脂腺囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "小儿咳嗽反反复复气喘吁吁的下一步怎么做？",
        "cypher": "MATCH (d:Disease {name: '小儿咳嗽'}) RETURN d.cure_way"
    },
    {
        "input": "肺癌有可能会隔代遗传吗？",
        "cypher": "MATCH (n:Disease {name: '肺癌'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "是不是矮小症",
        "cypher": "MATCH (m:Disease {name: '矮小症'}) RETURN m"
    },
    {
        "input": "精索静脉曲张是怎么回事.?",
        "cypher": "MATCH (m:Disease {name:'精索静脉曲张'}) RETURN m.get_way"
    },
    {
        "input": "神经胶质瘤怎么回事",
        "cypher": "MATCH (m:Disease {name: '神经胶质瘤'}) RETURN m"
    },
    {
        "input": "什么是多毛症",
        "cypher": "MATCH (m:Disease) WHERE m.name = '多毛症' RETURN m.desc"
    },
    {
        "input": "手足口病可以吃鸡蛋吗？",
        "cypher": "MATCH (m:Disease {name:'手足口病'})-[:do_eat]->(n:Food) WHERE n.name = '鸡蛋' RETURN n.name"
    },
    {
        "input": "我妈妈今年50岁..最近测出是胸腺癌..请问",
        "cypher": "MATCH (d:Disease {name: '胸腺癌'}) RETURN d.easy_get"
    },
    {
        "input": "滴虫性尿道炎的缓解方法？",
        "cypher": "MATCH (d:Disease {name: '滴虫性尿道炎'}) RETURN d.cure_way"
    },
    {
        "input": "子宫囊肿是怎么回事？",
        "cypher": "MATCH (m:Disease {name:'子宫囊肿'}) RETURN m"
    },
    {
        "input": "医治精索静脉曲张费用",
        "cypher": "MATCH (n:Disease {name: '精索静脉曲张'})-[:belongs_to]->(m:Department) RETURN m.name AS 科室名称, n.cost_money AS 费用"
    },
    {
        "input": "治疗肾囊肿有名的专家是谁啊？",
        "cypher": "MATCH (n1:Disease {name: '肾囊肿'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "盆底痉挛综合症5年了快救救我？",
        "cypher": "MATCH (d:Disease {name: '盆底痉挛综合症'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺增生是由什么原因引起的呢",
        "cypher": "MATCH (m:Disease {name:'前列腺增生'}) RETURN m.cause"
    },
    {
        "input": "想知道外阴瘙痒是什么情况",
        "cypher": "MATCH (m:Disease {name:'外阴瘙痒'}) RETURN m"
    },
    {
        "input": "不稳定型心绞痛如何治疗 ",
        "cypher": "MATCH (d:Disease {name: '不稳定型心绞痛'}) RETURN d.cure_way"
    },
    {
        "input": "怎样判断是前列腺钙化",
        "cypher": "MATCH (m:Disease {name: '前列腺钙化'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "前列腺增生与性生活？",
        "cypher": "MATCH (v1:Disease {name: '前列腺增生'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "包皮龟头炎挂什么科",
        "cypher": "MATCH (v1:Disease {name: '包皮龟头炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "鼻血管瘤如何诊断？",
        "cypher": "MATCH (m:Disease {name:'鼻血管瘤'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "紫癜性肾炎遗传吗？",
        "cypher": "MATCH (m:Disease {name:'紫癜性肾炎'}) RETURN m.cause"
    },
    {
        "input": "小孩过敏性哮喘咳嗽吃哪种药好",
        "cypher": "MATCH (n:Disease {name: '过敏性哮喘'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "请帮看一下是心肌炎吗",
        "cypher": "MATCH (m:Disease {name: '心肌炎'}) RETURN m"
    },
    {
        "input": "多发性骨髓瘤哪里治疗最好？",
        "cypher": "MATCH (m:Disease {name: '多发性骨髓瘤'})-[:belongs_to]->(d:Department) RETURN d.name"
    },
    {
        "input": "出现附睾畸形应该怎么决？",
        "cypher": "MATCH (m:Disease {name:'附睾畸形'}) RETURN m.cure_way"
    },
    {
        "input": "为何小孩会经常出现呕吐现象？",
        "cypher": "MATCH (n:Disease)-[r:has_symptom]->(m:Symptom) WHERE m.name = '呕吐' RETURN n.name"
    },
    {
        "input": "怎么去脑癌的方法风险更小不会影响健康呢？",
        "cypher": "MATCH (d:Disease {name: '脑癌'}) RETURN d.cure_way"
    },
    {
        "input": "感冒好的仍流鼻涕是怎么回事呢?",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:has_symptom]->(n:Symptom {name:'流鼻涕'}) RETURN m.cure_lasttime"
    },
    {
        "input": "我现在的乳房结核该怎么去治疗会好点呀？",
        "cypher": "MATCH (d:Disease {name: '乳房结核'}) RETURN d.cure_way"
    },
    {
        "input": "小儿多动症医院哪家好？",
        "cypher": "MATCH (v1:Disease {name: '小儿多动症'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "口臭是病吗",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'口臭'}) RETURN m.name AS diseaseName"
    },
    {
        "input": "红斑狼疮是什么病症",
        "cypher": "MATCH (m:Disease {name:'红斑狼疮'}) RETURN m.name,m.desc"
    },
    {
        "input": "孩子今年16岁多开学就说睡觉不好怎么办？",
        "cypher": "MATCH (d:Disease {name: '失眠症'}) RETURN d.cure_way"
    },
    {
        "input": "湿疹涂药后没有性功能了怎么办？",
        "cypher": "MATCH (m:Disease {name:'湿疹'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "得了胃癌，是中期，有什么好的方法治疗吗？",
        "cypher": "MATCH (d:Disease {name: '胃癌'}) RETURN d.cure_way"
    },
    {
        "input": "想知道引起妇科炎症的因素或病因有哪些？",
        "cypher": "MATCH (m:Disease {name:'妇科炎症'}) RETURN m.cause"
    },
    {
        "input": "输卵管积水的晚期症状是什么？",
        "cypher": "MATCH (n:Disease {name: '输卵管积水'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "肺功能衰竭应该怎样治疗？",
        "cypher": "MATCH (d:Disease {name: '肺功能衰竭'}) RETURN d.cure_way"
    },
    {
        "input": "患有了小细胞肺癌吃什么好？",
        "cypher": "MATCH (v1:Disease {name: '小细胞肺癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "多发性硬化日是每年多少号",
        "cypher": "MATCH (n:Disease {name:'多发性硬化'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "哪家治附睾炎能否进行处理呢",
        "cypher": "MATCH (n1:Disease {name: '附睾炎'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "你好！我想请问下胃穿孔手术的风险大吗？",
        "cypher": "MATCH (d:Disease {name: '胃穿孔'}) RETURN d.cure_way"
    },
    {
        "input": "济南哪治偏瘫好",
        "cypher": "MATCH (v1:Disease {name: '偏瘫'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "龟头炎病因有哪些？",
        "cypher": "MATCH (n:Disease {name: '龟头炎'}) RETURN n.cause"
    },
    {
        "input": "浅表性胃炎吃药不见效怎么办？",
        "cypher": "MATCH (m:Disease {name:'浅表性胃炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "肝炎病人和他们接触过后的衣物会传染吗？",
        "cypher": "MATCH (n1:Disease {name: '肝炎'})-[:acompany_with]->(n2:Disease) RETURN n2.get_way"
    },
    {
        "input": "便血是怎么回事啊",
        "cypher": "MATCH (m:Disease {name:'便血'}) RETURN m.cause"
    },
    {
        "input": "心肌缺血的症状是什么",
        "cypher": "MATCH (v1:Disease {name: '心肌缺血'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "听神经瘤手术几个月复查",
        "cypher": "MATCH (v1:Disease {name: '听神经瘤'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "我得痔疮已经二三十年了，一个月以前我做了痔疮",
        "cypher": "MATCH (d:Disease {name: '痔疮'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "癫痫的的解决办法是？",
        "cypher": "MATCH (m:Disease {name:'癫痫'}) RETURN m.prevent"
    },
    {
        "input": "神经性厌食症要怎么预防？",
        "cypher": "MATCH (n:Disease {name: '神经性厌食症'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "做漏斗胸较好的医院是哪家？",
        "cypher": "MATCH (n:Disease {name: '漏斗胸'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "便秘多年，十五六岁开始的，现在十八岁了一直没",
        "cypher": "MATCH (n:Disease {name: '便秘'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "癫痫发作的部位在腰部可能吗",
        "cypher": "MATCH (n1:Disease {name: '癫痫'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "自己如何看出甲状腺有问题",
        "cypher": "MATCH (m:Disease {name:'甲状腺疾病'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "性功能障碍治疗的价钱都是多少",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "治疗膀胱癌大概需要多少钱",
        "cypher": "MATCH (n:Disease {name: '膀胱癌'}) RETURN n.cost_money"
    },
    {
        "input": "肿瘤切除了还会导致复发吗？",
        "cypher": "MATCH (m:Disease {name: '肿瘤'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "鼻神经胶质瘤要怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '鼻神经胶质瘤'}) RETURN d.cure_way"
    },
    {
        "input": "治疗阳痿要多少瓶药和多少天疗程",
        "cypher": "MATCH (v1:Disease {name: '阳痿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name AS name, v2.cure_lasttime AS cure_lasttime"
    },
    {
        "input": "脑干肿瘤应该怎么办才好",
        "cypher": "MATCH (d:Disease {name: '脑干肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "月经第15天还可以做造影吗？",
        "cypher": "MATCH (n:Disease)-[r:need_check]->(m:Check) WHERE m.name CONTAINS '造影' AND n.name CONTAINS '月经' RETURN m.name"
    },
    {
        "input": "酒精性肝硬化饮食要注意什么",
        "cypher": "MATCH (v1:Disease {name: '酒精性肝硬化'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "脑萎缩的治疗药物有哪些",
        "cypher": "MATCH (v1:Disease {name: '脑萎缩'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "造成肛瘘的病因是什么",
        "cypher": "MATCH (m:Disease {name: '肛瘘'}) RETURN m.cause"
    },
    {
        "input": "胃出血治疗的方法是什么",
        "cypher": "MATCH (d:Disease {name: '胃出血'}) RETURN d.cure_way"
    },
    {
        "input": "遗精是怎么个回事？",
        "cypher": "MATCH (m:Disease {name:'遗精'}) RETURN m.name, m.desc"
    },
    {
        "input": "在得了纵膈肿瘤的疾病后一般是怎么治疗的？",
        "cypher": "MATCH (d:Disease {name: '纵膈肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "医院诊断为产后风湿西医应该没有办法吧？",
        "cypher": "MATCH (n1:Disease {name: '产后风湿'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "宝宝便秘严重不严重",
        "cypher": "MATCH (m:Disease {name:'便秘'}) RETURN m.cure_lasttime"
    },
    {
        "input": "肺炎好了一直咳嗽怎么办",
        "cypher": "MATCH (d:Disease {name: '肺炎'})-[:has_symptom]->(s:Symptom {name: '咳嗽'}) RETURN s.name"
    },
    {
        "input": "非霍奇金淋巴瘤的危害都有哪些？",
        "cypher": "MATCH (m:Disease {name:'非霍奇金淋巴瘤'})-[]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "习惯性流产的诊断方法有什么",
        "cypher": "MATCH (v1:Disease {name: '习惯性流产'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "肾结石9x6mm吃药能否排出来",
        "cypher": "MATCH (d:Disease {name:'肾结石'})-[:common_drug|:recommand_drug]->(dr:Drug) RETURN dr.name"
    },
    {
        "input": "胆囊结石应该吃什么食物",
        "cypher": "MATCH (v1:Disease {name: '胆囊结石'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "我想了解一下过敏性哮喘和哮喘到底有什么区别？",
        "cypher": "MATCH (v1:Disease {name: '过敏性哮喘'})-[]->(v2) MATCH (v3:Disease {name: '哮喘'})-[]->(v4) RETURN v2"
    },
    {
        "input": "我想了解外阴瘙痒是妇科病吗",
        "cypher": "MATCH (n:Disease {name: '外阴瘙痒'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "睾丸损伤的症状是什么样",
        "cypher": "MATCH (m:Disease {name:'睾丸损伤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "围生期心肌病能治好吗？",
        "cypher": "MATCH (d:Disease {name: '围生期心肌病'}) RETURN d.cure_way"
    },
    {
        "input": "造成血精症的原因都有哪些呢？",
        "cypher": "MATCH (m:Disease {name:'血精症'}) RETURN m.cause"
    },
    {
        "input": "肝癌良性和恶性分别有哪些症状",
        "cypher": "MATCH (m:Disease {name:'肝癌'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "青光眼多久会治好",
        "cypher": "MATCH (m:Disease {name: '青光眼'}) RETURN m.cure_lasttime"
    },
    {
        "input": "我宝宝出生18天检查出来有心脏病怎么办？",
        "cypher": "MATCH (m:Disease {name: '心脏病'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "视神经炎用什么药有效果",
        "cypher": "MATCH (v1:Disease {name: '视神经炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "苯丙酮尿症的致病原理是什么？",
        "cypher": "MATCH (n:Disease {name: '苯丙酮尿症'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "心脏神经症吃什么药比较好",
        "cypher": "MATCH (v1:Disease {name: '心脏神经症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脑血栓在哪里治疗好",
        "cypher": "MATCH (v1:Disease {name: '脑血栓'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "胆囊息肉注意什么事项？",
        "cypher": "MATCH (m:Disease {name:'胆囊息肉'}) RETURN m.prevent"
    },
    {
        "input": "胃镜",
        "cypher": "MATCH (v1:Disease)-[v2:need_check]->(v3:Check) WHERE v3.name = '胃镜' RETURN v1,v2,v3"
    },
    {
        "input": "外阴白色病变要怎么治",
        "cypher": "MATCH (d:Disease {name: '外阴白色病变'}) RETURN d.cure_way"
    },
    {
        "input": "腹膜炎服用什么药治疗",
        "cypher": "MATCH (v1:Disease {name: '腹膜炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "这样的龟头炎严重不严重？",
        "cypher": "MATCH (m:Disease {name:'龟头炎'}) RETURN m.cure_lasttime"
    },
    {
        "input": "乳腺结节吃什么散结快",
        "cypher": "MATCH (v1:Disease {name: '乳腺结节'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": " 男孩患心肌炎",
        "cypher": "MATCH (d:Disease {name: '心肌炎'}) RETURN d.easy_get"
    },
    {
        "input": "婴儿得了中耳炎的症状是什么",
        "cypher": "MATCH (m:Disease {name:'中耳炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我还年轻，可是医生说我是脊髓型颈椎病，严",
        "cypher": "MATCH (d:Disease {name: '脊髓型颈椎病'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "低钾血症、低镁血症引起尖端扭转型室速",
        "cypher": "MATCH (d:Disease {name:'低钾血症'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "盆腔积液严重会导致什么？",
        "cypher": "MATCH (m:Disease {name:'盆腔积液'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "来月经的时候腰酸正常吗",
        "cypher": "MATCH (m:Symptom {name: '腰酸'})-[:has_symptom]-(d:Disease) RETURN d.name"
    },
    {
        "input": "我是一个肥厚型梗阻性心肌病的患者，我现在已怀",
        "cypher": "MATCH (d:Disease {name: '肥厚型梗阻性心肌病'}) RETURN d.easy_get"
    },
    {
        "input": "肝癌传染吗？咋样于防它？",
        "cypher": "MATCH (n:Disease {name: '肝癌'}) RETURN n.get_way, n.prevent"
    },
    {
        "input": "barrett食管需要戒什么东西",
        "cypher": "MATCH (v1:Disease {name:'Barrett食管'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "有过一次宫外孕至今一直避孕（并切除了一侧输卵",
        "cypher": "MATCH (d:Disease)-[r:belongs_to]->(dp:Department) WHERE d.name = '宫外孕' RETURN dp.name"
    },
    {
        "input": "胆囊息肉是否会变癌症",
        "cypher": "MATCH (m:Disease {name:'胆囊息肉'})-[:acompany_with]->(n:Disease {name:'胆囊癌'}) RETURN n"
    },
    {
        "input": "糖尿病引起的尿毒症咋办",
        "cypher": "MATCH (m:Disease {name:'尿毒症'})<-[:acompany_with]-(n:Disease {name:'糖尿病'}) RETURN m.cureWay"
    },
    {
        "input": "夫妻长时间没有性生活，会造成妇科病吗，或",
        "cypher": "MATCH (d:Disease)-[r:belongs_to]->(dp:Department) WHERE d.name CONTAINS '妇科病' AND dp.name CONTAINS '妇科' RETURN d,r,dp"
    },
    {
        "input": "椎管内囊肿是什么病",
        "cypher": "MATCH (m:Disease) RETURN m.desc"
    },
    {
        "input": "脐膨出超声表现怎么回事？",
        "cypher": "MATCH (m:Disease {name: '脐膨出'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "晨起恶心是什么原因引起的",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'恶心'}) RETURN m.name AS 疾病名称, m.cause AS 病因"
    },
    {
        "input": "甲状腺癌的特征是什么?..",
        "cypher": "MATCH (m:Disease {name:'甲状腺癌'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "纤维肉瘤是不是恶性肿瘤",
        "cypher": "MATCH (n:Disease {name: '纤维肉瘤'}) RETURN n.cause"
    },
    {
        "input": "肺炎与肺癌的区别有什么呢",
        "cypher": "MATCH (m:Disease {name:'肺炎'})-[:acompany_with]-(n:Disease {name:'肺癌'}) RETURN m,n"
    },
    {
        "input": "口腔癌的预防都是什么？",
        "cypher": "MATCH (n:Disease {name: '口腔癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "前段时间我的一个朋友突然就得了面瘫就是现在不",
        "cypher": "MATCH (d:Disease {name: '面瘫'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "结肠癌是指什么啊",
        "cypher": "MATCH (m:Disease {name:'结肠癌'})-[]->(n) RETURN m,n"
    },
    {
        "input": "我撸管后精液射倒纸上有点发黄",
        "cypher": "MATCH (d:Disease)-[:has_symptom]->(s:Symptom) WHERE s.name = '精液发黄' RETURN d.name"
    },
    {
        "input": "肝脓肿的饮食护理有哪些？",
        "cypher": "MATCH (m:Disease {name:'肝脓肿'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "阑尾炎手术后粘连了的都有哪些样的反应？",
        "cypher": "MATCH (m:Disease {name:'阑尾炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "胰腺炎这种疾病严重吗",
        "cypher": "MATCH (m:Disease {name:'胰腺炎'}) RETURN m.cure_lasttime"
    },
    {
        "input": "肠系膜上动脉综合征哪里治比较好？",
        "cypher": "MATCH (n:Disease {name: '肠系膜上动脉综合征'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "卵巢囊肿患者适合带环吗？",
        "cypher": "MATCH (n:Disease {name:'卵巢囊肿'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "得盆腔腹膜炎怎样治疗？",
        "cypher": "MATCH (d:Disease {name: '盆腔腹膜炎'}) RETURN d.cure_way"
    },
    {
        "input": "腋臭微创手术前需要准备哪些",
        "cypher": "MATCH (d:Disease {name: '腋臭'}) RETURN d.cure_way"
    },
    {
        "input": "没感觉到，检查是前列腺炎",
        "cypher": "MATCH (d:Disease {name: '前列腺炎'})-[:need_check]->(c:Check) RETURN c.name"
    },
    {
        "input": "患高血压的症状",
        "cypher": "MATCH (v1:Disease {name: '高血压'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "舌癌的注意事项有哪些?",
        "cypher": "MATCH (m:Disease {name:'舌癌'}) RETURN m.prevent"
    },
    {
        "input": "小儿脑瘫的定义是什么",
        "cypher": "MATCH (n:Disease {name: '小儿脑瘫'}) RETURN n.desc"
    },
    {
        "input": "腮腺混合瘤手术风险大吗",
        "cypher": "MATCH (d:Disease {name: '腮腺混合瘤'}) RETURN d.cure_way"
    },
    {
        "input": "检查得的卵巢囊肿，附件炎",
        "cypher": "MATCH (m:Disease {name: '卵巢囊肿'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "红斑狼疮要检测哪些抗体",
        "cypher": "MATCH (v1:Disease {name: '红斑狼疮'})-[:need_check]->(v2:Check) RETURN v2.name"
    },
    {
        "input": "是什么原因引起结肠癌？",
        "cypher": "MATCH (m:Disease {name:'结肠癌'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "病人已昏迷一周是什么并病?",
        "cypher": "MATCH (m:Disease {name: '昏迷'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "患上包皮过长该如何诊断呢",
        "cypher": "MATCH (m:Disease {name:'包皮过长'})-[:need_check]->(n:Check) RETURN m,n"
    },
    {
        "input": "下肢静脉曲张临床表现有哪些？",
        "cypher": "MATCH (m:Disease {name: '下肢静脉曲张'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "什么是新生儿寒冷损伤综合征",
        "cypher": "MATCH (m:Disease {name: '新生儿寒冷损伤综合征'}) RETURN m"
    },
    {
        "input": "肠癌的病因是什么?",
        "cypher": "MATCH (n:Disease {name: '肠癌'}) RETURN n.cause"
    },
    {
        "input": "结肠息肉04cm大吗",
        "cypher": "MATCH (m:Disease {name:'结肠息肉'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "子宫内膜癌会引起其他反应吗？",
        "cypher": "MATCH (m:Disease {name:'子宫内膜癌'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "下面情况我是否患了咽喉癌",
        "cypher": "MATCH (m:Disease {name: '咽喉癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "多久时间能查出宫外孕",
        "cypher": "MATCH (m:Disease {name: '宫外孕'})-[:need_check]->(n:Check) RETURN n.name AS check_name"
    },
    {
        "input": "腿部红肿，医生说是白塞病。但一直反复，需要长",
        "cypher": "MATCH (d:Disease {name: '白塞病'}) RETURN d.cure_way"
    },
    {
        "input": "下肢动脉硬化闭塞症多走路有没有效果",
        "cypher": "MATCH (d:Disease {name: '下肢动脉硬化闭塞症'}) RETURN d.cure_way"
    },
    {
        "input": "痛苦不堪的哮喘病人求助!!",
        "cypher": "MATCH (m:Disease {name: '哮喘'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "风湿病人在饮食上需要注意些什么",
        "cypher": "MATCH (v1:Disease {name: '风湿病'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "我爱人得了内痔做了手术后又后遗症怎么办",
        "cypher": "MATCH (d:Disease {name: '内痔'})-[:acompany_with]->(r:Disease) RETURN r"
    },
    {
        "input": "原发性侧索硬化去哪间医院可治好",
        "cypher": "MATCH (d:Disease {name: '原发性侧索硬化'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "做爱早射勃起的也快什么原因导致的呢？",
        "cypher": "MATCH (m:Disease {name:'早泄'}) RETURN m.name"
    },
    {
        "input": "小儿支气管炎食疗有什么",
        "cypher": "MATCH (v1:Disease {name: '小儿支气管炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "结肠息肉有哪些症状？",
        "cypher": "MATCH (m:Disease {name:'结肠息肉'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "重症肌无力禁用药物有哪些?",
        "cypher": "MATCH (m:Disease {name:'重症肌无力'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "抽动症的临床症状是什么?",
        "cypher": "MATCH (m:Disease {name:'抽动症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "查骨肿瘤的方法哪里好",
        "cypher": "MATCH (m:Disease {name:'骨肿瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "什么叫新生儿溶血？什么叫病毒性血液感染？",
        "cypher": "MATCH (m:Disease {name: '新生儿溶血病'}) RETURN m.desc"
    },
    {
        "input": "平滑肌肉瘤的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'平滑肌肉瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "颈部血管瘤有哪些危害",
        "cypher": "MATCH (m:Disease {name: '颈部血管瘤'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "宫颈糜烂的预防措施是什么",
        "cypher": "MATCH (n:Disease {name: '宫颈糜烂'}) RETURN n.prevent"
    },
    {
        "input": "心脏内粘液瘤能做手术么 ",
        "cypher": "MATCH (d:Disease {name: '心脏内粘液瘤'}) RETURN d.cure_way"
    },
    {
        "input": "手淫12年慢性胃炎患者体弱吃什么",
        "cypher": "MATCH (n:Disease {name: '慢性胃炎'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "这是不是睾丸有病",
        "cypher": "MATCH (n:Disease {name:'睾丸炎'}) RETURN n"
    },
    {
        "input": "肺癌并发症有哪些",
        "cypher": "MATCH (m1:Disease {name: '肺癌'})-[:acompany_with]-(m2:Disease) RETURN m2"
    },
    {
        "input": "肾积水是一种很严重的疾病吗",
        "cypher": "MATCH (n:Disease {name: '肾积水'}) RETURN n.cause"
    },
    {
        "input": "新生儿黄疸严不严重呢",
        "cypher": "MATCH (m:Disease {name:'新生儿黄疸'}) RETURN m.cure_lasttime"
    },
    {
        "input": "皮肤癌的患病原因有哪些",
        "cypher": "MATCH (n:Disease {name: '皮肤癌'}) RETURN n.cause"
    },
    {
        "input": "哪家医院看勃起功能障碍最好",
        "cypher": "MATCH (n:Disease {name:'勃起功能障碍'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "既肾阴虚又肾阳虚如何处理？",
        "cypher": "MATCH (d:Disease {name: '肾阴虚'}) RETURN d.cure_way"
    },
    {
        "input": "11天新生儿败血症、肠炎、痢疾",
        "cypher": "MATCH (m1:Disease {name: '败血症'})-[:belongs_to]->(m2:Department) RETURN m2.name"
    },
    {
        "input": "POEMS综合征会导致哪些病变呢？",
        "cypher": "MATCH (m:Disease {name: 'POEMS综合征'})-[:acompany_with]->(n:Disease) RETURN n"
    },
    {
        "input": "最近月经量少了怎么办？",
        "cypher": "MATCH (m:Disease {name: '月经量少'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "结核病药物是不是抗生素对人身体有害吗",
        "cypher": "MATCH (n:Disease {name:'结核病'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    }
]