[
    {
        "input": "结肠癌饮食应该注意什么？",
        "cypher": "MATCH (m:Disease {name: '结肠癌'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "怎样预防胰腺癌",
        "cypher": "MATCH (d:Disease {name: '胰腺癌'})-[:belongs_to]->(p:Department) RETURN p.name"
    },
    {
        "input": "阑尾炎可以保守治疗吗",
        "cypher": "MATCH (d:Disease {name: '阑尾炎'}) RETURN d.cure_way"
    },
    {
        "input": "垂体瘤手术好还是做伽马刀好?",
        "cypher": "MATCH (d:Disease {name: '垂体瘤'}) RETURN d.cure_way"
    },
    {
        "input": "尿不尽是病吗",
        "cypher": "MATCH (m:Disease)-[r:has_symptom]->(n:Symptom) WHERE n.name = '尿不尽' RETURN m.name"
    },
    {
        "input": "孕中期出现便秘怎么办",
        "cypher": "MATCH (v1:Disease {name: '便秘'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "女人性冷淡还有得治疗吗",
        "cypher": "MATCH (m:Disease {name:'性冷淡'}) RETURN m.cure_way"
    },
    {
        "input": "胆囊炎如何治疗比较好",
        "cypher": "MATCH (d:Disease {name: '胆囊炎'}) RETURN d.cure_way"
    },
    {
        "input": "脑炎后遗症的人该养成哪种饮食习惯",
        "cypher": "MATCH (v1:Disease {name: '脑炎后遗症'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "我想咨询结核性宫颈炎的症状有哪些？",
        "cypher": "MATCH (n:Disease {name: '结核性宫颈炎'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "小儿脑瘫又叫什么有什么原因",
        "cypher": "MATCH (m:Disease {name:'小儿脑瘫'})-[:acompany_with]->(n:Disease) RETURN n.name, m.cause"
    },
    {
        "input": "自发性气胸手术后要注意什么",
        "cypher": "MATCH (d:Disease {name: '自发性气胸'}) RETURN d.cure_way"
    },
    {
        "input": "这是阴囊炎吗",
        "cypher": "MATCH (m:Disease {name:'阴囊炎'}) RETURN m"
    },
    {
        "input": "肝癌肺转移腹胀去哪家医院好",
        "cypher": "MATCH (d:Disease {name: '肝癌'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "患霉菌性阴道炎与什么有关",
        "cypher": "MATCH (m:Disease {name: '霉菌性阴道炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "毛细血管瘤激光治疗要多久",
        "cypher": "MATCH (d:Disease {name: '毛细血管瘤'}) RETURN d.cure_way"
    },
    {
        "input": "是不是淋巴癌吗?",
        "cypher": "MATCH (m:Disease {name:'淋巴癌'}) RETURN m"
    },
    {
        "input": "包皮手术后早泄",
        "cypher": "MATCH (d:Disease {name: '早泄'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "酒精中毒可以吃什么药",
        "cypher": "MATCH (v1:Disease {name: '酒精中毒'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "高血脂用什么药效果会好",
        "cypher": "MATCH (v1:Disease {name: '高血脂'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "有先天性巨结肠还会有其它的消化畸形吗？",
        "cypher": "MATCH (m:Disease {name:'先天性巨结肠'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "全国治疗早泄哪个医院好？",
        "cypher": "MATCH (n:Disease {name:'早泄'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "手足口病饮食有什么要注意的吗？",
        "cypher": "MATCH (v1:Disease {name: '手足口病'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "咨询不孕不育症状",
        "cypher": "MATCH (v1:Disease {name: '不孕不育'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "肝囊肿的非手术疗法有什么",
        "cypher": "MATCH (d:Disease {name: '肝囊肿'}) RETURN d.cure_way"
    },
    {
        "input": "孩子前天咳嗽昨天晚上开始发烧吃啥药？",
        "cypher": "MATCH (m:Disease {name:'咳嗽'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "较近半个月里每天遗精是什么原因",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '遗精' RETURN d.name, d.cause"
    },
    {
        "input": "高血压的症状表现有哪些？",
        "cypher": "MATCH (m:Disease {name:'高血压'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "8岁儿童会不会卵巢囊肿？",
        "cypher": "MATCH (d:Disease {name: '卵巢囊肿'}) RETURN d.easy_get"
    },
    {
        "input": "胃下垂有哪些危害",
        "cypher": "MATCH (m:Disease {name:'胃下垂'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "痔疮平时在意什么",
        "cypher": "MATCH (m:Disease {name: '痔疮'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "甲状腺疾病应该吃什么药最好？",
        "cypher": "MATCH (v1:Disease {name: '甲状腺疾病'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "巧克力囊肿去中国哪里治疗比较好呢？",
        "cypher": "MATCH (n1:Disease {name: '巧克力囊肿'})-[:belongs_to]->(n2:Department) RETURN n2.name"
    },
    {
        "input": "晚上一直打喷嚏怎么办",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE n.name = '打喷嚏' RETURN m.name"
    },
    {
        "input": "五年前患过恶性肿瘤",
        "cypher": "MATCH (n:Disease {name: '恶性肿瘤'})-[:acompany_with]-(m:Disease) RETURN m.name"
    },
    {
        "input": "经常感冒食欲不振是肾阳虚还是阴虚",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '感冒' AND d.name = '肾阳虚' OR d.name = '肾阴虚' RETURN d"
    },
    {
        "input": "白带异常请问有什么症状",
        "cypher": "MATCH (m:Disease {name:'白带异常'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "我因多毛症很自卑很痛苦怎么办",
        "cypher": "MATCH (d:Disease {name: '多毛症'}) RETURN d.cure_way"
    },
    {
        "input": "爷爷说痛风患者是由于血热所导致的是这样吗？",
        "cypher": "MATCH (m:Disease {name:'痛风'}) RETURN m.cause"
    },
    {
        "input": "新生儿黄疸有什么信号？",
        "cypher": "MATCH (m:Disease {name: '新生儿黄疸'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "如何预防鞭虫病 ",
        "cypher": "MATCH (m:Disease {name: '鞭虫病'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "肢端肥大症到底是什么",
        "cypher": "MATCH (m:Disease) WHERE m.name = '肢端肥大症' RETURN m.desc"
    },
    {
        "input": "六味地黄丸对早泄有用吗？",
        "cypher": "MATCH (n:Disease {name:'早泄'})-[:common_drug|:recommand_drug]->(m:Drug {name:'六味地黄丸'}) RETURN m"
    },
    {
        "input": "强直性脊柱炎患者会诱发哪些别的病因呢？",
        "cypher": "MATCH (v1:Disease {name: '强直性脊柱炎'})-[:acompany_with]-(v2:Disease) RETURN v2.name"
    },
    {
        "input": "崩漏的中医治疗方法？",
        "cypher": "MATCH (d:Disease {name: '崩漏'}) RETURN d.cure_way"
    },
    {
        "input": "甲状腺癌转移了吗?",
        "cypher": "MATCH (m:Disease {name: '甲状腺癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "宫颈炎患者都有哪些病因?",
        "cypher": "MATCH (n:Disease {name: '宫颈炎'})-[:acompany_with]-(m:Disease) RETURN m.cause"
    },
    {
        "input": "前列腺炎需要多吃什么食物调理呢",
        "cypher": "MATCH (v1:Disease {name: '前列腺炎'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "前列腺癌有哪些常见的症状表现？",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "直肠癌是什么样的病",
        "cypher": "MATCH (m:Disease {name: '直肠癌'}) RETURN m"
    },
    {
        "input": "肝癌会不会有传染性",
        "cypher": "MATCH (n:Disease {name: '肝癌'}) RETURN n.get_way"
    },
    {
        "input": "5个月婴儿尿布疹久治不愈怎么治？",
        "cypher": "MATCH (d:Disease {name: '尿布疹'}) RETURN d.cure_way"
    },
    {
        "input": "请问死精症是怎么回事",
        "cypher": "MATCH (m:Disease) WHERE m.name='死精症' RETURN m.desc"
    },
    {
        "input": "脑病平时应该注意哪些饮食呢，该怎么治疗比较好",
        "cypher": "MATCH (m:Disease {name:'脑病'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "胃下垂的食疗？",
        "cypher": "MATCH (v1:Disease {name: '胃下垂'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "患有内痔费用标准是什么?",
        "cypher": "MATCH (n:Disease {name: '内痔'}) RETURN n.cost_money"
    },
    {
        "input": "是否是黑色素瘤?",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'}) RETURN m"
    },
    {
        "input": "怀孕了白带异常怎么办？",
        "cypher": "MATCH (m:Disease {name:'白带异常'})<-[:belongs_to]->(n:Department) RETURN m.cureWay"
    },
    {
        "input": "热伤风发烧怎么治疗",
        "cypher": "MATCH (d:Disease {name: '热伤风'}) RETURN d.cure_way"
    },
    {
        "input": "前列腺结石吃什么中草药能排出体？",
        "cypher": "MATCH (v1:Disease {name: '前列腺结石'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "肾功能不全干细胞移植",
        "cypher": "MATCH (d:Disease {name: '肾功能不全'}) RETURN d.cure_way"
    },
    {
        "input": "产后风湿能治好吗，怎么治最有效",
        "cypher": "MATCH (d:Disease {name: '产后风湿'}) RETURN d.cure_way"
    },
    {
        "input": "请问一下侏儒症是什么病",
        "cypher": "MATCH (m:Disease) WHERE m.name = '侏儒症' RETURN m.desc"
    },
    {
        "input": "支气管炎是属于遗传病吗",
        "cypher": "MATCH (n:Disease {name: '支气管炎'}) RETURN n.cause"
    },
    {
        "input": "治疗唇癌较好医院是哪家",
        "cypher": "MATCH (n:Disease {name: '唇癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "需要做什么检查能查出是否有宫颈癌",
        "cypher": "MATCH (m:Disease {name: '宫颈癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "骨癌晚期患者饮食要注意什么",
        "cypher": "MATCH (v1:Disease {name: '骨癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "胃癌会不会遗传呢",
        "cypher": "MATCH (m:Disease {name:'胃癌'})-[:acompany_with]-(n:Disease) RETURN n.get_prob"
    },
    {
        "input": "新生儿14天有胎毒怎么处理",
        "cypher": "MATCH (d:Disease {name: '胎毒'}) RETURN d.cure_way"
    },
    {
        "input": "大叶性肺炎一周 怎么办",
        "cypher": "MATCH (d:Disease {name: '大叶性肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "患有支气管哮喘几种药物是否可以一起吃",
        "cypher": "MATCH (v1:Disease {name: '支气管哮喘'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "胸腔积液严重吗",
        "cypher": "MATCH (m:Disease {name:'胸腔积液'})-[:acompany_with]-(n:Disease) RETURN n"
    },
    {
        "input": "包皮水肿包皮下面连着龟头怎么办",
        "cypher": "MATCH (m:Disease {name: '包皮水肿'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "乳腺纤维腺瘤会自己消失吗？",
        "cypher": "MATCH (d:Disease {name: '乳腺纤维腺瘤'}) RETURN d.cure_way"
    },
    {
        "input": "佝偻病是啥意思",
        "cypher": "MATCH (m:Disease {name:'佝偻病'}) RETURN m.name,m.desc"
    },
    {
        "input": "肿瘤一般都长在什么位置",
        "cypher": "MATCH (m:Disease {name: '肿瘤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "宝宝六个月感冒流鼻涕怎么回事？",
        "cypher": "MATCH (m:Disease {name:'感冒'})-[:belongs_to]->(n:Department) RETURN m.cause"
    },
    {
        "input": "咳嗽性哮喘能否根治？",
        "cypher": "MATCH (d:Disease {name: '咳嗽性哮喘'}) RETURN d.cure_way"
    },
    {
        "input": "盆腔积液哪里看",
        "cypher": "MATCH (v1:Disease {name: '盆腔积液'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "肝病对后代有影响吗",
        "cypher": "MATCH (n:Disease {name: '肝病'})-[:acompany_with]->(m:Disease) RETURN m.name"
    },
    {
        "input": "导致癫痫病因的有哪些因素",
        "cypher": "MATCH (n:Disease {name: '癫痫'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "怎样护理丁型病毒性肝炎病人",
        "cypher": "MATCH (n:Disease {name: '丁型病毒性肝炎'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "阴道炎用了药下面有些刺痛正常吗？",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})-[:common_drug|:recommand_drug]->(n:Drug) RETURN n.name"
    },
    {
        "input": "消化不良会有哪些症状？",
        "cypher": "MATCH (m:Disease {name:'消化不良'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "通过治疗，治愈外伤性癫痫病可以治愈吗？",
        "cypher": "MATCH (d:Disease {name: '外伤性癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "胆囊结石护理措施怎么弄？",
        "cypher": "MATCH (n:Disease {name:'胆囊结石'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "小儿厌食症的推拿方法？",
        "cypher": "MATCH (d:Disease {name: '小儿厌食症'}) RETURN d.cure_way"
    },
    {
        "input": "胃癌变化的过程是什么",
        "cypher": "MATCH (m:Disease {name: '胃癌'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "肝硬化平时应该多吃哪些食物？",
        "cypher": "MATCH (m:Disease {name:'肝硬化'})-[:do_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "想知道男人早泄有哪些原因引起的？",
        "cypher": "MATCH (m:Disease {name:'早泄'}) RETURN m.cause"
    },
    {
        "input": "有哪些药物能治疗肝癌",
        "cypher": "MATCH (v1:Disease {name: '肝癌'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "早泄轻微阳痿怎么办？",
        "cypher": "MATCH (m:Disease {name:'早泄'})-[:belongs_to]->(n:Department) RETURN m.name,n.name"
    },
    {
        "input": "原发性肝癌现扩散全身应该怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '原发性肝癌'}) RETURN d.cure_way"
    },
    {
        "input": "甲型肝炎有哪些典型的症状的呢？",
        "cypher": "MATCH (m:Disease {name:'甲型肝炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "二尖瓣狭窄手术治疗效果如何",
        "cypher": "MATCH (d:Disease {name: '二尖瓣狭窄'}) RETURN d.cure_way"
    },
    {
        "input": "小儿颅内肿瘤是什么原因引起的啊？",
        "cypher": "MATCH (m:Disease {name:'小儿颅内肿瘤'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "前列腺炎跟性生活有关系吗",
        "cypher": "MATCH (v1:Disease {name: '前列腺炎'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "淋巴瘤晚期该会是什么情况呢",
        "cypher": "MATCH (m:Disease {name:'淋巴瘤'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "对于是不是得了甲亢",
        "cypher": "MATCH (m:Disease {name:'甲亢'})-[:has_symptom]->(n:Symptom) RETURN m,n"
    },
    {
        "input": "刚满月的小孩子得了急性肺炎该怎么办？",
        "cypher": "MATCH (d:Disease {name: '急性肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "尿道结石后，要怎么治疗？平时多喝水多运动",
        "cypher": "MATCH (d:Disease {name: '尿道结石'}) RETURN d.cure_way"
    },
    {
        "input": "急性胰腺炎机制是什么？",
        "cypher": "MATCH (m:Disease {name:'急性胰腺炎'})-[:acompany_with]->(n:Disease) RETURN n.cause"
    },
    {
        "input": "什么方法可以诊断前列腺癌",
        "cypher": "MATCH (m:Disease {name: '前列腺癌'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "膀胱癌哪里做手术最权威？",
        "cypher": "MATCH (n:Disease {name: '膀胱癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "有什么治疗脾功能亢进的方法",
        "cypher": "MATCH (d:Disease {name: '脾功能亢进'}) RETURN d.cure_way"
    },
    {
        "input": "卵巢囊肿严重吗?",
        "cypher": "MATCH (n:Disease {name: '卵巢囊肿'}) RETURN n.cure_lasttime"
    },
    {
        "input": "再生障碍性贫血血常规指标？",
        "cypher": "MATCH (m:Disease {name:'再生障碍性贫血'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "直肠癌发生的诱因是什么",
        "cypher": "MATCH (n:Disease {name: '直肠癌'})-[:acompany_with]->(m:Disease) RETURN m.cause"
    },
    {
        "input": "小孩细菌感染发烧如何处理",
        "cypher": "MATCH (d:Disease {name: '细菌感染'}) RETURN d.cure_way"
    },
    {
        "input": "我想知道肝癌可以活多久",
        "cypher": "MATCH (n:Disease {name: '肝癌'}) RETURN n.cure_lasttime"
    },
    {
        "input": "性功能障碍的人都会有什么症状？",
        "cypher": "MATCH (v1:Disease {name: '性功能障碍'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "脊膜瘤的症状一般是什么样的，如果发病的情",
        "cypher": "MATCH (d:Disease {name: '脊膜瘤'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "支气管炎比较严重突然腹部疼痛救救他？",
        "cypher": "MATCH (m:Disease {name:'支气管炎'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "肾动脉栓塞的症状有哪些？",
        "cypher": "MATCH (m:Disease {name:'肾动脉栓塞'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "小儿肠套叠空气灌肠后多长时间能吃东西？",
        "cypher": "MATCH (d:Disease {name: '小儿肠套叠'}) RETURN d.cure_way"
    },
    {
        "input": "肛瘘手术后多久不渗血",
        "cypher": "MATCH (d:Disease {name: '肛瘘'}) RETURN d.cure_way"
    },
    {
        "input": "霍奇金淋巴瘤的症状？",
        "cypher": "MATCH (m:Disease {name: '霍奇金淋巴瘤'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "哮喘病人的饮食有什么禁忌呀？",
        "cypher": "MATCH (m:Disease {name:'哮喘'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "血栓性静脉炎是小腿上怎么办",
        "cypher": "MATCH (d:Disease {name: '血栓性静脉炎'}) RETURN d.cure_way"
    },
    {
        "input": "孩子出现扁桃体炎高烧饮食需注意什么",
        "cypher": "MATCH (v1:Disease {name: '扁桃体炎'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "多发性软骨瘤怎样治疗？",
        "cypher": "MATCH (d:Disease {name: '多发性软骨瘤'}) RETURN d.cure_way"
    },
    {
        "input": "癫痫会遗产吗遗传的影响有多大",
        "cypher": "MATCH (m:Disease {name: '癫痫'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "孩子甲亢吃什么好",
        "cypher": "MATCH (v1:Disease {name: '甲亢'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "北京治小儿脑瘫的医院哪家比较好比较安全？",
        "cypher": "MATCH (n:Disease {name: '小儿脑瘫'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "治疗龟头炎专科医院是哪个",
        "cypher": "MATCH (v1:Disease {name: '龟头炎'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "淋巴水肿如何能消除肿痛?",
        "cypher": "MATCH (d:Disease {name: '淋巴水肿'}) RETURN d.cure_way"
    },
    {
        "input": "盆腔炎如果得不到及时的治疗有哪些危害",
        "cypher": "MATCH (m:Disease {name:'盆腔炎'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "前列腺炎注意些什么好呢？",
        "cypher": "MATCH (m:Disease {name:'前列腺炎'})-[:no_eat]->(n:Food) RETURN n.name"
    },
    {
        "input": "糖尿病好几年了，最近血糖高达20点，一直",
        "cypher": "MATCH (d:Disease {name: '糖尿病'})-[:has_symptom]->(s:Symptom) RETURN s.name"
    },
    {
        "input": "肺气肿应该吃什么药？",
        "cypher": "MATCH (v1:Disease {name: '肺气肿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "早泄会是什么病因所致的",
        "cypher": "MATCH (m:Disease {name: '早泄'})-[:acompany_with]-(n:Disease) RETURN n.cause"
    },
    {
        "input": "口齿不清是怎么回事?",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom {name:'口齿不清'}) RETURN m.name, m.desc"
    },
    {
        "input": "预防鼻咽癌的饮食需要注意的",
        "cypher": "MATCH (v1:Disease {name: '鼻咽癌'})-[:no_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "这个是外痔还是息肉？",
        "cypher": "MATCH (m:Disease {name:'外痔'})-[:has_symptom]->(n:Symptom) RETURN m.name,collect(n.name)"
    },
    {
        "input": "风寒感冒久治不愈该如何救治",
        "cypher": "MATCH (d:Disease {name: '风寒感冒'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍该注意些什么",
        "cypher": "MATCH (n:Disease {name: '性功能障碍'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "冠状动脉粥样硬化性心脏病如何救治",
        "cypher": "MATCH (d:Disease {name: '冠状动脉粥样硬化性心脏病'}) RETURN d.cure_way"
    },
    {
        "input": "输完液出现呼吸困难越输越重转入ICU",
        "cypher": "MATCH (d:Disease)-[r:has_symptom]->(s:Symptom) WHERE s.name = '呼吸困难' RETURN d.name"
    },
    {
        "input": "低血压吃什么东西好？",
        "cypher": "MATCH (v1:Disease {name: '低血压'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "冠心病如何治疗",
        "cypher": "MATCH (d:Disease {name: '冠心病'}) RETURN d.cure_way"
    },
    {
        "input": "如何预防减少卵巢癌发作",
        "cypher": "MATCH (d:Disease {name: '卵巢癌'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称, d.prevent AS 预防措施"
    },
    {
        "input": "盆腔炎治愈的可能性有多大?",
        "cypher": "MATCH (n:Disease {name: '盆腔炎'}) RETURN n.cured_prob"
    },
    {
        "input": "急性胆囊炎会不会因输液感染细菌导致的？",
        "cypher": "MATCH (m:Disease {name:'急性胆囊炎'}) RETURN m.cause"
    },
    {
        "input": "黄疸为什么老是反复",
        "cypher": "MATCH (m:Disease {name: '黄疸'})-[:acompany_with]-(n:Disease) RETURN n.name"
    },
    {
        "input": "我的肝内胆管结石大小肝内胆管结石大小为",
        "cypher": "MATCH (n:Disease {name:'肝内胆管结石'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "黑色素瘤给大家带来哪些困扰",
        "cypher": "MATCH (m:Disease {name:'黑色素瘤'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "输尿管结石，多运动多喝水结石会掉下来吗？",
        "cypher": "MATCH (m:Disease {name:'输尿管结石'}) RETURN m.prevent"
    },
    {
        "input": "癌症怎么检查",
        "cypher": "MATCH (m:Disease {name: '癌症'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "心律失常包括哪些",
        "cypher": "MATCH (v1:Disease {name: '心律失常'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "过敏性哮喘早期能治好吗？",
        "cypher": "MATCH (d:Disease {name: '过敏性哮喘'}) RETURN d.cure_way"
    },
    {
        "input": "宫颈糜烂吃什么药物可以抑制疾病呢",
        "cypher": "MATCH (v1:Disease {name: '宫颈糜烂'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "冠心病严重了会如何呢",
        "cypher": "MATCH (m:Disease {name:'冠心病'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "附睾畸形都有哪些严重后果？",
        "cypher": "MATCH (m:Disease {name:'附睾畸形'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "毛细血管瘤的常见类型有哪些？",
        "cypher": "MATCH (m:Disease {name:'毛细血管瘤'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "我想问甲状腺结节的问题:我看了..",
        "cypher": "MATCH (d:Disease {name: '甲状腺结节'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "怎么判断是膀胱炎还是结石啊？",
        "cypher": "MATCH (m:Disease {name:'膀胱炎'})-[:has_symptom]->(n:Symptom) RETURN m.name,collect(n.name)"
    },
    {
        "input": "痛风要如何进行治疗",
        "cypher": "MATCH (d:Disease {name: '痛风'}) RETURN d.cure_way"
    },
    {
        "input": "乳腺囊肿治疗的医院，有哪些？",
        "cypher": "MATCH (n:Disease {name: '乳腺囊肿'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "小儿脑瘫治疗要花多少钱呢？",
        "cypher": "MATCH (n:Disease {name: '小儿脑瘫'}) RETURN n.cost_money"
    },
    {
        "input": "得手足口病多久不会传染？",
        "cypher": "MATCH (m:Disease {name: '手足口病'}) RETURN m.get_way"
    },
    {
        "input": "外阴瘙痒会是外阴炎吗",
        "cypher": "MATCH (m:Disease {name:'外阴炎'})-[:has_symptom]->(n:Symptom {name:'外阴瘙痒'}) RETURN m,n"
    },
    {
        "input": "慢性肾炎可以艾灸吗？",
        "cypher": "MATCH (d:Disease {name: '慢性肾炎'}) RETURN d.cure_way"
    },
    {
        "input": "结肠癌术后的饮食注意哪些",
        "cypher": "MATCH (v1:Disease {name: '结肠癌'})-[:do_eat]->(v2:Food) RETURN v2.name"
    },
    {
        "input": "怎么预防卵巢环管状性索肿瘤",
        "cypher": "MATCH (d:Disease {name: '卵巢环管状性索肿瘤'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "妇科炎症用什么药有效果",
        "cypher": "MATCH (v1:Disease {name: '妇科炎症'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "脑萎缩去哪治疗效果比较好",
        "cypher": "MATCH (v1:Disease {name: '脑萎缩'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "眼外伤需要多少钱？",
        "cypher": "MATCH (m:Disease {name:'眼外伤'}) RETURN m.cost_money"
    },
    {
        "input": "脊髓炎不能到可以去做康复吗？",
        "cypher": "MATCH (d:Disease {name: '脊髓炎'}) RETURN d.cure_way"
    },
    {
        "input": "如何护理肺癌发生转移的患者",
        "cypher": "MATCH (d:Disease {name: '肺癌'})-[:acompany_with]->(r:Disease) RETURN r"
    },
    {
        "input": "男生每个月会有遗精吗",
        "cypher": "MATCH (d:Disease {name: '遗精'}) RETURN d.easy_get"
    },
    {
        "input": "月经不调要做什么检查？",
        "cypher": "MATCH (m:Disease {name:'月经不调'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "乳糜尿应该怎么治",
        "cypher": "MATCH (d:Disease {name: '乳糜尿'}) RETURN d.cure_way"
    },
    {
        "input": "低血压的预防措施是什么？",
        "cypher": "MATCH (n:Disease {name: '低血压'}) RETURN n.prevent"
    },
    {
        "input": "你好，我有多囊肾，大的5·5cm，小的很多，",
        "cypher": "MATCH (d:Disease {name: '多囊肾'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "如何治运动神经元病",
        "cypher": "MATCH (d:Disease {name: '运动神经元病'}) RETURN d.cure_way"
    },
    {
        "input": "更年期引发的精神分裂症怎么办？",
        "cypher": "MATCH (d:Disease {name: '精神分裂症'}) RETURN d.cure_way"
    },
    {
        "input": "孩子小儿癫痫要注意什么，吃什么药？",
        "cypher": "MATCH (d:Disease {name: '小儿癫痫'}) RETURN d.easy_get"
    },
    {
        "input": "请问老年人糖尿病怎么办",
        "cypher": "MATCH (d:Disease {name: '糖尿病'}) RETURN d.easy_get"
    },
    {
        "input": "治疗龟头炎一包有多贵？",
        "cypher": "MATCH (n:Disease {name:'龟头炎'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.cost_money"
    },
    {
        "input": "尿道感染导致膀胱炎怎么办",
        "cypher": "MATCH (d:Disease {name: '膀胱炎'}) RETURN d.cure_way"
    },
    {
        "input": "怎样提早预防乳腺癌呢?",
        "cypher": "MATCH (n:Disease {name: '乳腺癌'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "新生儿黄疸3天正常值是多少啊",
        "cypher": "MATCH (m:Disease{name:'新生儿黄疸'})-[:need_check]->(n:Check) RETURN n.name"
    },
    {
        "input": "4岁女童，急性肾炎，半年没有一点恢复",
        "cypher": "MATCH (d:Disease {name: '急性肾炎'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "溶血性贫血血小板减少怎么办",
        "cypher": "MATCH (d:Disease {name: '溶血性贫血'}) RETURN d.cure_way"
    },
    {
        "input": "特发性肺纤维化有什么好的治疗方案",
        "cypher": "MATCH (d:Disease {name: '特发性肺纤维化'}) RETURN d.cure_way"
    },
    {
        "input": "孩子得了肺炎有什么特征",
        "cypher": "MATCH (m:Disease {name:'肺炎'})-[:has_symptom]->(n:Symptom) RETURN m.name,n.name"
    },
    {
        "input": "我的睾丸2年前被踢了严重吗？",
        "cypher": "MATCH (m:Disease {name: '睾丸损伤'})-[:belongs_to]->(n:Department) RETURN n.name"
    },
    {
        "input": "11个月已做了肠套叠手术各方面都正",
        "cypher": "MATCH (d:Disease {name: '肠套叠'})-[:belongs_to]->(dp:Department) RETURN dp.name"
    },
    {
        "input": "2010年做的宫颈癌手术现在还需要住院检查吗",
        "cypher": "MATCH (n:Disease {name: '宫颈癌'})-[:need_check]->(m:Check) RETURN m.name"
    },
    {
        "input": "请问睾丸肿瘤的预后怎么样？",
        "cypher": "MATCH (d:Disease {name: '睾丸肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "喝点六个核桃有营养吗",
        "cypher": "MATCH (v1:Disease)-[v2:do_eat]->(v3:Food) WHERE v3.name = '核桃' RETURN v1.name,v2,v3.name"
    },
    {
        "input": "女性36岁，肺癌晚期已扩散到心包，今天第一天",
        "cypher": "MATCH (d:Disease {name: '肺癌'})-[:belongs_to]->(dp:Department) RETURN dp.name AS 科室名称"
    },
    {
        "input": "女性糖尿病的早期症状是什么",
        "cypher": "MATCH (n:Disease {name: '糖尿病'})-[:has_symptom]->(m:Symptom) RETURN m.name"
    },
    {
        "input": "鼻咽癌的分型",
        "cypher": "MATCH (d:Disease {name: '鼻咽癌'})-[:acompany_with]->(t:Disease) RETURN t.name"
    },
    {
        "input": "如何治疗继发性痛经",
        "cypher": "MATCH (d:Disease {name: '继发性痛经'}) RETURN d.cure_way"
    },
    {
        "input": "慢性盆腔炎需要怎么治疗呢",
        "cypher": "MATCH (d:Disease {name: '慢性盆腔炎'}) RETURN d.cure_way"
    },
    {
        "input": "老公有甲亢，要小孩子会不会遗传给孩子？",
        "cypher": "MATCH (n:Disease {name: '甲亢'})-[:acompany_with]->(m:Disease) RETURN m"
    },
    {
        "input": "阴道炎的相关症状是什么？",
        "cypher": "MATCH (m:Disease {name:'阴道炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "轻度脂肪肝怎么预防呢",
        "cypher": "MATCH (n:Disease {name: '轻度脂肪肝'})-[:belongs_to]->(m:Department) RETURN m.name"
    },
    {
        "input": "小儿癫痫如何控制或者能治好？",
        "cypher": "MATCH (d:Disease {name: '小儿癫痫'}) RETURN d.cure_way"
    },
    {
        "input": "深圳男科医院早泄",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:belongs_to]->(v2:Department {name: '男科'}) RETURN v1, v2"
    },
    {
        "input": "肿瘤的种类有多少种？动手术可靠吗？安全吗？请",
        "cypher": "MATCH (n:Disease {name: '肿瘤'})-[:acompany_with]->(m:Disease) RETURN COUNT(m)"
    },
    {
        "input": "怎么能够预防支气管哮喘发作？",
        "cypher": "MATCH (m:Disease {name:'支气管哮喘'}) RETURN m.prevent"
    },
    {
        "input": "胸腺瘤微创手术术后怎么去调理？",
        "cypher": "MATCH (d:Disease {name: '胸腺瘤'}) RETURN d.cure_way"
    },
    {
        "input": "龟头炎多久能改善？",
        "cypher": "MATCH (m:Disease {name:'龟头炎'}) RETURN m.cure_way AS name"
    },
    {
        "input": "脑梗塞恢复期可以高血压的降压药吗？",
        "cypher": "MATCH (n:Disease {name: '脑梗塞'})-[:common_drug|:recommand_drug]->(m:Drug) RETURN m.name"
    },
    {
        "input": "小儿腹泻病怎么治疗",
        "cypher": "MATCH (d:Disease {name: '小儿腹泻病'}) RETURN d.cure_way"
    },
    {
        "input": "咳嗽是什么引起的严重吗",
        "cypher": "MATCH (m:Disease {name: '咳嗽'}) RETURN m.cause"
    },
    {
        "input": "偏瘫是什么引起的",
        "cypher": "MATCH (m:Disease {name: '偏瘫'}) RETURN m.cause"
    },
    {
        "input": "流产的胎囊埋在哪里好？",
        "cypher": "MATCH (n:Disease {name: '流产'})-[:do_eat]->(m:Food) RETURN m.name"
    },
    {
        "input": "小儿癫痫发作的话不一定每次都是大发作吗？",
        "cypher": "MATCH (m:Disease {name:'小儿癫痫'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "肾肿瘤治疗的辅助性措施是什么",
        "cypher": "MATCH (d:Disease {name: '肾肿瘤'}) RETURN d.cure_way"
    },
    {
        "input": "月经不调吃了药还要继续吃么？",
        "cypher": "MATCH (v1:Disease {name: '月经不调'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "蛤蟆油能治哮喘吗",
        "cypher": "MATCH (d:Disease {name: '哮喘'}) RETURN d.cure_way"
    },
    {
        "input": "请问脑梗塞去哪里就医",
        "cypher": "MATCH (v1:Disease {name: '脑梗塞'})-[:belongs_to]->(v2:Department) RETURN v2.name"
    },
    {
        "input": "心脏神经官能症有什么问题",
        "cypher": "MATCH (m:Disease {name:'心脏神经官能症'})-[:acompany_with]->(n:Disease) RETURN n.name"
    },
    {
        "input": "滴虫性阴道炎要怎么治疗？",
        "cypher": "MATCH (d:Disease {name: '滴虫性阴道炎'}) RETURN d.cure_way"
    },
    {
        "input": "慢性肝炎能改善吗",
        "cypher": "MATCH (d:Disease {name: '慢性肝炎'}) RETURN d.cure_way"
    },
    {
        "input": "小儿便秘咨询怎么治疗",
        "cypher": "MATCH (d:Disease {name: '小儿便秘'}) RETURN d.cure_way"
    },
    {
        "input": "慢性胃炎吃什么药比较好呢？",
        "cypher": "MATCH (v1:Disease {name: '慢性胃炎'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2"
    },
    {
        "input": "自发性气胸复发率有多高？",
        "cypher": "MATCH (m:Disease {name:'自发性气胸'}) RETURN m.get_prob"
    },
    {
        "input": "是否确诊为脑梗塞?",
        "cypher": "MATCH (m:Disease {name:'脑梗塞'}) RETURN m"
    },
    {
        "input": "阴囊湿疹怎么办？",
        "cypher": "MATCH (m:Disease {name:'阴囊湿疹'}) RETURN m.cure_way"
    },
    {
        "input": "判断早泄有哪些症状",
        "cypher": "MATCH (v1:Disease {name: '早泄'})-[:has_symptom]->(v2:Symptom) RETURN v2.name"
    },
    {
        "input": "龟头炎早期是怎样的",
        "cypher": "MATCH (m:Disease {name:'龟头炎'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "肺炎和肌肉神经痛怎样缓解",
        "cypher": "MATCH (d:Disease {name: '肺炎'}) RETURN d.cure_way"
    },
    {
        "input": "性功能障碍有什么样的表现呢？",
        "cypher": "MATCH (m:Disease)-[r1:has_symptom]->(n:Symptom) WHERE m.name = '性功能障碍' RETURN m,n"
    },
    {
        "input": "中风病人都有哪些营养呢",
        "cypher": "MATCH (m:Disease {name: '中风'})-[:do_eat]->(f:Food) RETURN f.name"
    },
    {
        "input": "新生儿脑瘫能治疗吗？",
        "cypher": "MATCH (d:Disease {name: '新生儿脑瘫'}) RETURN d.cure_way"
    },
    {
        "input": "患有前列腺囊肿，吃什么药才能好",
        "cypher": "MATCH (v1:Disease {name: '前列腺囊肿'})-[:common_drug|:recommand_drug]->(v2:Drug) RETURN v2.name"
    },
    {
        "input": "新生儿低钙血症的主要症状是什么？",
        "cypher": "MATCH (m:Disease {name:'新生儿低钙血症'})-[:has_symptom]->(n:Symptom) RETURN n.name"
    },
    {
        "input": "直肠癌传不传染",
        "cypher": "MATCH (m:Disease {name: '直肠癌'}) RETURN m.get_way"
    }
]